{
  "date": "2026-02-27",
  "segment": "builders",
  "trends": {
    "categories": {
      "DevOps & Tools": 4,
      "Infrastructure & Edge": 3,
      "ML & Open Source": 3,
      "Discovery & Early Signals": 2,
      "Raw Research (Machine Learning)": 2
    },
    "sources": {
      "Stripe Blog": 4,
      "Krebs on Security": 3,
      "Hugging Face - Blog": 3,
      "Hacker News": 2,
      "cs.AI updates on arXiv.org": 2
    },
    "topics": [
      "The Kimwolf Botnet is Stalking Your Local Network",
      "Kimwolf Botnet Lurking in Corporate, Govt. Networks",
      "Patch Tuesday, January 2026 Edition",
      "Understanding the Go Runtime: The Memory Allocator",
      "Introducing the Agentic Commerce Suite: A complete solution for selling on AI agents",
      "Create new monetization opportunities with Stripe Billing’s recent upgrades",
      "New features to help SaaS platforms manage risk and stay compliant",
      "Analyzing how SaaS platforms are shipping payments and finance products in days",
      "Show HN: Deff – Side-by-side Git diff review in your terminal",
      "How to train a new language model from scratch using Transformers and Tokenizers",
      "How to generate text: using different decoding methods for language generation with Transformers",
      "Block Sparse Matrices for Smaller and Faster Language Models",
      "AngelSlim: A more accessible, comprehensive, and efficient toolkit for large model compression",
      "Why Pass@k Optimization Can Degrade Pass@1: Prompt Interference in LLM Post-training"
    ],
    "total_articles": 14
  },
  "article_count": 14,
  "articles": [
    {
      "id": "3a57914fc489383f10b1c7921acf11a7",
      "title": "The Kimwolf Botnet is Stalking Your Local Network",
      "url": "https://krebsonsecurity.com/2026/01/the-kimwolf-botnet-is-stalking-your-local-network/",
      "published_date": "2026-02-27T06:53:38.192966",
      "description": "The story you are reading is a series of scoops nestled inside a far more urgent Internet-wide security advisory. The vulnerability at issue has been exploited for months already, and it's time for a broader awareness of the threat. The short version is that everything you thought you knew about the security of the internal network behind your Internet router probably is now dangerously out of date.",
      "source": "Krebs on Security",
      "category": "Infrastructure & Edge",
      "segment": "builders",
      "source_type": "secondary",
      "raw_content": "<p>The story you are reading is a series of scoops nestled inside a far more urgent Internet-wide security advisory. The vulnerability at issue has been exploited for months already, and it&#8217;s time for a broader awareness of the threat. The short version is that everything you thought you knew about the security of the internal network behind your Internet router probably is now dangerously out of date.</p>\n<div class=\"wp-caption aligncenter\" id=\"attachment_72960\" style=\"width: 1623px;\"><img alt=\"\" class=\"size-full wp-image-72960\" height=\"782\" src=\"https://krebsonsecurity.com/wp-content/uploads/2026/01/synthient-kimwolfmap.png\" width=\"1613\" /><p class=\"wp-caption-text\" id=\"caption-attachment-72960\">The security company Synthient currently sees more than 2 million infected Kimwolf devices distributed globally but with concentrations in Vietnam, Brazil, India, Saudi Arabia, Russia and the United States. Synthient found that two-thirds of the Kimwolf infections are Android TV boxes with no security or authentication built in.</p></div>\n<p>The past few months have witnessed the explosive growth of a new botnet dubbed <strong>Kimwolf</strong>, which experts say has infected more than 2 million devices globally. The Kimwolf malware forces compromised systems to relay malicious and abusive Internet traffic &#8212; such as ad fraud, account takeover attempts and mass content scraping &#8212; and participate in crippling distributed denial-of-service (DDoS) attacks capable of knocking nearly any website offline for days at a time.</p>\n<p>More important than Kimwolf&#8217;s staggering size, however, is the diabolical method it uses to spread so quickly: By effectively tunneling back through various &#8220;<a href=\"https://krebsonsecurity.com/2025/10/aisuru-botnet-shifts-from-ddos-to-residential-proxies/\" rel=\"noopener\" target=\"_blank\">residential proxy</a>&#8221; networks and into the local networks of the proxy endpoints, and by further infecting devices that are hidden behind the assumed protection of the user&#8217;s firewall and Internet router.</p>\n<p>Residential proxy networks are sold as a way for customers to anonymize and localize their Web traffic to a specific region, and the biggest of these services allow customers to route their traffic through devices in virtually any country or city around the globe.</p>\n<p>The malware that turns an end-user&#8217;s Internet connection into a proxy node is often bundled with dodgy mobile apps and games. These residential proxy programs also are commonly installed via <strong>unofficial Android TV boxes</strong> sold by third-party merchants on popular e-commerce sites like <strong>Amazon</strong>, <strong>BestBuy, Newegg</strong>, and <strong>Walmart</strong>.</p>\n<p>These TV boxes range in price from $40 to $400, are marketed under <a href=\"https://github.com/synthient/public-research/blob/main/2026/01/kimwolf/product_devices.csv\" rel=\"noopener\" target=\"_blank\">a dizzying range of no-name brands and model numbers</a>, and <em>frequently are advertised as a way to stream certain types of subscription video content for free</em>. But there&#8217;s a hidden cost to this transaction: As we&#8217;ll explore in a moment, these TV boxes make up a considerable chunk of the estimated two million systems currently infected with Kimwolf.</p>\n<div class=\"wp-caption aligncenter\" id=\"attachment_72949\" style=\"width: 756px;\"><a href=\"https://krebsonsecurity.com/wp-content/uploads/2025/12/u-androidtv-kimwolf.png\" rel=\"noopener\" target=\"_blank\"><img alt=\"\" class=\"wp-image-72949\" height=\"427\" src=\"https://krebsonsecurity.com/wp-content/uploads/2025/12/u-androidtv-kimwolf.png\" width=\"746\" /></a><p class=\"wp-caption-text\" id=\"caption-attachment-72949\">Some of the unsanctioned Android TV boxes that come with residential proxy malware pre-installed. Image: Synthient.</p></div>\n<p>Kimwolf also is quite good at infecting a range of Internet-connected digital photo frames that likewise are abundant at major e-commerce websites. In November 2025, researchers from <strong>Quokka</strong> published <a href=\"https://go.quokka.io/hubfs/App-Intel/Technical_Uhale-Digital-Picture-Frame-Security-Assessment.pdf?is=1ef7934f6635b02395adcab09a0c1b24bf0ea745b648bfe87189de8aadc7300b\" rel=\"noopener\" target=\"_blank\">a report</a> (PDF) detailing serious security issues in Android-based digital picture frames running the <strong>Uhale app &#8212; </strong>including Amazon&#8217;s bestselling digital frame as of March 2025.</p>\n<p>There are two major security problems with these photo frames and unofficial Android TV boxes. The first is that a considerable percentage of them come with malware pre-installed, or else require the user to download an unofficial Android App Store and malware in order to use the device for its stated purpose (video content piracy). The most typical of these uninvited guests are small programs that turn the device into a residential proxy node that is resold to others.</p>\n<p>The second big security nightmare with these photo frames and unsanctioned Android TV boxes is that they rely on a handful of Internet-connected microcomputer boards that have no discernible security or authentication requirements built-in. In other words, if you are on the same network as one or more of these devices, you can likely compromise them simultaneously by issuing a single command across the network.</p>\n<h2>THERE&#8217;S NO PLACE LIKE 127.0.0.1</h2>\n<p>The combination of these two security realities came to the fore in October 2025, when an undergraduate computer science student at the <strong>Rochester Institute of Technology</strong> began closely tracking Kimwolf&#8217;s growth, and interacting directly with its apparent creators on a daily basis.</p>\n<p><strong>Benjamin Brundage </strong>is the 22-year-old founder of the security firm <strong>Synthient</strong>, a startup that helps companies detect proxy networks and learn how those networks are being abused. Conducting much of his research into Kimwolf while studying for final exams, Brundage told KrebsOnSecurity in late October 2025 he suspected Kimwolf was a new Android-based variant of <strong>Aisuru</strong>, a botnet that was <a href=\"https://krebsonsecurity.com/2025/10/ddos-botnet-aisuru-blankets-us-isps-in-record-ddos/\" rel=\"noopener\" target=\"_blank\">incorrectly blamed</a> for a number of record-smashing DDoS attacks last fall.</p>\n<p>Brundage says Kimwolf grew rapidly by abusing a glaring vulnerability in many of the world&#8217;s largest residential proxy services. The crux of the weakness, he explained, was that these proxy services weren&#8217;t doing enough to prevent their customers from forwarding requests to internal servers of the individual proxy endpoints.</p>\n<p>Most proxy services take basic steps to prevent their paying customers from &#8220;going upstream&#8221; into the local network of proxy endpoints, by explicitly denying requests for local addresses specified in <a href=\"https://datatracker.ietf.org/doc/html/rfc1918\" rel=\"noopener\" target=\"_blank\">RFC-1918</a>, including the well-known <a href=\"https://www.geeksforgeeks.org/computer-networks/network-address-translation-nat/\" rel=\"noopener\" target=\"_blank\">Network Address Translation</a> (NAT) ranges 10.0.0.0/8, 192.168.0.0/16, and 172.16.0.0/12. These ranges allow multiple devices in a private network to access the Internet using a single public IP address, and if you run any kind of home or office network, your internal address space operates within one or more of these NAT ranges.</p>\n<p>However, Brundage discovered that the people operating Kimwolf had figured out how to talk directly to devices on the internal networks of millions of residential proxy endpoints, simply by changing their <strong>Domain Name System</strong> (DNS) settings to match those in the RFC-1918 address ranges.</p>\n<p>&#8220;It is possible to circumvent existing domain restrictions by using DNS records that point to 192.168.0.1 or 0.0.0.0,&#8221; Brundage wrote in a first-of-its-kind security advisory sent to nearly a dozen residential proxy providers in mid-December 2025. &#8220;This grants an attacker the ability to send carefully crafted requests to the current device or a device on the local network. This is actively being exploited, with attackers leveraging this functionality to drop malware.&#8221;</p>\n<p>As with the digital photo frames mentioned above, many of these residential proxy services run solely on mobile devices that are running some game, VPN or other app with a hidden component that turns the user&#8217;s mobile phone into a residential proxy &#8212; often without any meaningful consent.</p>\n<p>In <a href=\"https://synthient.com/blog/a-broken-system-fueling-botnets\" rel=\"noopener\" target=\"_blank\">a report published today</a>, Synthient said key actors involved in Kimwolf were observed monetizing the botnet through app installs, selling residential proxy bandwidth, and selling its DDoS functionality.</p>\n<p>&#8220;Synthient expects to observe a growing interest among threat actors in gaining unrestricted access to proxy networks to infect devices, obtain network access, or access sensitive information,&#8221; the report observed. &#8220;Kimwolf highlights the risks posed by unsecured proxy networks and their viability as an attack vector.&#8221;</p>\n<h2>ANDROID DEBUG BRIDGE</h2>\n<p>After purchasing a number of unofficial Android TV box models that were most heavily represented in the Kimwolf botnet, Brundage further discovered the proxy service vulnerability was only part of the reason for Kimwolf&#8217;s rapid rise: He also found virtually all of the devices he tested were shipped from the factory with a powerful feature called <strong>Android Debug Bridge</strong> (ADB) mode enabled by default.</p>\n<div class=\"wp-caption aligncenter\" id=\"attachment_72951\" style=\"width: 661px;\"><img alt=\"\" class=\"size-full wp-image-72951\" height=\"611\" src=\"https://krebsonsecurity.com/wp-content/uploads/2025/12/china-overseasuseonly.png\" width=\"651\" /><p class=\"wp-caption-text\" id=\"caption-attachment-72951\">Many of the unofficial Android TV boxes infected by Kimwolf include the ominous disclaimer: &#8220;Made in China. Overseas use only.&#8221; Image: Synthient.</p></div>\n<p>ADB is a diagnostic tool intended for use solely during the manufacturing and testing processes, because it allows the devices to be remotely configured and even updated with new (and potentially malicious) firmware. However, shipping these devices with ADB turned on creates a security nightmare because in this state they constantly listen for and accept unauthenticated connection requests.</p>\n<p>For example, opening a command prompt and typing &#8220;adb connect&#8221; along with a vulnerable device&#8217;s (local) IP address followed immediately by &#8220;:5555&#8221; will very quickly offer unrestricted &#8220;super user&#8221; administrative access.</p>\n<p>Brundage said by early December, he&#8217;d identified a one-to-one overlap between new Kimwolf infections and proxy IP addresses offered for rent by China-based <strong>IPIDEA</strong>, currently the world&#8217;s largest residential proxy network by all accounts.</p>\n<p>&#8220;Kimwolf has almost doubled in size this past week, just by exploiting IPIDEA&#8217;s proxy pool,&#8221; Brundage told KrebsOnSecurity in early December as he was preparing to notify IPIDEA and 10 other proxy providers about his research.</p>\n<p>Brundage said Synthient first confirmed on December 1, 2025 that the Kimwolf botnet operators were tunneling back through IPIDEA&#8217;s proxy network and into the local networks of systems running IPIDEA&#8217;s proxy software. The attackers dropped the malware payload by directing infected systems to visit a specific Internet address and to call out the pass phrase &#8220;<strong>krebsfiveheadindustries</strong>&#8221; in order to unlock the malicious download.</p>\n<p>On December 30, Synthient said it was tracking roughly 2 million IPIDEA addresses exploited by Kimwolf in the previous week. Brundage said he has witnessed Kimwolf rebuilding itself after one recent takedown effort targeting its control servers &#8212; from almost nothing to two million infected systems just by tunneling through proxy endpoints on IPIDEA for a couple of days.</p>\n<p>Brundage said IPIDEA has a seemingly inexhaustible supply of new proxies, <em>advertising access to more than 100 million residential proxy endpoints around the globe in the past week alone</em>. Analyzing the exposed devices that were part of IPIDEA&#8217;s proxy pool, Synthient said it found <em>more than two-thirds were Android devices that could be compromised with no authentication needed</em>.</p>\n<h2>SECURITY NOTIFICATION AND RESPONSE</h2>\n<p>After charting a tight overlap in Kimwolf-infected IP addresses and those sold by IPIDEA, Brundage was eager to make his findings public: The vulnerability had clearly been exploited for several months, although it appeared that only a handful of cybercrime actors were aware of the capability. But he also knew that going public without giving vulnerable proxy providers an opportunity to understand and patch it would only lead to more mass abuse of these services by additional cybercriminal groups.</p>\n<p>On December 17, Brundage sent a security notification to all 11 of the apparently affected proxy providers, hoping to give each at least a few weeks to acknowledge and address the core problems identified in his report before he went public. Many proxy providers who received the notification were resellers of IPIDEA that white-labeled the company&#8217;s service.</p>\n<p>KrebsOnSecurity first sought comment from IPIDEA in October 2025, in reporting on a story about how the proxy network appeared to have benefitted from the rise of the <a href=\"https://krebsonsecurity.com/2025/10/aisuru-botnet-shifts-from-ddos-to-residential-proxies/\" rel=\"noopener\" target=\"_blank\">Aisuru botnet</a>, whose administrators appeared to shift from using the botnet primarily for DDoS attacks to simply installing IPIDEA&#8217;s proxy program, among others.</p>\n<p>On December 25, KrebsOnSecurity received an email from an IPIDEA employee identified only as &#8220;<strong>Oliver</strong>,&#8221; who said allegations that IPIDEA had benefitted from Aisuru&#8217;s rise were baseless.</p>\n<p>&#8220;After comprehensively verifying IP traceability records and supplier cooperation agreements, we found no association between any of our IP resources and the Aisuru botnet, nor have we received any notifications from authoritative institutions regarding our IPs being involved in malicious activities,&#8221; Oliver wrote. &#8220;In addition, for external cooperation, we implement a three-level review mechanism for suppliers, covering qualification verification, resource legality authentication and continuous dynamic monitoring, to ensure no compliance risks throughout the entire cooperation process.&#8221;</p>\n<p>&#8220;IPIDEA firmly opposes all forms of unfair competition and malicious smearing in the industry, always participates in market competition with compliant operation and honest cooperation, and also calls on the entire industry to jointly abandon irregular and unethical behaviors and build a clean and fair market ecosystem,&#8221; Oliver continued.</p>\n<p>Meanwhile, the same day that Oliver&#8217;s email arrived, Brundage shared a response he&#8217;d just received from IPIDEA&#8217;s security officer, who identified himself only by the first name <strong>Byron</strong>. The security officer said IPIDEA had made a number of important security changes to its residential proxy service to address the vulnerability identified in Brundage&#8217;s report.</p>\n<p>&#8220;By design, the proxy service does not allow access to any internal or local address space,&#8221; Byron explained. &#8220;This issue was traced to a legacy module used solely for testing and debugging purposes, which did not fully inherit the internal network access restrictions. Under specific conditions, this module could be abused to reach internal resources. The affected paths have now been fully blocked and the module has been taken offline.&#8221;</p>\n<p>Byron told Brundage IPIDEA also instituted multiple mitigations for blocking DNS resolution to internal (NAT) IP ranges, and that it was now blocking proxy endpoints from forwarding traffic on &#8220;high-risk&#8221; ports &#8220;to prevent abuse of the service for scanning, lateral movement, or access to internal services.&#8221;</p>\n<div class=\"wp-caption aligncenter\" id=\"attachment_72905\" style=\"width: 759px;\"><a href=\"https://krebsonsecurity.com/wp-content/uploads/2025/12/ipidea-byron.png\" rel=\"noopener\" target=\"_blank\"><img alt=\"\" class=\"wp-image-72905\" height=\"366\" src=\"https://krebsonsecurity.com/wp-content/uploads/2025/12/ipidea-byron.png\" width=\"749\" /></a><p class=\"wp-caption-text\" id=\"caption-attachment-72905\">An excerpt from an email sent by IPIDEA&#8217;s security officer in response to Brundage&#8217;s vulnerability notification. Click to enlarge.</p></div>\n<p>Brundage said IPIDEA appears to have successfully patched the vulnerabilities he identified. He also noted he never observed the Kimwolf actors targeting proxy services other than IPIDEA, which has not responded to requests for comment.</p>\n<p><span id=\"more-72836\"></span></p>\n<p><strong>Riley Kilmer</strong> is founder of <a href=\"https://spur.us\" rel=\"noopener\" target=\"_blank\">Spur.us</a>, a technology firm that helps companies identify and filter out proxy traffic. Kilmer said Spur has tested Brundage&#8217;s findings and confirmed that IPIDEA and all of its affiliate resellers indeed allowed full and unfiltered access to the local LAN.</p>\n<p>Kilmer said one model of unsanctioned Android TV boxes that is especially popular &#8212; the <strong>Superbox,</strong> which we profiled in November&#8217;s <a href=\"https://krebsonsecurity.com/2025/11/is-your-android-tv-streaming-box-part-of-a-botnet/\" rel=\"noopener\" target=\"_blank\">Is Your Android TV Streaming Box Part of a Botnet?</a> &#8212; leaves Android Debug Mode running on localhost:5555.</p>\n<p>&#8220;And since Superbox turns the IP into an IPIDEA proxy, a bad actor just has to use the proxy to localhost on that port and install whatever bad SDKs [software development kits] they want,&#8221; Kilmer told KrebsOnSecurity.</p>\n<div class=\"wp-caption aligncenter\" id=\"attachment_72634\" style=\"width: 757px;\"><img alt=\"\" class=\" wp-image-72634\" height=\"405\" src=\"https://krebsonsecurity.com/wp-content/uploads/2025/11/superbox-walmart.png\" width=\"747\" /><p class=\"wp-caption-text\" id=\"caption-attachment-72634\">Superbox media streaming boxes for sale on Walmart.com.</p></div>\n<h2>ECHOES FROM THE PAST</h2>\n<p>Both Brundage and Kilmer say IPIDEA appears to be the second or third reincarnation of a residential proxy network formerly known as <strong>911S5 Proxy</strong>, a service that operated between 2014 and 2022 and was wildly popular on cybercrime forums. 911S5 Proxy <a href=\"https://krebsonsecurity.com/2022/07/911-proxy-service-implodes-after-disclosing-breach/\" rel=\"noopener\" target=\"_blank\">imploded</a> a week after KrebsOnSecurity published <a href=\"https://krebsonsecurity.com/2022/07/a-deep-dive-into-the-residential-proxy-service-911/\" rel=\"noopener\" target=\"_blank\">a deep dive on the service&#8217;s sketchy origins and leadership</a> in China.</p>\n<p>In that 2022 profile, we cited work by researchers at the <strong>University of Sherbrooke</strong> in Canada who were studying the threat 911S5 could pose to internal corporate networks. The researchers noted that “the infection of a node enables the 911S5 user to access shared resources on the network such as local intranet portals or other services.”</p>\n<p>“It also enables the end user to probe the LAN network of the infected node,” the researchers <a href=\"https://web.archive.org/web/20220715000000*/https://gric.recherche.usherbrooke.ca/rpaas/\" rel=\"noopener\" target=\"_blank\">explained</a>. “Using the internal router, it would be possible to poison the DNS cache of the LAN router of the infected node, enabling further attacks.”</p>\n<p>911S5 initially responded to our reporting in 2022 by claiming it was conducting a top-down security review of the service. But the proxy service abruptly closed up shop just one week later, saying a malicious hacker had destroyed all of the company&#8217;s customer and payment records. In July 2024, The <strong>U.S. Department of the Treasury</strong> <a href=\"https://krebsonsecurity.com/2024/05/treasury-sanctions-creators-of-911-s5-proxy-botnet/\" rel=\"noopener\" target=\"_blank\">sanctioned the alleged creators of 911S5</a>, and the <strong>U.S. Department of Justice</strong> arrested the Chinese national named in my 2022 profile of the proxy service.</p>\n<p>Kilmer said IPIDEA also operates a sister service called <strong>922 Proxy</strong>, which the company has pitched from Day One as a seamless alternative to 911S5 Proxy.</p>\n<p>&#8220;You cannot tell me they don&#8217;t want the 911 customers by calling it that,&#8221; Kilmer said.</p>\n<p>Among the recipients of Synthient&#8217;s notification was the proxy giant <strong>Oxylabs</strong>. Brundage shared an email he received from Oxylabs&#8217; security team on December 31, which acknowledged Oxylabs had started rolling out security modifications to address the vulnerabilities described in Synthient&#8217;s report.</p>\n<p>Reached for comment, Oxylabs confirmed they &#8220;have implemented changes that now eliminate the ability to bypass the blocklist and forward requests to private network addresses using a controlled domain.&#8221; But it said there is no evidence that Kimwolf or other other attackers exploited its network.</p>\n<p>&#8220;In parallel, we reviewed the domains identified in the reported exploitation activity and did not observe traffic associated with them,&#8221; the Oxylabs statement continued. &#8220;Based on this review, there is no indication that our residential network was impacted by these activities.&#8221;</p>\n<h2>PRACTICAL IMPLICATIONS</h2>\n<p>Consider the following scenario, in which the mere act of allowing someone to use your Wi-Fi network could lead to a Kimwolf botnet infection. In this example, a friend or family member comes to stay with you for a few days, and you grant them access to your Wi-Fi without knowing that their mobile phone is infected with an app that turns the device into a residential proxy node. At that point, your home&#8217;s public IP address will show up for rent at the website of some residential proxy provider.</p>\n<p>Miscreants like those behind Kimwolf then use residential proxy services online to access that proxy node on your IP, tunnel back through it and into your local area network (LAN), and automatically scan the internal network for devices with Android Debug Bridge mode turned on.</p>\n<p>By the time your guest has packed up their things, said their goodbyes and disconnected from your Wi-Fi, you now have two devices on your local network &#8212; a digital photo frame and an unsanctioned Android TV box &#8212; that are infected with Kimwolf. You may have never intended for these devices to be exposed to the larger Internet, and yet there you are.</p>\n<p>Here&#8217;s another possible nightmare scenario: Attackers use their access to proxy networks to modify your Internet router&#8217;s settings so that it relies on malicious DNS servers controlled by the attackers &#8212; allowing them to control where your Web browser goes when it requests a website. Think that&#8217;s far-fetched? Recall the <a href=\"https://krebsonsecurity.com/tag/dnschanger-trojan/\" rel=\"noopener\" target=\"_blank\">DNSChanger malware from 2012</a> that infected more than a half-million routers with search-hijacking malware, and ultimately spawned an entire security industry working group focused on containing and eradicating it.</p>\n<h2>XLAB</h2>\n<p>Much of what is published so far on Kimwolf has come from the Chinese security firm <strong>XLab</strong>, which was the first to <a href=\"https://blog.xlab.qianxin.com/large-scale-botnet-airashi-en/\" rel=\"noopener\" target=\"_blank\">chronicle the rise of the Aisuru botnet</a> in late 2024. In <a href=\"https://blog.xlab.qianxin.com/kimwolf-botnet-en/\" rel=\"noopener\" target=\"_blank\">its latest blog post</a>, XLab said it began tracking Kimwolf on October 24, when the botnet&#8217;s control servers were swamping Cloudflare&#8217;s DNS servers with lookups for the distinctive domain 14emeliaterracewestroxburyma02132[.]su.</p>\n<p>This domain and others connected to early Kimwolf variants spent several weeks <a href=\"https://krebsonsecurity.com/2025/11/cloudflare-scrubs-aisuru-botnet-from-top-domains-list/\" rel=\"noopener\" target=\"_blank\">topping Cloudflare&#8217;s chart of the Internet&#8217;s most sought-after domains</a>, edging out Google.com and Apple.com of their rightful spots in the top 5 most-requested domains. That&#8217;s because during that time Kimwolf was asking its millions of bots to check in frequently using Cloudflare&#8217;s DNS servers.</p>\n<div class=\"wp-caption aligncenter\" id=\"attachment_72954\" style=\"width: 757px;\"><img alt=\"\" class=\" wp-image-72954\" height=\"798\" src=\"https://krebsonsecurity.com/wp-content/uploads/2025/12/xlab-countrykimwolf.png\" width=\"747\" /><p class=\"wp-caption-text\" id=\"caption-attachment-72954\">The Chinese security firm XLab found the Kimwolf botnet had enslaved between 1.8 and 2 million devices, with heavy concentrations in Brazil, India, The United States of America and Argentina. Image: blog.xLab.qianxin.com</p></div>\n<p>It is clear from reading the XLab report that KrebsOnSecurity (and security experts) probably erred in <a href=\"https://krebsonsecurity.com/2025/11/cloudflare-scrubs-aisuru-botnet-from-top-domains-list/\" rel=\"noopener\" target=\"_blank\">misattributing some of Kimwolf&#8217;s early activities</a> to the Aisuru botnet, which appears to be operated by a different group entirely. IPDEA may have been truthful when it said it had no affiliation with the Aisuru botnet, but Brundage&#8217;s data left no doubt that its proxy service clearly was being massively abused by Aisuru&#8217;s Android variant, Kimwolf.</p>\n<p>XLab said Kimwolf has infected at least 1.8 million devices, and has shown it is able to rebuild itself quickly from scratch.</p>\n<p>&#8220;Analysis indicates that Kimwolf&#8217;s primary infection targets are TV boxes deployed in residential network environments,&#8221; XLab researchers wrote. &#8220;Since residential networks usually adopt dynamic IP allocation mechanisms, the public IPs of devices change over time, so the true scale of infected devices cannot be accurately measured solely by the quantity of IPs. In other words, the cumulative observation of 2.7 million IP addresses does not equate to 2.7 million infected devices.&#8221;</p>\n<p>XLab said measuring Kimwolf&#8217;s size also is difficult because infected devices are distributed across multiple global time zones. &#8220;Affected by time zone differences and usage habits (e.g., turning off devices at night, not using TV boxes during holidays, etc.), these devices are not online simultaneously, further increasing the difficulty of comprehensive observation through a single time window,&#8221; the blog post observed.</p>\n<p>XLab noted that the Kimwolf author shows an almost &#8216;obsessive&#8217; fixation&#8221; on Yours Truly, apparently leaving &#8220;easter eggs&#8221; related to my name in multiple places through the botnet&#8217;s code and communications:</p>\n<div class=\"wp-caption aligncenter\" id=\"attachment_72955\" style=\"width: 745px;\"><img alt=\"\" class=\" wp-image-72955\" height=\"702\" src=\"https://krebsonsecurity.com/wp-content/uploads/2025/12/xlab-kimwolfk.png\" width=\"735\" /><p class=\"wp-caption-text\" id=\"caption-attachment-72955\">Image: XLAB.</p></div>\n<h2>ANALYSIS AND ADVICE</h2>\n<p>One frustrating aspect of threats like Kimwolf is that in most cases it is not easy for the average user to determine if there are any devices on their internal network which may be vulnerable to threats like Kimwolf and/or already infected with residential proxy malware.</p>\n<p>Let&#8217;s assume that through years of security training or some dark magic you can successfully identify that residential proxy activity on your internal network was linked to a specific mobile device inside your house: From there, you&#8217;d still need to isolate and remove the app or unwanted component that is turning the device into a residential proxy.</p>\n<p>Also, the tooling and knowledge needed to achieve this kind of visibility just isn&#8217;t there from an average consumer standpoint. The work that it takes to configure your network so you can see and interpret logs of all traffic coming in and out is largely beyond the skillset of most Internet users (and, I&#8217;d wager, many security experts). But it&#8217;s a topic worth exploring in an upcoming story.</p>\n<p>Happily, Synthient has erected <a href=\"https://synthient.com/check\" rel=\"noopener\" target=\"_blank\">a page on its website</a> that will state whether a visitor&#8217;s public Internet address was seen among those of Kimwolf-infected systems. Brundage also has compiled <a href=\"https://github.com/synthient/public-research/blob/main/2026/01/kimwolf/product_devices.csv\" rel=\"noopener\" target=\"_blank\">a list of the unofficial Android TV boxes</a> that are most highly represented in the Kimwolf botnet.</p>\n<p>If you own a TV box that matches one of these model names and/or numbers, please just rip it out of your network. If you encounter one of these devices on the network of a family member or friend, send them a link to this story and explain that it&#8217;s not worth the potential hassle and harm created by keeping them plugged in.</p>\n<div class=\"wp-caption aligncenter\" id=\"attachment_72953\" style=\"width: 760px;\"><img alt=\"\" class=\" wp-image-72953\" height=\"372\" src=\"https://krebsonsecurity.com/wp-content/uploads/2025/12/synthient-topproductdevices.png\" width=\"750\" /><p class=\"wp-caption-text\" id=\"caption-attachment-72953\">The top 15 product devices represented in the Kimwolf botnet, according to Synthient.</p></div>\n<p><strong>Chad Seaman</strong> is a principal security researcher with <strong>Akamai Technologies</strong>. Seaman said he wants more consumers to be wary of these pseudo Android TV boxes to the point where they avoid them altogether.</p>\n<p>&#8220;I want the consumer to be paranoid of these crappy devices and of these residential proxy schemes,&#8221; he said. &#8220;We need to highlight why they&#8217;re dangerous to everyone and to the individual. The whole security model where people think their LAN (Local Internal Network) is safe, that there aren&#8217;t any bad guys on the LAN so it can&#8217;t be that dangerous is just really outdated now.&#8221;</p>\n<p>&#8220;The idea that an app can enable this type of abuse on my network and other networks, that should really give you pause,&#8221; about which devices to allow onto your local network, Seaman said. &#8220;And it&#8217;s not just Android devices here. Some of these proxy services have SDKs for Mac and Windows, and the iPhone. It could be running something that inadvertently cracks open your network and lets countless random people inside.&#8221;</p>\n<p>In July 2025, Google filed a “John Doe” <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.nysd.643466/gov.uscourts.nysd.643466.22.0.pdf\" rel=\"noopener\" target=\"_blank\">lawsuit</a> (PDF) against 25 unidentified defendants collectively dubbed the “<strong>BadBox 2.0 Enterprise</strong>,” which Google described as a botnet of over ten million unsanctioned Android streaming devices engaged in advertising fraud. Google said the BADBOX 2.0 botnet, in addition to compromising multiple types of devices prior to purchase, also can infect devices by requiring the download of malicious apps from unofficial marketplaces.</p>\n<p>Google’s lawsuit came on the heels of a <a href=\"https://www.ic3.gov/PSA/2025/PSA250605\" rel=\"noopener\" target=\"_blank\">June 2025 advisory</a> from the <strong>Federal Bureau of Investigation</strong> (FBI), which warned that cyber criminals were gaining unauthorized access to home networks by either configuring the products with malware prior to the user’s purchase, or infecting the device as it downloads required applications that contain backdoors &#8212; usually during the set-up process.</p>\n<p>The FBI said BADBOX 2.0 was discovered after the original BADBOX campaign was disrupted in 2024. The original BADBOX was identified in 2023, and primarily consisted of Android operating system devices that were compromised with backdoor malware prior to purchase.</p>\n<p><strong>Lindsay Kaye</strong> is vice president of threat intelligence at <strong>HUMAN Security</strong>, a company that worked closely on the BADBOX investigations. Kaye said the BADBOX botnets and the residential proxy networks that rode on top of compromised devices were detected because they enabled a ridiculous amount of advertising fraud, as well as ticket scalping, retail fraud, account takeovers and content scraping.</p>\n<p>Kaye said consumers should stick to known brands when it comes to purchasing things that require a wired or wireless connection.</p>\n<p>&#8220;If people are asking what they can do to avoid being victimized by proxies, it&#8217;s safest to stick with name brands,&#8221; Kaye said. &#8220;Anything promising something for free or low-cost, or giving you something for nothing just isn&#8217;t worth it. And be careful about what apps you allow on your phone.&#8221;</p>\n<p>Many wireless routers these days make it relatively easy to deploy a &#8220;Guest&#8221; wireless network on-the-fly. Doing so allows your guests to browse the Internet just fine but it blocks their device from being able to talk to other devices on the local network &#8212; such as shared folders, printers and drives. If someone &#8212; a friend, family member, or contractor &#8212; requests access to your network, give them the guest Wi-Fi network credentials if you have that option.</p>\n<p>There is a small but vocal pro-piracy camp that is almost condescendingly dismissive of the security threats posed by these unsanctioned Android TV boxes. These tech purists positively chafe at the idea of people wholesale discarding one of these TV boxes. A common refrain from this camp is that Internet-connected devices are not inherently bad or good, and that even factory-infected boxes can be flashed with new firmware or custom ROMs that contain no known dodgy software.</p>\n<p>However, it&#8217;s important to point out that the majority of people buying these devices are not security or hardware experts; the devices are sought out because they dangle something of value for &#8220;free.&#8221; Most buyers have no idea of the bargain they&#8217;re making when plugging one of these dodgy TV boxes into their network.</p>\n<p>It is somewhat remarkable that we haven&#8217;t yet seen the entertainment industry applying more visible pressure on the major e-commerce vendors to stop peddling this insecure and actively malicious hardware that is largely made and marketed for video piracy. These TV boxes are a public nuisance for bundling malicious software while having no apparent security or authentication built-in, and these two qualities make them an attractive nuisance for cybercriminals.</p>\n<p>Stay tuned for Part II in this series, which will poke through clues left behind by the people who appear to have built Kimwolf and benefited from it the most.</p>",
      "tier": "full",
      "selection_reason": "Critical security vulnerability affecting enterprise networks requires immediate attention from infrastructure teams",
      "audience_value": "Actionable intelligence about active threats to corporate networks",
      "urgency_score": 10,
      "category_tag": "🔐 Security"
    },
    {
      "id": "47049a7169772dd6a23256ccf18b9e70",
      "title": "Kimwolf Botnet Lurking in Corporate, Govt. Networks",
      "url": "https://krebsonsecurity.com/2026/01/kimwolf-botnet-lurking-in-corporate-govt-networks/",
      "published_date": "2026-02-27T06:53:38.192886",
      "description": "A new Internet-of-Things botnet called Kimwolf has spread to more than 2 million devices, forcing infected systems to participate in massive distributed denial-of-service (DDoS) attacks and to relay other malicious and abusive Internet traffic. Kimwolf's ability to scan the local networks of compromised systems for other IoT devices to infect makes it a sobering threat to organizations, and new research reveals Kimwolf is surprisingly prevalent in government and corporate networks.",
      "source": "Krebs on Security",
      "category": "Infrastructure & Edge",
      "segment": "builders",
      "source_type": "secondary",
      "raw_content": "<p>A new Internet-of-Things (IoT) botnet called <strong>Kimwolf</strong> has spread to more than 2 million devices, forcing infected systems to participate in massive distributed denial-of-service (DDoS) attacks and to relay other malicious and abusive Internet traffic. Kimwolf&#8217;s ability to scan the local networks of compromised systems for other IoT devices to infect makes it a sobering threat to organizations, and new research reveals Kimwolf is surprisingly prevalent in government and corporate networks.</p>\n<div class=\"wp-caption aligncenter\" id=\"attachment_73083\" style=\"width: 625px;\"><img alt=\"\" class=\"size-full wp-image-73083\" height=\"615\" src=\"https://krebsonsecurity.com/wp-content/uploads/2026/01/ss-botnet.png\" width=\"615\" /><p class=\"wp-caption-text\" id=\"caption-attachment-73083\">Image: Shutterstock, @Elzicon.</p></div>\n<p>Kimwolf grew rapidly in the waning months of 2025 by tricking various &#8220;residential proxy&#8221; services into relaying malicious commands to devices on the local networks of those proxy endpoints. Residential proxies are sold as a way to anonymize and localize one&#8217;s Web traffic to a specific region, and the biggest of these services allow customers to route their Internet activity through devices in virtually any country or city around the globe.</p>\n<p>The malware that turns one&#8217;s Internet connection into a proxy node is often quietly bundled with various mobile apps and games, and it typically forces the infected device to relay malicious and abusive traffic &#8212; including ad fraud, account takeover attempts, and mass content-scraping.</p>\n<p>Kimwolf mainly targeted proxies from <strong>IPIDEA</strong>, a Chinese service that has millions of proxy endpoints for rent on any given week. The Kimwolf operators discovered they could <a href=\"https://krebsonsecurity.com/2026/01/the-kimwolf-botnet-is-stalking-your-local-network/\" rel=\"noopener\" target=\"_blank\">forward malicious commands</a> to the internal networks of IPIDEA proxy endpoints, and then programmatically scan for and infect other vulnerable devices on each endpoint&#8217;s local network.</p>\n<p>Most of the systems compromised through Kimwolf&#8217;s local network scanning have been unofficial Android TV streaming boxes. These are typically Android Open Source Project devices &#8212; not Android TV OS devices or Play Protect certified Android devices &#8212; and they are generally marketed as a way to watch unlimited (read:pirated) video content from popular subscription streaming services for a one-time fee.</p>\n<p>However, a great many of these TV boxes ship to consumers with residential proxy software pre-installed. What&#8217;s more, they have no real security or authentication built-in: If you can communicate directly with the TV box, you can also easily compromise it with malware.</p>\n<p>While IPIDEA and other affected proxy providers recently have taken steps to block threats like Kimwolf from going upstream into their endpoints (reportedly with varying degrees of success), the Kimwolf malware remains on millions of infected devices.</p>\n<div class=\"wp-caption aligncenter\" id=\"attachment_73086\" style=\"width: 757px;\"><img alt=\"\" class=\" wp-image-73086\" height=\"377\" src=\"https://krebsonsecurity.com/wp-content/uploads/2026/01/ipidea2023.png\" width=\"747\" /><p class=\"wp-caption-text\" id=\"caption-attachment-73086\">A screenshot of IPIDEA&#8217;s proxy service.</p></div>\n<p>Kimwolf&#8217;s close association with residential proxy networks and compromised Android TV boxes might suggest we&#8217;d find relatively few infections on corporate networks. However, the security firm <strong>Infoblox</strong> said a recent review of its customer traffic found <em>nearly 25 percent of them made a query to a Kimwolf-related domain name since October 1, 2025</em>, when the botnet first showed signs of life.</p>\n<p>Infoblox found the affected customers are based all over the world and in a wide range of industry verticals, from education and healthcare to government and finance.</p>\n<p>&#8220;To be clear, this suggests that nearly 25% of customers had at least one device that was an endpoint in a residential proxy service targeted by Kimwolf operators,&#8221; Infoblox <a href=\"https://www.infoblox.com/blog/threat-intelligence/kimwolf-howls-from-inside-the-enterprise/\" rel=\"noopener\" target=\"_blank\">explained</a>. &#8220;Such a device, maybe a phone or a laptop, was essentially co-opted by the threat actor to probe the local network for vulnerable devices. A query means a scan was made, not that new devices were compromised. Lateral movement would fail if there were no vulnerable devices to be found or if the DNS resolution was blocked.&#8221;<span id=\"more-73065\"></span></p>\n<p><strong>Synthient</strong>, a startup that tracks proxy services and was <a href=\"https://krebsonsecurity.com/2026/01/the-kimwolf-botnet-is-stalking-your-local-network/\" rel=\"noopener\" target=\"_blank\">the first to disclose on January 2</a> the unique methods Kimwolf uses to spread, found proxy endpoints from IPIDEA were present in alarming numbers at government and academic institutions worldwide. Synthient said it spied at least 33,000 affected Internet addresses at universities and colleges, and nearly 8,000 IPIDEA proxies within various U.S. and foreign government networks.</p>\n<div class=\"wp-caption aligncenter\" id=\"attachment_73093\" style=\"width: 759px;\"><img alt=\"\" class=\" wp-image-73093\" height=\"461\" src=\"https://krebsonsecurity.com/wp-content/uploads/2026/01/top50targetedomains.jpeg\" width=\"749\" /><p class=\"wp-caption-text\" id=\"caption-attachment-73093\">The top 50 domain names sought out by users of IPIDEA&#8217;s residential proxy service, according to Synthient.</p></div>\n<p>In a webinar on January 16, experts at the proxy tracking service <strong>Spur</strong> profiled Internet addresses associated with IPIDEA and 10 other proxy services that were thought to be vulnerable to Kimwolf&#8217;s tricks. Spur found residential proxies in nearly 300 government owned and operated networks, 318 utility companies, 166 healthcare companies or hospitals, and 141 companies in banking and finance.</p>\n<p>&#8220;I looked at the 298 [government] owned and operated [networks], and so many of them were DoD [U.S. Department of Defense], which is kind of terrifying that DoD has IPIDEA and these other proxy services located inside of it,&#8221; Spur Co-Founder <strong>Riley Kilmer</strong> said. &#8220;I don&#8217;t know how these enterprises have these networks set up. It could be that [infected devices] are segregated on the network, that even if you had local access it doesn&#8217;t really mean much. However, it&#8217;s something to be aware of. If a device goes in, anything that device has access to the proxy would have access to.&#8221;</p>\n<p>Kilmer said Kimwolf demonstrates how a single residential proxy infection can quickly lead to bigger problems for organizations that are harboring unsecured devices behind their firewalls, noting that proxy services present a potentially simple way for attackers to probe other devices on the local network of a targeted organization.</p>\n<p>&#8220;If you know you have [proxy] infections that are located in a company, you can chose that [network] to come out of and then locally pivot,&#8221; Kilmer said. &#8220;If you have an idea of where to start or look, now you have a foothold in a company or an enterprise based on just that.&#8221;</p>\n<p>This is the third story in our series on the Kimwolf botnet. Next week, we&#8217;ll shed light on the myriad China-based individuals and companies connected to the <a href=\"https://www.humansecurity.com/learn/blog/satori-threat-intelligence-disruption-badbox-2-0/\" rel=\"noopener\" target=\"_blank\"><strong>Badbox 2.0 botnet</strong></a>, the collective name given to <a href=\"https://github.com/synthient/public-research/blob/main/2026/01/kimwolf/product_devices.csv\" rel=\"noopener\" target=\"_blank\">a vast number of Android TV streaming box models</a> that ship with no discernible security or authentication built-in, and with residential proxy malware pre-installed.</p>\n<p>Further reading:</p>\n<p><a href=\"https://krebsonsecurity.com/2026/01/the-kimwolf-botnet-is-stalking-your-local-network/\" rel=\"noopener\" target=\"_blank\">The Kimwolf Botnet is Stalking Your Local Network</a></p>\n<p><a href=\"https://krebsonsecurity.com/2026/01/who-benefited-from-the-aisuru-and-kimwolf-botnets/\" rel=\"noopener\" target=\"_blank\">Who Benefitted from the Aisuru and Kimwolf Botnets?</a></p>\n<p><a href=\"https://synthient.com/blog/a-broken-system-fueling-botnets\" rel=\"noopener\" target=\"_blank\">A Broken System Fueling Botnets</a> (Synthient).</p>",
      "tier": "full",
      "selection_reason": "Technical details about major botnet affecting IoT devices and corporate infrastructure",
      "audience_value": "Understanding of attack vectors and mitigation strategies",
      "urgency_score": 9,
      "category_tag": "🔐 Security"
    },
    {
      "id": "fd2d24ecbc14da1149cb2ee622f928ac",
      "title": "Patch Tuesday, January 2026 Edition",
      "url": "https://krebsonsecurity.com/2026/01/patch-tuesday-january-2026-edition/",
      "published_date": "2026-02-27T06:53:38.192917",
      "description": "Microsoft today issued patches to plug at least 113 security holes in its various Windows operating systems and supported software. Eight of the vulnerabilities earned Microsoft's most-dire \"critical\" rating, and the company warns that attackers are already exploiting one of the bugs fixed today.",
      "source": "Krebs on Security",
      "category": "Infrastructure & Edge",
      "segment": "builders",
      "source_type": "secondary",
      "raw_content": "<p><strong>Microsoft</strong> today issued patches to plug at least 113 security holes in its various <strong>Windows</strong> operating systems and supported software. Eight of the vulnerabilities earned Microsoft&#8217;s most-dire &#8220;critical&#8221; rating, and the company warns that attackers are already exploiting one of the bugs fixed today.</p>\n<p><img alt=\"\" class=\" wp-image-56287 aligncenter\" height=\"521\" src=\"https://krebsonsecurity.com/wp-content/uploads/2021/07/windupate.png\" width=\"740\" /></p>\n<p>January&#8217;s Microsoft zero-day flaw &#8212; <a href=\"https://msrc.microsoft.com/update-guide/en-US/advisory/CVE-2026-20805\" rel=\"noopener\" target=\"_blank\">CVE-2026-20805</a> &#8212; is brought to us by a flaw in the <strong>Desktop Window Manager</strong> (DWM), a key component of Windows that organizes windows on a user&#8217;s screen. <strong>Kev Breen</strong>, senior director of cyber threat research at <strong>Immersive</strong>, said despite awarding CVE-2026-20805 a middling CVSS score of 5.5, Microsoft has confirmed its active exploitation in the wild, indicating that threat actors are already leveraging this flaw against organizations.</p>\n<p>Breen said vulnerabilities of this kind are commonly used to undermine <a href=\"https://en.wikipedia.org/wiki/Address_space_layout_randomization\" rel=\"noopener\" target=\"_blank\">Address Space Layout Randomization</a> (ASLR), a core operating system security control designed to protect against buffer overflows and other memory-manipulation exploits.</p>\n<p>&#8220;By revealing where code resides in memory, this vulnerability can be chained with a separate code execution flaw, transforming a complex and unreliable exploit into a practical and repeatable attack,&#8221; Breen said. &#8220;Microsoft has not disclosed which additional components may be involved in such an exploit chain, significantly limiting defenders’ ability to proactively threat hunt for related activity. As a result, rapid patching currently remains the only effective mitigation.&#8221;</p>\n<p><strong>Chris Goettl</strong>, vice president of product management at <strong>Ivanti</strong>, observed that CVE-2026-20805 affects all currently supported and extended security update supported versions of the Windows OS. Goettl said it would be a mistake to dismiss the severity of this flaw based on its &#8220;Important&#8221; rating and relatively low CVSS score.</p>\n<p>&#8220;A risk-based prioritization methodology warrants treating this vulnerability as a higher severity than the vendor rating or CVSS score assigned,&#8221; he said.</p>\n<p>Among the critical flaws patched this month are two <strong>Microsoft Office</strong> remote code execution bugs (<a href=\"https://msrc.microsoft.com/update-guide/en-US/advisory/CVE-2026-20952\" rel=\"noopener\" target=\"_blank\">CVE-2026-20952</a> and <a href=\"https://msrc.microsoft.com/update-guide/en-US/advisory/CVE-2026-20953\" rel=\"noopener\" target=\"_blank\">CVE-2026-20953</a>) that can be triggered just by viewing a booby-trapped message in the Preview Pane.</p>\n<p>Our October 2025 Patch Tuesday <a href=\"https://krebsonsecurity.com/2025/10/patch-tuesday-october-2025-end-of-10-edition/\" rel=\"noopener\" target=\"_blank\">&#8220;End of 10&#8221; roundup</a> noted that Microsoft had removed a modem driver from all versions after it was discovered that hackers were abusing a vulnerability in it to hack into systems. <strong>Adam Barnett</strong> at <strong>Rapid7</strong> said Microsoft today removed another couple of modem drivers from Windows for a broadly similar reason: Microsoft is aware of functional exploit code for an elevation of privilege vulnerability in a very similar modem driver, tracked as <a href=\"https://msrc.microsoft.com/update-guide/en-US/advisory/CVE-2023-31096\" rel=\"noopener\" target=\"_blank\">CVE-2023-31096</a>.<span id=\"more-73059\"></span></p>\n<p>&#8220;That’s not a typo; this vulnerability was originally published via MITRE over two years ago, along with a credible public writeup by the original researcher,&#8221; Barnett said. &#8220;Today’s Windows patches remove agrsm64.sys and agrsm.sys. All three modem drivers were originally developed by the same now-defunct third party, and have been included in Windows for decades. These driver removals will pass unnoticed for most people, but you might find active modems still in a few contexts, including some industrial control systems.&#8221;</p>\n<p>According to Barnett, two questions remain: How many more legacy modem drivers are still present on a fully-patched Windows asset; and how many more elevation-to-SYSTEM vulnerabilities will emerge from them before Microsoft cuts off attackers who have been enjoying &#8220;living off the land[line] by exploiting an entire class of dusty old device drivers?&#8221;</p>\n<p>&#8220;Although Microsoft doesn’t claim evidence of exploitation for CVE-2023-31096, the relevant 2023 write-up and the 2025 removal of the other Agere modem driver have provided two strong signals for anyone looking for Windows exploits in the meantime,&#8221; Barnett said. &#8220;In case you were wondering, there is no need to have a modem connected; the mere presence of the driver is enough to render an asset vulnerable.&#8221;</p>\n<p>Immersive, Ivanti and Rapid7 all called attention to <a href=\"https://msrc.microsoft.com/update-guide/en-US/advisory/CVE-2026-21265\" rel=\"noopener\" target=\"_blank\">CVE-2026-21265</a>, which is a critical Security Feature Bypass vulnerability affecting Windows Secure Boot. This security feature is designed to protect against threats like rootkits and bootkits, and it relies on a set of certificates that are set to expire in June 2026 and October 2026. Once these 2011 certificates expire, Windows devices that do not have the new 2023 certificates can no longer receive Secure Boot security fixes.</p>\n<p>Barnett cautioned that when updating the bootloader and BIOS, it is essential to prepare fully ahead of time for the specific OS and BIOS combination you’re working with, since incorrect remediation steps can lead to an unbootable system.</p>\n<p>&#8220;Fifteen years is a very long time indeed in information security, but the clock is running out on the Microsoft root certificates which have been signing essentially everything in the Secure Boot ecosystem since the days of Stuxnet,&#8221; Barnett said. &#8220;Microsoft issued replacement certificates back in 2023, alongside CVE-2023-24932 which covered relevant Windows patches as well as subsequent steps to remediate the Secure Boot bypass exploited by the BlackLotus bootkit.&#8221;</p>\n<p>Goettl noted that <strong>Mozilla</strong> has released updates for <strong>Firefox</strong> and <strong>Firefox ESR</strong> resolving a total of 34 vulnerabilities, two of which are suspected to be exploited (CVE-2026-0891 and CVE-2026-0892). Both are resolved in Firefox 147 (MFSA2026-01) and CVE-2026-0891 is resolved in Firefox ESR 140.7 (MFSA2026-03).</p>\n<p>&#8220;Expect <strong>Google Chrome</strong> and <strong>Microsoft Edge</strong> updates this week in addition to a high severity vulnerability in Chrome WebView that was resolved in the January 6 Chrome update (CVE-2026-0628),&#8221; Goettl said.</p>\n<p>As ever, the <a href=\"https://isc.sans.edu/forums/diary/January%202026%20Microsoft%20Patch%20Tuesday%20Summary/32624/\" rel=\"noopener\" target=\"_blank\">SANS Internet Storm Center</a> has a per-patch breakdown by severity and urgency. Windows admins should keep an eye on <a href=\"https://www.askwoody.com/2026/january-2026-updates/\" rel=\"noopener\" target=\"_blank\">askwoody.com</a> for any news about patches that don&#8217;t quite play nice with everything. If you experience any issues related installing January&#8217;s patches, please drop a line in the comments below.</p>",
      "tier": "full",
      "selection_reason": "Critical Microsoft patches affecting enterprise systems",
      "audience_value": "Prioritized list of security updates requiring immediate attention",
      "urgency_score": 9,
      "category_tag": "🔐 Security"
    },
    {
      "id": "9f691c6f9b9c969b93e4bd454baf92a4",
      "title": "Understanding the Go Runtime: The Memory Allocator",
      "url": "https://internals-for-interns.com/posts/go-memory-allocator/",
      "published_date": "2026-02-27T06:53:36.882599",
      "description": "<a href=\"https://news.ycombinator.com/item?id=47129801\">Comments</a>",
      "source": "Hacker News",
      "category": "Discovery & Early Signals",
      "segment": "builders",
      "source_type": "secondary",
      "raw_content": "<a href=\"https://news.ycombinator.com/item?id=47129801\">Comments</a>",
      "tier": "full",
      "selection_reason": "Deep technical dive into Go runtime internals essential for performance optimization",
      "audience_value": "Advanced knowledge for optimizing Go-based systems",
      "urgency_score": 8,
      "category_tag": "☁️ Enterprise Tech"
    },
    {
      "id": "2db3771607d40af7e2846f3720cea6fb",
      "title": "Introducing the Agentic Commerce Suite: A complete solution for selling on AI agents",
      "url": "https://stripe.com/blog/agentic-commerce-suite",
      "published_date": "2026-02-27T06:53:38.717845",
      "description": "Today, we’re introducing the Agentic Commerce Suite: a new solution that gets your business agent-ready. It enables you to sell on AI agents more easily by making your products discoverable, simplifying your checkout, and allowing you to accept agentic payments via a single integration.",
      "source": "Stripe Blog",
      "category": "DevOps & Tools",
      "segment": "builders",
      "source_type": "primary",
      "raw_content": "Today, we’re introducing the Agentic Commerce Suite: a new solution that gets your business agent-ready. It enables you to sell on AI agents more easily by making your products discoverable, simplifying your checkout, and allowing you to accept agentic payments via a single integration.",
      "tier": "full",
      "selection_reason": "Major new infrastructure for AI commerce integration",
      "audience_value": "Technical implementation details for AI agent integration",
      "urgency_score": 8,
      "category_tag": "🚀 AI & Innovation"
    },
    {
      "id": "63344965c5aca90cbaf5c71a7eabbb21",
      "title": "Create new monetization opportunities with Stripe Billing’s recent upgrades",
      "url": "https://stripe.com/blog/create-new-monetization-opportunities-with-recent-stripe-billing-upgrades",
      "published_date": "2026-02-27T06:53:38.717906",
      "description": "We recently released a series of improvements to expand multiprocessor support, give you more control over your billing and invoicing models, and better tailor your pricing for AI products. Here’s everything that’s new.",
      "source": "Stripe Blog",
      "category": "DevOps & Tools",
      "segment": "builders",
      "source_type": "primary",
      "raw_content": "We recently released a series of improvements to expand multiprocessor support, give you more control over your billing and invoicing models, and better tailor your pricing for AI products. Here’s everything that’s new.",
      "tier": "full",
      "selection_reason": "Critical updates to payment infrastructure affecting billing systems",
      "audience_value": "Technical details for implementing new billing features",
      "urgency_score": 8,
      "category_tag": "☁️ Enterprise Tech"
    },
    {
      "id": "ffbe0e00bf9a7cb6a7f33f70b30a7efb",
      "title": "New features to help SaaS platforms manage risk and stay compliant",
      "url": "https://stripe.com/blog/new-features-to-help-saas-platforms-manage-risk-and-stay-compliant",
      "published_date": "2026-02-27T06:53:38.717886",
      "description": "We recently launched three new features that give you more control to fine-tune your risk and compliance strategy, allowing you to use more of Stripe’s data to inform your approach. Here’s what’s new.",
      "source": "Stripe Blog",
      "category": "DevOps & Tools",
      "segment": "builders",
      "source_type": "primary",
      "raw_content": "We recently launched three new features that give you more control to fine-tune your risk and compliance strategy, allowing you to use more of Stripe’s data to inform your approach. Here’s what’s new.",
      "tier": "full",
      "selection_reason": "New compliance features affecting SaaS platforms",
      "audience_value": "Implementation guidance for risk management features",
      "urgency_score": 8,
      "category_tag": "☁️ Enterprise Tech"
    },
    {
      "id": "6cbe3e5c8b1f3cbfa05e157df8d0bded",
      "title": "Analyzing how SaaS platforms are shipping payments and finance products in days",
      "url": "https://stripe.com/blog/analyzing-how-saas-platforms-are-shipping-payments-and-finance-products-in-days",
      "published_date": "2026-02-27T06:53:38.717866",
      "description": "Leading SaaS platforms across industries—from Squarespace to Jobber—are using embedded components to ship payments and finance features with minimal code. We analyzed the data to see which types of platforms are getting the most value.",
      "source": "Stripe Blog",
      "category": "DevOps & Tools",
      "segment": "builders",
      "source_type": "primary",
      "raw_content": "Leading SaaS platforms across industries—from Squarespace to Jobber—are using embedded components to ship payments and finance features with minimal code. We analyzed the data to see which types of platforms are getting the most value.",
      "tier": "full",
      "selection_reason": "Analysis of successful payment integration patterns",
      "audience_value": "Best practices for implementing payment features",
      "urgency_score": 8,
      "category_tag": "☁️ Enterprise Tech"
    },
    {
      "id": "630e101dddf65ef96f180127c2892fd9",
      "title": "Show HN: Deff – Side-by-side Git diff review in your terminal",
      "url": "https://github.com/flamestro/deff",
      "published_date": "2026-02-27T06:53:36.882559",
      "description": "<a href=\"https://news.ycombinator.com/item?id=47169518\">Comments</a>",
      "source": "Hacker News",
      "category": "Discovery & Early Signals",
      "segment": "builders",
      "source_type": "primary",
      "raw_content": "<a href=\"https://news.ycombinator.com/item?id=47169518\">Comments</a>",
      "tier": "quick",
      "selection_reason": "New developer productivity tool for code review",
      "audience_value": "Improved Git workflow efficiency",
      "urgency_score": 7,
      "category_tag": "🔧 Developer Tools"
    },
    {
      "id": "00d47c7482b5edd3ba93c2d2daa66c17",
      "title": "How to train a new language model from scratch using Transformers and Tokenizers",
      "url": "https://huggingface.co/blog/how-to-train",
      "published_date": "2026-02-27T06:53:37.240245",
      "description": "",
      "source": "Hugging Face - Blog",
      "category": "ML & Open Source",
      "segment": "builders",
      "source_type": "primary",
      "raw_content": "",
      "tier": "quick",
      "selection_reason": "Technical guide for LLM training implementation",
      "audience_value": "Practical knowledge for AI model development",
      "urgency_score": 7,
      "category_tag": "🚀 AI & Innovation"
    },
    {
      "id": "78b038b0ef44b636f59c1621cab0b756",
      "title": "How to generate text: using different decoding methods for language generation with Transformers",
      "url": "https://huggingface.co/blog/how-to-generate",
      "published_date": "2026-02-27T06:53:37.240222",
      "description": "",
      "source": "Hugging Face - Blog",
      "category": "ML & Open Source",
      "segment": "builders",
      "source_type": "primary",
      "raw_content": "",
      "tier": "quick",
      "selection_reason": "Technical implementation guide for text generation",
      "audience_value": "Practical LLM implementation techniques",
      "urgency_score": 7,
      "category_tag": "🚀 AI & Innovation"
    },
    {
      "id": "34752681558ca09fa302425ee4056e97",
      "title": "Block Sparse Matrices for Smaller and Faster Language Models",
      "url": "https://huggingface.co/blog/pytorch_block_sparse",
      "published_date": "2026-02-27T06:53:37.240176",
      "description": "",
      "source": "Hugging Face - Blog",
      "category": "ML & Open Source",
      "segment": "builders",
      "source_type": "primary",
      "raw_content": "",
      "tier": "quick",
      "selection_reason": "Performance optimization technique for language models",
      "audience_value": "Methods to improve LLM efficiency",
      "urgency_score": 7,
      "category_tag": "🚀 AI & Innovation"
    },
    {
      "id": "666bd57cecfc56ff49a9e759ad216615",
      "title": "AngelSlim: A more accessible, comprehensive, and efficient toolkit for large model compression",
      "url": "https://arxiv.org/abs/2602.21233",
      "published_date": "2026-02-27T06:53:34.426463",
      "description": "arXiv:2602.21233v2 Announce Type: replace-cross \nAbstract: This technical report introduces AngelSlim, a comprehensive and versatile toolkit for large model compression developed by the Tencent Hunyuan team. By consolidating cutting-edge algorithms, including quantization, speculative decoding, token pruning, and distillation. AngelSlim provides a unified pipeline that streamlines the transition from model compression to industrial-scale deployment. To facilitate efficient acceleration, we integrate state-of-the-art FP8 and INT8 Post-Training Quantization (PTQ) algorithms alongside pioneering research in ultra-low-bit regimes, featuring HY-1.8B-int2 as the first industrially viable 2-bit large model. Beyond quantization, we propose a training-aligned speculative decoding framework compatible with multimodal architectures and modern inference engines, achieving 1.8x to 2.0x throughput gains without compromising output correctness. Furthermore, we develop a training-free sparse attention framework that reduces Time-to-First-Token (TTFT) in long-context scenarios by decoupling sparse kernels from model architectures through a hybrid of static patterns and dynamic token selection. For multimodal models, AngelSlim incorporates specialized pruning strategies, namely IDPruner for optimizing vision tokens via Maximal Marginal Relevance and Samp for adaptive audio token merging and pruning. By integrating these compression strategies from low-level implementations, AngelSlim enables algorithm-focused research and tool-assisted deployment.",
      "source": "cs.AI updates on arXiv.org",
      "category": "Raw Research (Machine Learning)",
      "segment": "innovators",
      "source_type": "primary",
      "raw_content": "arXiv:2602.21233v2 Announce Type: replace-cross \nAbstract: This technical report introduces AngelSlim, a comprehensive and versatile toolkit for large model compression developed by the Tencent Hunyuan team. By consolidating cutting-edge algorithms, including quantization, speculative decoding, token pruning, and distillation. AngelSlim provides a unified pipeline that streamlines the transition from model compression to industrial-scale deployment. To facilitate efficient acceleration, we integrate state-of-the-art FP8 and INT8 Post-Training Quantization (PTQ) algorithms alongside pioneering research in ultra-low-bit regimes, featuring HY-1.8B-int2 as the first industrially viable 2-bit large model. Beyond quantization, we propose a training-aligned speculative decoding framework compatible with multimodal architectures and modern inference engines, achieving 1.8x to 2.0x throughput gains without compromising output correctness. Furthermore, we develop a training-free sparse attention framework that reduces Time-to-First-Token (TTFT) in long-context scenarios by decoupling sparse kernels from model architectures through a hybrid of static patterns and dynamic token selection. For multimodal models, AngelSlim incorporates specialized pruning strategies, namely IDPruner for optimizing vision tokens via Maximal Marginal Relevance and Samp for adaptive audio token merging and pruning. By integrating these compression strategies from low-level implementations, AngelSlim enables algorithm-focused research and tool-assisted deployment.",
      "tier": "trending",
      "selection_reason": "New toolkit for optimizing large AI models",
      "audience_value": "Practical tools for AI model optimization",
      "urgency_score": 6,
      "category_tag": "🚀 AI & Innovation"
    },
    {
      "id": "30114af5e07846c9864289b8b3db672f",
      "title": "Why Pass@k Optimization Can Degrade Pass@1: Prompt Interference in LLM Post-training",
      "url": "https://arxiv.org/abs/2602.21189",
      "published_date": "2026-02-27T06:53:34.426446",
      "description": "arXiv:2602.21189v2 Announce Type: replace-cross \nAbstract: Pass@k is a widely used performance metric for verifiable large language model tasks, including mathematical reasoning, code generation, and short-answer reasoning. It defines success if any of $k$ independently sampled solutions passes a verifier. This multi-sample inference metric has motivated inference-aware fine-tuning methods that directly optimize pass@$k$. However, prior work reports a recurring trade-off: pass@k improves while pass@1 degrades under such methods. This trade-off is practically important because pass@1 often remains a hard operational constraint due to latency and cost budgets, imperfect verifier coverage, and the need for a reliable single-shot fallback. We study the origin of this trade-off and provide a theoretical characterization of when pass@k policy optimization can reduce pass@1 through gradient conflict induced by prompt interference. We show that pass@$k$ policy gradients can conflict with pass@1 gradients because pass@$k$ optimization implicitly reweights prompts toward low-success prompts; when these prompts are what we term negatively interfering, their upweighting can rotate the pass@k update direction away from the pass@1 direction. We illustrate our theoretical findings with large language model experiments on verifiable mathematical reasoning tasks.",
      "source": "cs.AI updates on arXiv.org",
      "category": "Raw Research (Machine Learning)",
      "segment": "innovators",
      "source_type": "primary",
      "raw_content": "arXiv:2602.21189v2 Announce Type: replace-cross \nAbstract: Pass@k is a widely used performance metric for verifiable large language model tasks, including mathematical reasoning, code generation, and short-answer reasoning. It defines success if any of $k$ independently sampled solutions passes a verifier. This multi-sample inference metric has motivated inference-aware fine-tuning methods that directly optimize pass@$k$. However, prior work reports a recurring trade-off: pass@k improves while pass@1 degrades under such methods. This trade-off is practically important because pass@1 often remains a hard operational constraint due to latency and cost budgets, imperfect verifier coverage, and the need for a reliable single-shot fallback. We study the origin of this trade-off and provide a theoretical characterization of when pass@k policy optimization can reduce pass@1 through gradient conflict induced by prompt interference. We show that pass@$k$ policy gradients can conflict with pass@1 gradients because pass@$k$ optimization implicitly reweights prompts toward low-success prompts; when these prompts are what we term negatively interfering, their upweighting can rotate the pass@k update direction away from the pass@1 direction. We illustrate our theoretical findings with large language model experiments on verifiable mathematical reasoning tasks.",
      "tier": "trending",
      "selection_reason": "Important insights about LLM evaluation metrics",
      "audience_value": "Better understanding of AI model performance metrics",
      "urgency_score": 6,
      "category_tag": "🚀 AI & Innovation"
    }
  ]
}