{
  "date": "2026-02-19",
  "segment": "builders",
  "trends": {
    "categories": {
      "Database & Backend": 3,
      "Cloud & Infrastructure": 2,
      "Developer Tools & Platforms": 2,
      "ML Community & Tools": 2,
      "DevOps & SRE": 1,
      "Engineering & Development": 1,
      "Developer & Engineering": 1,
      "Cybersecurity": 1
    },
    "sources": {
      "Blog — PlanetScale": 3,
      "HashiCorp Blog": 2,
      "The Fly Blog": 2,
      "Hugging Face - Blog": 2,
      "SRE WEEKLY": 1,
      "Engineering at Meta": 1,
      "Coding Horror": 1,
      "darkreading": 1
    },
    "topics": [
      "SRE Weekly Issue #504",
      "Hybrid cloud, explained: What it is, what it isn’t, and why having a plan matters in 2026",
      "Event Driven Machines",
      "GPUs on Fly.io are available to everyone!",
      "DrP: Meta’s Root Cause Analysis Platform at Scale",
      "ACID Transactions are not just for banks — the Vitess approach",
      "How to start consolidating your cybersecurity tools",
      "There is no longer any such thing as Computer Security",
      "How to train a new language model from scratch using Transformers and Tokenizers",
      "How to generate text: using different decoding methods for language generation with Transformers",
      "PlanetScale migrates open source Vitess test suite from Python to Go",
      "Announcing Vitess 7",
      "Big Breach or Smooth Sailing? Mexican Gov't Faces Leak Allegations"
    ],
    "total_articles": 13
  },
  "article_count": 13,
  "articles": [
    {
      "id": "40dc6cb29db4da6214570c3928a4bd9c",
      "title": "SRE Weekly Issue #504",
      "url": "https://sreweekly.com/sre-weekly-issue-504/",
      "published_date": "2026-02-19T06:59:42.166837",
      "description": "View on sreweekly.com Finding the grain of sand in a heap of Salt Salt is Cloudflare&#8217;s configuration management tool. How do you find the root cause of a configuration management failure when you have a peak of hundreds of changes in 15 minutes on thousands of servers? The result of this has been a reduction [&#8230;]",
      "source": "SRE WEEKLY",
      "category": "DevOps & SRE",
      "segment": "builders",
      "source_type": "secondary",
      "raw_content": "<p><a class=\"email_only\" href=\"https://sreweekly.com/sre-weekly-issue-504/\">View on sreweekly.com</a></p>\n\n\n<div class=\"wp-block-group is-layout-flow wp-block-group-is-layout-flow\"><div class=\"wp-block-group__inner-container\">\n<div class=\"sreweekly-entry\">\n<div class=\"sreweekly-title\"><a href=\"https://blog.cloudflare.com/finding-the-grain-of-sand-in-a-heap-of-salt/\" rel=\"noopener\" target=\"_blank\">Finding the grain of sand in a heap of Salt</a></div>\n<div class=\"sreweekly-description\">\n<p>Salt is Cloudflare&#8217;s configuration management tool.</p>\n<blockquote>\n<p>How do you find the root cause of a configuration management failure when you have a peak of hundreds of changes in 15 minutes on thousands of servers?</p>\n<p>The result of this has been a reduction in the duration of software release delays, and an overall reduction in toilsome, repetitive triage for SRE.</p>\n</blockquote>\n<p>&nbsp;&nbsp;<small>Opeyemi Onikute, Menno Bezema, Nick Rhodes &mdash; Cloudflare</small></p>\n</div>\n</div>\n\n\n\n<div class=\"sreweekly-entry\">\n<div class=\"sreweekly-title\"><a href=\"https://netflixtechblog.com/how-temporal-powers-reliable-cloud-operations-at-netflix-73c69ccb5953\" rel=\"noopener\" target=\"_blank\">How Temporal Powers Reliable Cloud Operations at Netflix</a></div>\n<div class=\"sreweekly-description\">\n<blockquote>\n<p>In this post, I’ll give a high-level overview of what Temporal offers users, the problems we were experiencing operating Spinnaker that motivated its initial adoption at Netflix, and how Temporal helped us reduce the number of transient deployment failures at Netflix from 4% to 0.0001%.</p>\n</blockquote>\n<p>&nbsp;&nbsp;<small>Jacob Meyers and Rob Zienert &mdash; Netflix</small></p>\n</div>\n</div>\n\n\n\n<div class=\"sreweekly-entry\">\n<div class=\"sreweekly-title\"><a href=\"https://engineering.fb.com/2025/12/19/data-infrastructure/drp-metas-root-cause-analysis-platform-at-scale/\" rel=\"noopener\" target=\"_blank\">DrP: Meta’s Root Cause Analysis Platform at Scale</a></div>\n<div class=\"sreweekly-description\">\n<p>DrP provides an SDK that teams can use to define &#8220;analyzers&#8221; to perform investigations, plus post-processors to perform mitigations, notifications, and more.</p>\n<p>&nbsp;&nbsp;<small>Shubham Somani, Vanish Talwar, Madhura Parikh, Chinmay Gandhi &mdash; Meta</small></p>\n</div>\n</div>\n\n\n\n<div class=\"sreweekly-entry\">\n<div class=\"sreweekly-title\"><a href=\"https://feeds.dzone.com/link/23568/17238088/rethinking-qa-from-devops-to-platform-engineering\" rel=\"noopener\" target=\"_blank\">Rethinking QA: From DevOps to Platform Engineering and SRE</a></div>\n<div class=\"sreweekly-description\">\n<p>This article goes in detail on the ways the QA folks can reskill and map their responsibilities and skills to SRE practices.</p>\n<p>&nbsp;&nbsp;<small> Nidhi Sharma &mdash; DZone</small></p>\n</div>\n</div>\n\n\n\n<div class=\"sreweekly-entry\">\n<div class=\"sreweekly-title\"><a href=\"https://surfingcomplexity.blog/2025/12/20/why-i-dont-like-correction-of-error/\" rel=\"noopener\" target=\"_blank\">Why I don’t like “Correction of Error”</a></div>\n<div class=\"sreweekly-description\">\n<p>&#8220;Correction of Error&#8221; is the name used by Amazon for their incident review processand there&#8217;s a lot to unpack there.</p>\n<p>&nbsp;&nbsp;<small>Lorin Hocshtein</small></p>\n</div>\n</div>\n\n\n\n<div class=\"sreweekly-entry\">\n<div class=\"sreweekly-title\"><a href=\"https://charitydotwtf.substack.com/p/on-friday-deploys-sometimes-that\" rel=\"noopener\" target=\"_blank\">On Friday Deploys: Sometimes that Puppy Needs Murdering</a></div>\n<div class=\"sreweekly-description\">\n<p>In 2019, Charity Majors came down hard on deploy freezes with an article, <a href=\"https://substack.com/home/post/p-181561576\">Friday Deploy Freezes are Exactly Like Murdering Puppies</a>. </p>\n<p>This one takes a more moderate approach: maybe a deploy freeze is the right choice for your organization, but you should work to understand why rather than assuming.</p>\n<p>&nbsp;&nbsp;<small>Charity Majors</small></p>\n</div>\n</div>\n\n\n\n<div class=\"sreweekly-entry\">\n<div class=\"sreweekly-title\"><a href=\"https://ufried.com/blog/resilience/\" rel=\"noopener\" target=\"_blank\">Resilience</a></div>\n<div class=\"sreweekly-description\">\n<p>A piece defining the term &#8220;resilience&#8221;, with an especially interesting discussion of the inherent trade-off between efficiency and resiliency.</p>\n<p>&nbsp;&nbsp;<small>Uwe Friedrichsen</small></p>\n</div>\n</div>\n\n\n\n<div class=\"sreweekly-entry\">\n<div class=\"sreweekly-title\"><a href=\"https://status.honeycomb.io/incidents/pjzh0mtqw3vt\" rel=\"noopener\" target=\"_blank\">Querying and Ingest issues in EU</a></div>\n<div class=\"sreweekly-description\">\n<p>Honeycomb experienced a major, extended incident in December, and they published this (extensive!) interim report. Resolution required multiple days&#8217; worth of engineering on new functionality and procedures related to Kafka. A theme of managing employees&#8217; energy and resources is threaded throughout the report.</p>\n<p>  <small>Honeycomb</small></p>\n</div>\n</div>\n</div></div>",
      "tier": "full",
      "selection_reason": "Critical insights into large-scale configuration management failures at Cloudflare",
      "audience_value": "Practical debugging strategies for complex distributed systems",
      "urgency_score": 9,
      "category_tag": "☁️ Enterprise Tech"
    },
    {
      "id": "0fd1cc7ef39db9b3adff1c5ee3de62c7",
      "title": "Hybrid cloud, explained: What it is, what it isn’t, and why having a plan matters in 2026",
      "url": "https://www.hashicorp.com/blog/hybrid-cloud-explained-what-it-is-what-it-isn-t-and-why-having-a-plan-matters",
      "published_date": "2026-02-19T06:59:41.070948",
      "description": "Hybrid cloud complexity threatens to undermine AI investments, but a unified lifecycle management approach gives companies unified control over their infrastructure.",
      "source": "HashiCorp Blog",
      "category": "Cloud & Infrastructure",
      "segment": "builders",
      "source_type": "primary",
      "raw_content": "<p>The mandate to leverage data and AI for operational gain is forcing businesses to reckon with growing complexity in their IT infrastructure. As a result, leaders are now asking: What is hybrid cloud, and what role will it play in our company’s future?</p>\n\n<p>Increasingly, companies rely on a mix of public and private cloud infrastructure services, as well as systems they own and operate themselves. Done right, this hybrid architecture lets organizations connect on-premises solutions that still support mission-critical workflows to the growing number of cloud-based systems, while also enabling quicker and more seamless access to AI, edge computing, and other frontier technology — all while maintaining strong, consistent security across the entire IT landscape.</p>\n\n<p>But many struggle to achieve these benefits. For 52% of businesses, hybrid cloud is a top infrastructure management challenge, according to the <a href=\"https://www.hashicorp.com/en/cloud-complexity-report?utm_source=hashicorp&amp;utm_medium=internal-blog&amp;utm_campaign=26Q1_WW_BDM_MULTI_hybrid-cloud-explained-blog&amp;utm_content=intro-blog-link&amp;utm_offer=ccr\">2025 Cloud Complexity Survey</a>. Often, cloud and on-premises systems aren't connected. They’re typically managed in silos, creating gaps that slow down developers, increase risk, and lead to unexpected costs. Security and infrastructure specialists don’t communicate as much as they should. And instead of AI-driven automation, platform teams and developers continue to do much of their work manually.</p>\n\n<p>Without a unified lifecycle approach to hybrid cloud management, enterprises could find themselves falling short in their data and AI priorities in 2026. However, when infrastructure is managed through one control plane as a single architecture, infrastructure becomes a catalyst for faster, more impactful innovation.</p>\n\n<p>In this post, we’ll outline what’s needed for an effective hybrid cloud strategy, and explain how a unified lifecycle approach can accelerate, strengthen, and optimize infrastructure management.</p>\n\n<h2>Building the right hybrid cloud</h2>\n\n<p>The hybrid model is quickly becoming a common architecture choice. In fact, by 2027, an estimated 90% of organizations will use a hybrid cloud, <a href=\"https://www.gartner.com/en/newsroom/press-releases/2024-11-19-gartner-forecasts-worldwide-public-cloud-end-user-spending-to-total-723-billion-dollars-in-2025\">according to Gartner</a>. Why is it becoming popular?</p>\n\n<h3>Why is a hybrid cloud important?</h3>\n\n<p>On-premises systems often hold some of a company’s most valuable data, and play a pivotal role in core workflows — particularly for regulated industries that must protect sensitive and confidential information. Some companies will find it safer or less expensive to keep some data managed in house and on-prem. But that data will also become key context for AI in the coming months and years. Now, as more enterprises aim to use AI to automate processes and improve deduction-making, among other outcomes, it’s imperative that businesses minimize gaps between their on-prem and cloud technology.</p>\n\n<h3>Hybrid cloud vs. multi-cloud</h3>\n\n<p><strong>Hybrid cloud</strong> is defined as any infrastructure that uses both cloud (regardless of whether it’s public and/or private) and on-premises dedicated datacenters. <strong>Multi-cloud</strong> is defined as any infrastructure that uses more than one cloud vendor or system (regardless of whether it’s public and/or private, self-built, or from a third-party). Organizations can have both hybrid cloud and multi-cloud infrastructure simultaneously, which is not uncommon.</p>\n\n<p>The hybrid cloud management challenge is similar to the multi-cloud management challenge. Siloed teams and workflows cause massive levels of friction when new software innovations need to harness multiple environments, and companies need to secure and manage all those environments efficiently.</p>\n\n<h3>Why hybrid cloud requires a unified lifecycle approach to infrastructure</h3>\n\n<p>Organizations with hybrid cloud environments understand how challenging this infrastructure can be. Adrian Cockcroft, who once led the open source program at Netflix, compared hybrid cloud management to one rider riding two horses.</p>\n\n<p>Teams that want to start addressing runaway infrastructure costs and growing inefficiency need to focus on that “one rider” as the key leverage point for fixing their problems. To do that, organizations need to build a <a href=\"https://www.hashicorp.com/en/infrastructure-cloud?utm_source=hashicorp&amp;utm_medium=internal-blog&amp;utm_campaign=26Q1_WW_BDM_SPEED_hybrid-cloud-explained-blog_WEBSITE&amp;utm_content=mid-blog-cta&amp;utm_offer=website\">unified platform</a> as a foundation that will allow software teams to “ride multiple horses” without noticing a difference in speed or process friction.</p>\n\n<p>A unified lifecycle approach to security and infrastructure management that eliminates barriers across hybrid infrastructure requires several components, including:</p>\n\n<ul>\n<li>An infrastructure as code approach to infrastructure and policy to deliver consistency across environments</li>\n<li>Self-service provisioning to remove complexity for developers</li>\n<li>Identity-based access, with centralized secrets management to shift the business from long-lived to short-lived credentials, API keys, and other sensitive secrets</li>\n</ul>\n\n<h2>Doing hybrid cloud right</h2>\n\n<p>Hybrid cloud complexity is more than an IT problem; it can drag down the whole business.</p>\n\n<p>Without a unified view across the entire infrastructure landscape, it’s harder and more time-consuming for platform teams to spot vulnerabilities or troubleshoot issues, leading to higher costs and worse performance. Similarly, without standardized policies and processes, developers take an ad hoc approach to building software that leads to an exploding number of security gaps and reliability issues.</p>\n\n<p>A unified lifecycle approach to hybrid cloud management transforms how platform teams operate to:</p>\n\n<ul>\n<li>Accelerate innovation - by removing manual, time-consuming aspects of infrastructure management and provisioning.</li>\n<li>Strengthen security - with an identity-based zero trust operating model, spanning an organization’s human and non-human entities.</li>\n<li>Optimize spend - with real-time visibility and cost controls to proactively detect issues before they lead to larger monthly bills.</li>\n</ul>\n\n<h2>Next steps</h2>\n\n<p>To learn more about how we can help your company navigate the complexities of hybrid infrastructure for more secure, automated operations, check out our new <a href=\"https://www.hashicorp.com/en/do-cloud-right-explained?utm_source=hashicorp&amp;utm_medium=internal-blog&amp;utm_campaign=26Q1_WW_BDM_MULTI_hybrid-cloud-explained-blog_WEBSITE&amp;utm_content=end-blog-cta&amp;utm_offer=website\"><em>Do Cloud Right, Explained</em></a> video series and <a href=\"https://www.hashicorp.com/en/contact-sales?utm_source=hashicorp&amp;utm_medium=internal&amp;utm_campaign=26Q3_WW_PRACTITIONER_RISK_rethinking-ssh-blog_CONTACTSALES&amp;utm_content=end-blog-cta&amp;utm_offer=contactsales\">drop us a line</a> to talk about your unique IT challenges.</p>",
      "tier": "full",
      "selection_reason": "Strategic guidance on hybrid cloud implementation for AI workloads",
      "audience_value": "Infrastructure planning insights for AI/ML deployment",
      "urgency_score": 8,
      "category_tag": "☁️ Enterprise Tech"
    },
    {
      "id": "a1f6baf6538b3b3fca4a32426aae78df",
      "title": "Event Driven Machines",
      "url": "https://fly.io/blog/event-driven-machines/",
      "published_date": "2026-02-19T06:59:38.552431",
      "description": "<div class=\"lead\"><p>We’re Fly.io and we transmute containers into VMs, running them on our hardware around the world. We have fast booting VM’s, so why not <a href=\"https://fly.io/docs/speedrun/\" title=\"\">take advantage of them</a>?</p>\n</div>\n<p>Serverless is great because is has good ergonomics - when an event is received, a &ldquo;not-server&rdquo; boots quickly, code is run, and then everything is torn down. We&rsquo;re billed only on usage.</p>\n\n<p>It turns out that Fly.io shares many of <a href=\"https://fly.io/blog/the-serverless-server/\" title=\"\">the same ergonomics</a> as serverless. Can we do a serverless on Fly.io? 🦆 Well, if it&rsquo;s quacking like a duck, let&rsquo;s call it a mallard.</p>\n\n<p>Here&rsquo;s a useful pattern for triggering our own not-servers with Fly Machines.</p>\n<h2 class=\"group flex items-start whitespace-pre-wrap relative mt-14 sm:mt-16 mb-4 text-navy-950 font-heading\" id=\"triggering-machines\"><a class=\"inline-block align-text-top relative top-[.15em] w-6 h-6 -ml-6 after:hash opacity-0 group-hover:opacity-100 transition-all\" href=\"https://fly.io/blog/feed.xml#triggering-machines\"></a><span class=\"plain-code\">Triggering Machines</span></h2>\n<p>I want to make Machines do some work based on my own events. Fly.io can already <a href=\"https://fly.io/docs/apps/autostart-stop/\" title=\"\">stop Machines when idle</a> based on HTTP, so let&rsquo;s concentrate on non-HTTP events.</p>\n\n<p>The process of running evented Machines involves:</p>\n\n<ol>\n<li>Listening for events\n</li><li>Spinning up Fly Machines to run our code (with the events as context)\n</li><li>Having event-aware code to run\n</li></ol>\n\n<p>To do this, I made a project and named it <a href=\"https://github.com/fly-apps/lambdo\" title=\"\"><strong class=\"font-semibold text-navy-950\">Lambdo</strong></a> because reasons.\nYou can consider this project &ldquo;reference architecture&rdquo; in the same way you call a toddler&rsquo;s scribbling &ldquo;art&rdquo;.</p>\n\n<p>The goal is to run some of our code on a fresh not-server when an event is received. We want this done efficiently - a Machine should only exist long enough to process an event or 3.</p>\n\n<p>Lambdo does just that - it receives some events, and spins up Fly Machines with those events placed <em>inside</em> the VMs. Once the code finishes, the Machine is destroyed.</p>\n<div class=\"group relative min-w-0 bg-white shadow-md shadow-navy-500/10 rounded-xl mb-7 ring-1 ring-navy-300/40\"><button class=\"bubble-wrap z-20 absolute right-2.5 top-2.5 text-transparent group-hover:text-navy-950 hocus:text-violet-600 bg-transparent group-hover:bg-white hocus:bg-violet-200/40 transition-colors grid place-items-center w-7 h-7 rounded-lg outline-none focus:outline-none\" type=\"button\"><svg class=\"w-5 h-5 pointer-events-none\" fill=\"none\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" xmlns=\"http://www.w3.org/2000/svg\"><g><path d=\"M11.912 10.037h2.732c1.277 0 2.315-.962 2.315-2.237a2.314 2.314 0 00-2.315-2.31H4.959M15.187 14.5H4.959M8.802 10H4.959\"><path d=\"M13.081 8.466l-1.548 1.571 1.548 1.571\"></g></svg><span class=\"bubble-sm bubble-tl [--offset-l:-9px] tail text-navy-950\">Wrap text</span></button><div class=\"min-w-0 overflow-x-auto rounded-xl\"><table class=\"table-stripe table-stretch table-pad text-sm whitespace-nowrap m-0\" id=\"table-8p1837oy\"><thead class=\"text-navy-950 text-left\"><tr>\n<th style=\"text-align: center;\"><img alt=\"the files are inside the computer\" src=\"https://fly.io/blog/event-driven-machines/assets/files-are-inside-the-computer-cover.webp\" /></th>\n</tr>\n</thead><tbody><tr>\n<td style=\"text-align: center;\">The files are <em>in</em> the computer!</td>\n</tr>\n</tbody></table></div></div><h2 class=\"group flex items-start whitespace-pre-wrap relative mt-14 sm:mt-16 mb-4 text-navy-950 font-heading\" id=\"listening-for-events\"><a class=\"inline-block align-text-top relative top-[.15em] w-6 h-6 -ml-6 after:hash opacity-0 group-hover:opacity-100 transition-all\" href=\"https://fly.io/blog/feed.xml#listening-for-events\"></a><span class=\"plain-code\">Listening for Events</span></h2>\n<p>For our purposes, an event is just a JSON object. <code>{&quot;any&quot;: &quot;object&quot;, &quot;will&quot;: &quot;do&quot;}</code>.</p>\n\n<p>We want to turn events into compute, so we need some sort of event system. I decided to use a queue.</p>\n<h3 class=\"group flex items-start whitespace-pre-wrap relative mt-14 sm:mt-16 mb-4 text-navy-950 font-heading\" id=\"the-queue\"><a class=\"inline-block align-text-top relative top-[.15em] w-6 h-6 -ml-6 after:hash opacity-0 group-hover:opacity-100 transition-all\" href=\"https://fly.io/blog/feed.xml#the-queue\"></a><span class=\"plain-code\">The Queue</span></h3>\n<p>The first thing I needed was a place to send events! I chose to use SQS, which let me continue to pretend servers don&rsquo;t exist.</p>\n\n<p>It&rsquo;s no surprise then that the first part of this project is <a href=\"https://github.com/fly-apps/lambdo/blob/main/internal/sqs/get_events.go\" title=\"\">code that polls SQS</a>.</p>\n\n<p>When the polling returns some non-zero number of events, it collects the SQS messages&rsquo; JSON strings (and some meta data), resulting in an array of objects (a list of events).</p>\n\n<p>Then we send these events to some Machines.</p>\n<h2 class=\"group flex items-start whitespace-pre-wrap relative mt-14 sm:mt-16 mb-4 text-navy-950 font-heading\" id=\"spinning-up-machines\"><a class=\"inline-block align-text-top relative top-[.15em] w-6 h-6 -ml-6 after:hash opacity-0 group-hover:opacity-100 transition-all\" href=\"https://fly.io/blog/feed.xml#spinning-up-machines\"></a><span class=\"plain-code\">Spinning Up Machines</span></h2>\n<p>Fly Machines are fast-booting Micro-VM&rsquo;s, controlled by an <a href=\"https://fly.io/docs/machines/working-with-machines/\" title=\"\">API</a>.</p>\n\n<p>A feature of that API is the ability to <a href=\"https://community.fly.io/t/machine-files/14453\" title=\"\">create files</a> on a new Machine. This is how we&rsquo;ll get our events into the Machine.</p>\n\n<p>When Lambdo creates a Machine, it places a file at <code>/tmp/events.json</code>. Our code just needs to read that file and parse the JSON.</p>\n<h3 class=\"group flex items-start whitespace-pre-wrap relative mt-14 sm:mt-16 mb-4 text-navy-950 font-heading\" id=\"running-our-code\"><a class=\"inline-block align-text-top relative top-[.15em] w-6 h-6 -ml-6 after:hash opacity-0 group-hover:opacity-100 transition-all\" href=\"https://fly.io/blog/feed.xml#running-our-code\"></a><span class=\"plain-code\">Running Our Code</span></h3>\n<p>Part of the ergonomics of Serverless is (usually) being limited to running just a function. Fly.io doesn&rsquo;t really care what you run, which is to our advantage. We can choose to write discreet functions per event, or we can bring our whole <a href=\"https://signalvnoise.com/svn3/the-majestic-monolith/\" title=\"\">Majestic Monolith</a> to bear.</p>\n\n<p>How do we package up our code? The real answer is &ldquo;however you want!&rdquo;, but here&rsquo;s 2 ideas.</p>\n\n<p><strong class=\"font-semibold text-navy-950\">Use Your Existing Code Base</strong></p>\n\n<p>You can just use your existing code base. This is especially easy if you&rsquo;re already deploying apps to Fly.io.</p>\n\n<p>All we&rsquo;d need to do is add some additional code - a command perhaps (<code>rake</code>, <code>artisan</code>, whatever) - that sucks in that JSON, iterates over the events, and does some stuff.</p>\n<div class=\"highlight-wrapper group relative php\">\n  <button class=\"bubble-wrap z-20 absolute right-9 -mr-0.5 top-1.5 text-transparent group-hover:text-gray-400 group-hover:hocus:text-white focus:text-white bg-transparent group-hover:bg-gray-900 group-hover:hocus:bg-gray-700 focus:bg-gray-700 transition-colors grid place-items-center w-7 h-7 rounded-lg outline-none focus:outline-none\" type=\"button\">\n    <svg class=\"w-4 h-4 pointer-events-none\" fill=\"none\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.35\" viewBox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\"><g><path d=\"M9.912 8.037h2.732c1.277 0 2.315-.962 2.315-2.237a2.325 2.325 0 00-2.315-2.31H2.959m10.228 9.01H2.959M6.802 8H2.959\"><path d=\"M11.081 6.466L9.533 8.037l1.548 1.571\"></g></svg>\n    <span class=\"bubble-sm bubble-tl [--offset-l:-9px] tail text-navy-950\">\n      Wrap text\n    </span>\n  </button>\n  <button class=\"bubble-wrap z-20 absolute right-1.5 top-1.5 text-transparent group-hover:text-gray-400 group-hover:hocus:text-white focus:text-white bg-transparent group-hover:bg-gray-900 group-hover:hocus:bg-gray-700 focus:bg-gray-700 transition-colors grid place-items-center w-7 h-7 rounded-lg outline-none focus:outline-none\" type=\"button\">\n    <svg class=\"w-4 h-4 pointer-events-none\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"1.35\" viewBox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\"><g><path d=\"M10.576 7.239c0-.995-.82-1.815-1.815-1.815H3.315c-.995 0-1.815.82-1.815 1.815v5.446c0 .995.82 1.815 1.815 1.815h5.446c.995 0 1.815-.82 1.815-1.815V7.239z\"><path d=\"M10.576 10.577h2.109A1.825 1.825 0 0014.5 8.761V3.315A1.826 1.826 0 0012.685 1.5H7.239c-.996 0-1.815.819-1.816 1.815v1.617\"></g></svg>\n    <span class=\"bubble-sm bubble-tl [--offset-l:-6px] tail [--tail-x:calc(100%-30px)] text-navy-950\">\n      Copy to clipboard\n    </span>\n  </button>\n  <div class=\"highlight relative group\">\n    <pre class=\"highlight \"><code id=\"code-baprui6l\"><span class=\"nv\">$events</span> <span class=\"o\">=</span> <span class=\"nb\">json_decode</span><span class=\"p\">(</span><span class=\"nb\">file_get_contents</span><span class=\"p\">(</span><span class=\"s2\">\"/tmp/events.json\"</span><span class=\"p\">));</span>\n\n<span class=\"k\">foreach</span> <span class=\"p\">(</span><span class=\"nv\">$events</span> <span class=\"k\">as</span> <span class=\"nv\">$event</span><span class=\"p\">)</span> <span class=\"p\">{</span>\n  <span class=\"c1\">// do a thing</span>\n<span class=\"p\">}</span>\n</code></pre>\n  </div>\n</div>\n<p>When we create an event, we&rsquo;ll tell Lambdo how to run your code - more on that later.</p>\n\n<p><strong class=\"font-semibold text-navy-950\">Use Lambdo&rsquo;s Base Images</strong></p>\n\n<p>This project also provides some &ldquo;runtimes&rdquo; (base images). This is a bit more &ldquo;traditional serverless&rdquo;, were you provide a function to run.</p>\n\n<p>Lambdo contains <a href=\"https://github.com/fly-apps/lambdo/tree/main/runtimes\" title=\"\">two runtimes</a> right now - Node and PHP. There could be more, of course, but you know&hellip;lazy.</p>\n\n<p>The Node runtime <a href=\"https://github.com/fly-apps/lambdo/blob/main/runtimes/js/src/index.js\" title=\"\">contains some code</a> that will read the JSON payload file   (again, just an array of JSON events), and call a user-supplied JS function once per event.</p>\n\n<p>An <a href=\"https://github.com/fly-apps/lambdo/tree/main/runtimes/js/sample-project\" title=\"\">example is here</a> - our code just needs to export a function that does stuff to the given event:</p>\n<div class=\"highlight-wrapper group relative javascript\">\n  <button class=\"bubble-wrap z-20 absolute right-9 -mr-0.5 top-1.5 text-transparent group-hover:text-gray-400 group-hover:hocus:text-white focus:text-white bg-transparent group-hover:bg-gray-900 group-hover:hocus:bg-gray-700 focus:bg-gray-700 transition-colors grid place-items-center w-7 h-7 rounded-lg outline-none focus:outline-none\" type=\"button\">\n    <svg class=\"w-4 h-4 pointer-events-none\" fill=\"none\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.35\" viewBox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\"><g><path d=\"M9.912 8.037h2.732c1.277 0 2.315-.962 2.315-2.237a2.325 2.325 0 00-2.315-2.31H2.959m10.228 9.01H2.959M6.802 8H2.959\"><path d=\"M11.081 6.466L9.533 8.037l1.548 1.571\"></g></svg>\n    <span class=\"bubble-sm bubble-tl [--offset-l:-9px] tail text-navy-950\">\n      Wrap text\n    </span>\n  </button>\n  <button class=\"bubble-wrap z-20 absolute right-1.5 top-1.5 text-transparent group-hover:text-gray-400 group-hover:hocus:text-white focus:text-white bg-transparent group-hover:bg-gray-900 group-hover:hocus:bg-gray-700 focus:bg-gray-700 transition-colors grid place-items-center w-7 h-7 rounded-lg outline-none focus:outline-none\" type=\"button\">\n    <svg class=\"w-4 h-4 pointer-events-none\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"1.35\" viewBox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\"><g><path d=\"M10.576 7.239c0-.995-.82-1.815-1.815-1.815H3.315c-.995 0-1.815.82-1.815 1.815v5.446c0 .995.82 1.815 1.815 1.815h5.446c.995 0 1.815-.82 1.815-1.815V7.239z\"><path d=\"M10.576 10.577h2.109A1.825 1.825 0 0014.5 8.761V3.315A1.826 1.826 0 0012.685 1.5H7.239c-.996 0-1.815.819-1.816 1.815v1.617\"></g></svg>\n    <span class=\"bubble-sm bubble-tl [--offset-l:-6px] tail [--tail-x:calc(100%-30px)] text-navy-950\">\n      Copy to clipboard\n    </span>\n  </button>\n  <div class=\"highlight relative group\">\n    <pre class=\"highlight \"><code id=\"code-q32xw0kp\"><span class=\"c1\">// File /app/index.js</span>\n<span class=\"nx\">exports</span><span class=\"p\">.</span><span class=\"nx\">handler</span> <span class=\"o\">=</span> <span class=\"k\">async</span> <span class=\"kd\">function</span><span class=\"p\">(</span><span class=\"nx\">event</span><span class=\"p\">)</span> <span class=\"p\">{</span>\n    <span class=\"nx\">console</span><span class=\"p\">.</span><span class=\"nx\">log</span><span class=\"p\">(</span><span class=\"dl\">\"</span><span class=\"s2\">Let's process an event! The event:</span><span class=\"dl\">\"</span><span class=\"p\">,</span> <span class=\"nx\">event</span><span class=\"p\">)</span>\n<span class=\"p\">}</span>\n</code></pre>\n  </div>\n</div>\n<p>The <a href=\"https://github.com/fly-apps/lambdo/tree/main/runtimes/php\" title=\"\">PHP runtime</a> is the same idea, a user-supplied handler looks like this:</p>\n<div class=\"highlight-wrapper group relative php\">\n  <button class=\"bubble-wrap z-20 absolute right-9 -mr-0.5 top-1.5 text-transparent group-hover:text-gray-400 group-hover:hocus:text-white focus:text-white bg-transparent group-hover:bg-gray-900 group-hover:hocus:bg-gray-700 focus:bg-gray-700 transition-colors grid place-items-center w-7 h-7 rounded-lg outline-none focus:outline-none\" type=\"button\">\n    <svg class=\"w-4 h-4 pointer-events-none\" fill=\"none\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.35\" viewBox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\"><g><path d=\"M9.912 8.037h2.732c1.277 0 2.315-.962 2.315-2.237a2.325 2.325 0 00-2.315-2.31H2.959m10.228 9.01H2.959M6.802 8H2.959\"><path d=\"M11.081 6.466L9.533 8.037l1.548 1.571\"></g></svg>\n    <span class=\"bubble-sm bubble-tl [--offset-l:-9px] tail text-navy-950\">\n      Wrap text\n    </span>\n  </button>\n  <button class=\"bubble-wrap z-20 absolute right-1.5 top-1.5 text-transparent group-hover:text-gray-400 group-hover:hocus:text-white focus:text-white bg-transparent group-hover:bg-gray-900 group-hover:hocus:bg-gray-700 focus:bg-gray-700 transition-colors grid place-items-center w-7 h-7 rounded-lg outline-none focus:outline-none\" type=\"button\">\n    <svg class=\"w-4 h-4 pointer-events-none\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"1.35\" viewBox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\"><g><path d=\"M10.576 7.239c0-.995-.82-1.815-1.815-1.815H3.315c-.995 0-1.815.82-1.815 1.815v5.446c0 .995.82 1.815 1.815 1.815h5.446c.995 0 1.815-.82 1.815-1.815V7.239z\"><path d=\"M10.576 10.577h2.109A1.825 1.825 0 0014.5 8.761V3.315A1.826 1.826 0 0012.685 1.5H7.239c-.996 0-1.815.819-1.816 1.815v1.617\"></g></svg>\n    <span class=\"bubble-sm bubble-tl [--offset-l:-6px] tail [--tail-x:calc(100%-30px)] text-navy-950\">\n      Copy to clipboard\n    </span>\n  </button>\n  <div class=\"highlight relative group\">\n    <pre class=\"highlight \"><code id=\"code-neg1s23g\"><span class=\"c1\">// File /app/index.php</span>\n<span class=\"k\">return</span> <span class=\"k\">function</span> <span class=\"n\">function</span><span class=\"p\">(</span><span class=\"kt\">array</span> <span class=\"nv\">$event</span><span class=\"p\">)</span> <span class=\"p\">{</span>\n    <span class=\"c1\">// Do something with $event</span>\n<span class=\"p\">}</span>\n</code></pre>\n  </div>\n</div>\n<p>Explore the <a href=\"https://github.com/fly-apps/lambdo/tree/main/runtimes\" title=\"\">runtime</a> directory of the project to see how that&rsquo;s put together.</p>\n<h2 class=\"group flex items-start whitespace-pre-wrap relative mt-14 sm:mt-16 mb-4 text-navy-950 font-heading\" id=\"sending-an-event\"><a class=\"inline-block align-text-top relative top-[.15em] w-6 h-6 -ml-6 after:hash opacity-0 group-hover:opacity-100 transition-all\" href=\"https://fly.io/blog/feed.xml#sending-an-event\"></a><span class=\"plain-code\">Sending an Event</span></h2>\n<p>Since our events are sent via SQS queue, it would be helpful to see an example SQS message. Remember how I mentioned the SQS message has some meta data?</p>\n\n<p>Here&rsquo;s an example, with said meta data:</p>\n<div class=\"highlight-wrapper group relative bash\">\n  <button class=\"bubble-wrap z-20 absolute right-9 -mr-0.5 top-1.5 text-transparent group-hover:text-gray-400 group-hover:hocus:text-white focus:text-white bg-transparent group-hover:bg-gray-900 group-hover:hocus:bg-gray-700 focus:bg-gray-700 transition-colors grid place-items-center w-7 h-7 rounded-lg outline-none focus:outline-none\" type=\"button\">\n    <svg class=\"w-4 h-4 pointer-events-none\" fill=\"none\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.35\" viewBox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\"><g><path d=\"M9.912 8.037h2.732c1.277 0 2.315-.962 2.315-2.237a2.325 2.325 0 00-2.315-2.31H2.959m10.228 9.01H2.959M6.802 8H2.959\"><path d=\"M11.081 6.466L9.533 8.037l1.548 1.571\"></g></svg>\n    <span class=\"bubble-sm bubble-tl [--offset-l:-9px] tail text-navy-950\">\n      Wrap text\n    </span>\n  </button>\n  <button class=\"bubble-wrap z-20 absolute right-1.5 top-1.5 text-transparent group-hover:text-gray-400 group-hover:hocus:text-white focus:text-white bg-transparent group-hover:bg-gray-900 group-hover:hocus:bg-gray-700 focus:bg-gray-700 transition-colors grid place-items-center w-7 h-7 rounded-lg outline-none focus:outline-none\" type=\"button\">\n    <svg class=\"w-4 h-4 pointer-events-none\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"1.35\" viewBox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\"><g><path d=\"M10.576 7.239c0-.995-.82-1.815-1.815-1.815H3.315c-.995 0-1.815.82-1.815 1.815v5.446c0 .995.82 1.815 1.815 1.815h5.446c.995 0 1.815-.82 1.815-1.815V7.239z\"><path d=\"M10.576 10.577h2.109A1.825 1.825 0 0014.5 8.761V3.315A1.826 1.826 0 0012.685 1.5H7.239c-.996 0-1.815.819-1.816 1.815v1.617\"></g></svg>\n    <span class=\"bubble-sm bubble-tl [--offset-l:-6px] tail [--tail-x:calc(100%-30px)] text-navy-950\">\n      Copy to clipboard\n    </span>\n  </button>\n  <div class=\"highlight relative group\">\n    <pre class=\"highlight \"><code id=\"code-n6j5zmqx\">aws sqs send-message <span class=\"se\">\\</span>\n    <span class=\"nt\">--queue-url</span><span class=\"o\">=</span>https://sqs.&lt;region&gt;.amazonaws.com/&lt;account&gt;/&lt;queue&gt; <span class=\"se\">\\</span>\n    <span class=\"nt\">--message-body</span><span class=\"o\">=</span><span class=\"s1\">'{\"foo\": \"bar\"}'</span> <span class=\"se\">\\</span>\n    <span class=\"nt\">--message-attributes</span><span class=\"o\">=</span><span class=\"s1\">'{\n\"size\":{\"DataType\":\"String\",\"StringValue\":\"performance-2x\"}, \n\"image\":{\"DataType\":\"String\",\"StringValue\":\"fideloper/lambdo-php-sample:latest\"}\n}'</span>\n</code></pre>\n  </div>\n</div>\n<p>The Body field of the SQS message is assumed to be a JSON string (it&rsquo;s the event itself, and its contents are arbitrary - whatever makes sense for you).</p>\n\n<p>The message Attributes contains the meta data - up to 3 important details:</p>\n\n<ol>\n<li><code>image</code>: The image to run (it might be a Docker Hub image, or something you pushed to registry.fly.io). This is <strong class=\"font-semibold text-navy-950\">required</strong>.\n</li><li><code>size</code>: The CPU size and type to use† - defaults to <code>performance-2x</code>\n</li><li><code>command</code>: The command to run, which is the Docker <code>CMD</code> equivalent - defaults to whatever your <code>CMD</code> is set in the <code>Dockerfile</code> used to create the Machine image.††\n</li></ol>\n\n<p>†You can get valid values for the <code>size</code> option by running <code>fly platform vm-sizes</code>.</p>\n\n<p>††It&rsquo;s an array form, e.g. <code>[&quot;php&quot;, &quot;artisan&quot;, &quot;foo&quot;]</code>, you may need to do some escaping of double quotes if you&rsquo;re sending messages to SQS via terminal.</p>\n<h2 class=\"group flex items-start whitespace-pre-wrap relative mt-14 sm:mt-16 mb-4 text-navy-950 font-heading\" id=\"we-did-a-lambda\"><a class=\"inline-block align-text-top relative top-[.15em] w-6 h-6 -ml-6 after:hash opacity-0 group-hover:opacity-100 transition-all\" href=\"https://fly.io/blog/feed.xml#we-did-a-lambda\"></a><span class=\"plain-code\">We did a Lambda?</span></h2>\n<p>Fly.io isn&rsquo;t serverless, but it has all these primitives that add up to serverless. You have events, Fly.io has fast-booting VM&rsquo;s. They just make sense together!</p>\n\n<p>What we did here is use <a href=\"https://github.com/fly-apps/lambdo\" title=\"\"><strong class=\"font-semibold text-navy-950\">Lambdo</strong> to respond to events by spinning up a Machine</a>. Our code can process those events any way we want.</p>\n\n<p>What I like about this approach is how flexible it can be. We can choose the base image to use and the server type (even using GPU-enabled Machines) <em>per event</em>.\nSince we have full control over the Machine VM&rsquo;s responding to the events, we can do whatever we want inside of them. Pretty neat!</p>",
      "source": "The Fly Blog",
      "category": "Developer Tools & Platforms",
      "segment": "builders",
      "source_type": "primary",
      "raw_content": "<div class=\"lead\"><p>We’re Fly.io and we transmute containers into VMs, running them on our hardware around the world. We have fast booting VM’s, so why not <a href=\"https://fly.io/docs/speedrun/\" title=\"\">take advantage of them</a>?</p>\n</div>\n<p>Serverless is great because is has good ergonomics - when an event is received, a &ldquo;not-server&rdquo; boots quickly, code is run, and then everything is torn down. We&rsquo;re billed only on usage.</p>\n\n<p>It turns out that Fly.io shares many of <a href=\"https://fly.io/blog/the-serverless-server/\" title=\"\">the same ergonomics</a> as serverless. Can we do a serverless on Fly.io? 🦆 Well, if it&rsquo;s quacking like a duck, let&rsquo;s call it a mallard.</p>\n\n<p>Here&rsquo;s a useful pattern for triggering our own not-servers with Fly Machines.</p>\n<h2 class=\"group flex items-start whitespace-pre-wrap relative mt-14 sm:mt-16 mb-4 text-navy-950 font-heading\" id=\"triggering-machines\"><a class=\"inline-block align-text-top relative top-[.15em] w-6 h-6 -ml-6 after:hash opacity-0 group-hover:opacity-100 transition-all\" href=\"https://fly.io/blog/feed.xml#triggering-machines\"></a><span class=\"plain-code\">Triggering Machines</span></h2>\n<p>I want to make Machines do some work based on my own events. Fly.io can already <a href=\"https://fly.io/docs/apps/autostart-stop/\" title=\"\">stop Machines when idle</a> based on HTTP, so let&rsquo;s concentrate on non-HTTP events.</p>\n\n<p>The process of running evented Machines involves:</p>\n\n<ol>\n<li>Listening for events\n</li><li>Spinning up Fly Machines to run our code (with the events as context)\n</li><li>Having event-aware code to run\n</li></ol>\n\n<p>To do this, I made a project and named it <a href=\"https://github.com/fly-apps/lambdo\" title=\"\"><strong class=\"font-semibold text-navy-950\">Lambdo</strong></a> because reasons.\nYou can consider this project &ldquo;reference architecture&rdquo; in the same way you call a toddler&rsquo;s scribbling &ldquo;art&rdquo;.</p>\n\n<p>The goal is to run some of our code on a fresh not-server when an event is received. We want this done efficiently - a Machine should only exist long enough to process an event or 3.</p>\n\n<p>Lambdo does just that - it receives some events, and spins up Fly Machines with those events placed <em>inside</em> the VMs. Once the code finishes, the Machine is destroyed.</p>\n<div class=\"group relative min-w-0 bg-white shadow-md shadow-navy-500/10 rounded-xl mb-7 ring-1 ring-navy-300/40\"><button class=\"bubble-wrap z-20 absolute right-2.5 top-2.5 text-transparent group-hover:text-navy-950 hocus:text-violet-600 bg-transparent group-hover:bg-white hocus:bg-violet-200/40 transition-colors grid place-items-center w-7 h-7 rounded-lg outline-none focus:outline-none\" type=\"button\"><svg class=\"w-5 h-5 pointer-events-none\" fill=\"none\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.5\" viewBox=\"0 0 20 20\" xmlns=\"http://www.w3.org/2000/svg\"><g><path d=\"M11.912 10.037h2.732c1.277 0 2.315-.962 2.315-2.237a2.314 2.314 0 00-2.315-2.31H4.959M15.187 14.5H4.959M8.802 10H4.959\"><path d=\"M13.081 8.466l-1.548 1.571 1.548 1.571\"></g></svg><span class=\"bubble-sm bubble-tl [--offset-l:-9px] tail text-navy-950\">Wrap text</span></button><div class=\"min-w-0 overflow-x-auto rounded-xl\"><table class=\"table-stripe table-stretch table-pad text-sm whitespace-nowrap m-0\" id=\"table-8p1837oy\"><thead class=\"text-navy-950 text-left\"><tr>\n<th style=\"text-align: center;\"><img alt=\"the files are inside the computer\" src=\"https://fly.io/blog/event-driven-machines/assets/files-are-inside-the-computer-cover.webp\" /></th>\n</tr>\n</thead><tbody><tr>\n<td style=\"text-align: center;\">The files are <em>in</em> the computer!</td>\n</tr>\n</tbody></table></div></div><h2 class=\"group flex items-start whitespace-pre-wrap relative mt-14 sm:mt-16 mb-4 text-navy-950 font-heading\" id=\"listening-for-events\"><a class=\"inline-block align-text-top relative top-[.15em] w-6 h-6 -ml-6 after:hash opacity-0 group-hover:opacity-100 transition-all\" href=\"https://fly.io/blog/feed.xml#listening-for-events\"></a><span class=\"plain-code\">Listening for Events</span></h2>\n<p>For our purposes, an event is just a JSON object. <code>{&quot;any&quot;: &quot;object&quot;, &quot;will&quot;: &quot;do&quot;}</code>.</p>\n\n<p>We want to turn events into compute, so we need some sort of event system. I decided to use a queue.</p>\n<h3 class=\"group flex items-start whitespace-pre-wrap relative mt-14 sm:mt-16 mb-4 text-navy-950 font-heading\" id=\"the-queue\"><a class=\"inline-block align-text-top relative top-[.15em] w-6 h-6 -ml-6 after:hash opacity-0 group-hover:opacity-100 transition-all\" href=\"https://fly.io/blog/feed.xml#the-queue\"></a><span class=\"plain-code\">The Queue</span></h3>\n<p>The first thing I needed was a place to send events! I chose to use SQS, which let me continue to pretend servers don&rsquo;t exist.</p>\n\n<p>It&rsquo;s no surprise then that the first part of this project is <a href=\"https://github.com/fly-apps/lambdo/blob/main/internal/sqs/get_events.go\" title=\"\">code that polls SQS</a>.</p>\n\n<p>When the polling returns some non-zero number of events, it collects the SQS messages&rsquo; JSON strings (and some meta data), resulting in an array of objects (a list of events).</p>\n\n<p>Then we send these events to some Machines.</p>\n<h2 class=\"group flex items-start whitespace-pre-wrap relative mt-14 sm:mt-16 mb-4 text-navy-950 font-heading\" id=\"spinning-up-machines\"><a class=\"inline-block align-text-top relative top-[.15em] w-6 h-6 -ml-6 after:hash opacity-0 group-hover:opacity-100 transition-all\" href=\"https://fly.io/blog/feed.xml#spinning-up-machines\"></a><span class=\"plain-code\">Spinning Up Machines</span></h2>\n<p>Fly Machines are fast-booting Micro-VM&rsquo;s, controlled by an <a href=\"https://fly.io/docs/machines/working-with-machines/\" title=\"\">API</a>.</p>\n\n<p>A feature of that API is the ability to <a href=\"https://community.fly.io/t/machine-files/14453\" title=\"\">create files</a> on a new Machine. This is how we&rsquo;ll get our events into the Machine.</p>\n\n<p>When Lambdo creates a Machine, it places a file at <code>/tmp/events.json</code>. Our code just needs to read that file and parse the JSON.</p>\n<h3 class=\"group flex items-start whitespace-pre-wrap relative mt-14 sm:mt-16 mb-4 text-navy-950 font-heading\" id=\"running-our-code\"><a class=\"inline-block align-text-top relative top-[.15em] w-6 h-6 -ml-6 after:hash opacity-0 group-hover:opacity-100 transition-all\" href=\"https://fly.io/blog/feed.xml#running-our-code\"></a><span class=\"plain-code\">Running Our Code</span></h3>\n<p>Part of the ergonomics of Serverless is (usually) being limited to running just a function. Fly.io doesn&rsquo;t really care what you run, which is to our advantage. We can choose to write discreet functions per event, or we can bring our whole <a href=\"https://signalvnoise.com/svn3/the-majestic-monolith/\" title=\"\">Majestic Monolith</a> to bear.</p>\n\n<p>How do we package up our code? The real answer is &ldquo;however you want!&rdquo;, but here&rsquo;s 2 ideas.</p>\n\n<p><strong class=\"font-semibold text-navy-950\">Use Your Existing Code Base</strong></p>\n\n<p>You can just use your existing code base. This is especially easy if you&rsquo;re already deploying apps to Fly.io.</p>\n\n<p>All we&rsquo;d need to do is add some additional code - a command perhaps (<code>rake</code>, <code>artisan</code>, whatever) - that sucks in that JSON, iterates over the events, and does some stuff.</p>\n<div class=\"highlight-wrapper group relative php\">\n  <button class=\"bubble-wrap z-20 absolute right-9 -mr-0.5 top-1.5 text-transparent group-hover:text-gray-400 group-hover:hocus:text-white focus:text-white bg-transparent group-hover:bg-gray-900 group-hover:hocus:bg-gray-700 focus:bg-gray-700 transition-colors grid place-items-center w-7 h-7 rounded-lg outline-none focus:outline-none\" type=\"button\">\n    <svg class=\"w-4 h-4 pointer-events-none\" fill=\"none\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.35\" viewBox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\"><g><path d=\"M9.912 8.037h2.732c1.277 0 2.315-.962 2.315-2.237a2.325 2.325 0 00-2.315-2.31H2.959m10.228 9.01H2.959M6.802 8H2.959\"><path d=\"M11.081 6.466L9.533 8.037l1.548 1.571\"></g></svg>\n    <span class=\"bubble-sm bubble-tl [--offset-l:-9px] tail text-navy-950\">\n      Wrap text\n    </span>\n  </button>\n  <button class=\"bubble-wrap z-20 absolute right-1.5 top-1.5 text-transparent group-hover:text-gray-400 group-hover:hocus:text-white focus:text-white bg-transparent group-hover:bg-gray-900 group-hover:hocus:bg-gray-700 focus:bg-gray-700 transition-colors grid place-items-center w-7 h-7 rounded-lg outline-none focus:outline-none\" type=\"button\">\n    <svg class=\"w-4 h-4 pointer-events-none\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"1.35\" viewBox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\"><g><path d=\"M10.576 7.239c0-.995-.82-1.815-1.815-1.815H3.315c-.995 0-1.815.82-1.815 1.815v5.446c0 .995.82 1.815 1.815 1.815h5.446c.995 0 1.815-.82 1.815-1.815V7.239z\"><path d=\"M10.576 10.577h2.109A1.825 1.825 0 0014.5 8.761V3.315A1.826 1.826 0 0012.685 1.5H7.239c-.996 0-1.815.819-1.816 1.815v1.617\"></g></svg>\n    <span class=\"bubble-sm bubble-tl [--offset-l:-6px] tail [--tail-x:calc(100%-30px)] text-navy-950\">\n      Copy to clipboard\n    </span>\n  </button>\n  <div class=\"highlight relative group\">\n    <pre class=\"highlight \"><code id=\"code-baprui6l\"><span class=\"nv\">$events</span> <span class=\"o\">=</span> <span class=\"nb\">json_decode</span><span class=\"p\">(</span><span class=\"nb\">file_get_contents</span><span class=\"p\">(</span><span class=\"s2\">\"/tmp/events.json\"</span><span class=\"p\">));</span>\n\n<span class=\"k\">foreach</span> <span class=\"p\">(</span><span class=\"nv\">$events</span> <span class=\"k\">as</span> <span class=\"nv\">$event</span><span class=\"p\">)</span> <span class=\"p\">{</span>\n  <span class=\"c1\">// do a thing</span>\n<span class=\"p\">}</span>\n</code></pre>\n  </div>\n</div>\n<p>When we create an event, we&rsquo;ll tell Lambdo how to run your code - more on that later.</p>\n\n<p><strong class=\"font-semibold text-navy-950\">Use Lambdo&rsquo;s Base Images</strong></p>\n\n<p>This project also provides some &ldquo;runtimes&rdquo; (base images). This is a bit more &ldquo;traditional serverless&rdquo;, were you provide a function to run.</p>\n\n<p>Lambdo contains <a href=\"https://github.com/fly-apps/lambdo/tree/main/runtimes\" title=\"\">two runtimes</a> right now - Node and PHP. There could be more, of course, but you know&hellip;lazy.</p>\n\n<p>The Node runtime <a href=\"https://github.com/fly-apps/lambdo/blob/main/runtimes/js/src/index.js\" title=\"\">contains some code</a> that will read the JSON payload file   (again, just an array of JSON events), and call a user-supplied JS function once per event.</p>\n\n<p>An <a href=\"https://github.com/fly-apps/lambdo/tree/main/runtimes/js/sample-project\" title=\"\">example is here</a> - our code just needs to export a function that does stuff to the given event:</p>\n<div class=\"highlight-wrapper group relative javascript\">\n  <button class=\"bubble-wrap z-20 absolute right-9 -mr-0.5 top-1.5 text-transparent group-hover:text-gray-400 group-hover:hocus:text-white focus:text-white bg-transparent group-hover:bg-gray-900 group-hover:hocus:bg-gray-700 focus:bg-gray-700 transition-colors grid place-items-center w-7 h-7 rounded-lg outline-none focus:outline-none\" type=\"button\">\n    <svg class=\"w-4 h-4 pointer-events-none\" fill=\"none\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.35\" viewBox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\"><g><path d=\"M9.912 8.037h2.732c1.277 0 2.315-.962 2.315-2.237a2.325 2.325 0 00-2.315-2.31H2.959m10.228 9.01H2.959M6.802 8H2.959\"><path d=\"M11.081 6.466L9.533 8.037l1.548 1.571\"></g></svg>\n    <span class=\"bubble-sm bubble-tl [--offset-l:-9px] tail text-navy-950\">\n      Wrap text\n    </span>\n  </button>\n  <button class=\"bubble-wrap z-20 absolute right-1.5 top-1.5 text-transparent group-hover:text-gray-400 group-hover:hocus:text-white focus:text-white bg-transparent group-hover:bg-gray-900 group-hover:hocus:bg-gray-700 focus:bg-gray-700 transition-colors grid place-items-center w-7 h-7 rounded-lg outline-none focus:outline-none\" type=\"button\">\n    <svg class=\"w-4 h-4 pointer-events-none\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"1.35\" viewBox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\"><g><path d=\"M10.576 7.239c0-.995-.82-1.815-1.815-1.815H3.315c-.995 0-1.815.82-1.815 1.815v5.446c0 .995.82 1.815 1.815 1.815h5.446c.995 0 1.815-.82 1.815-1.815V7.239z\"><path d=\"M10.576 10.577h2.109A1.825 1.825 0 0014.5 8.761V3.315A1.826 1.826 0 0012.685 1.5H7.239c-.996 0-1.815.819-1.816 1.815v1.617\"></g></svg>\n    <span class=\"bubble-sm bubble-tl [--offset-l:-6px] tail [--tail-x:calc(100%-30px)] text-navy-950\">\n      Copy to clipboard\n    </span>\n  </button>\n  <div class=\"highlight relative group\">\n    <pre class=\"highlight \"><code id=\"code-q32xw0kp\"><span class=\"c1\">// File /app/index.js</span>\n<span class=\"nx\">exports</span><span class=\"p\">.</span><span class=\"nx\">handler</span> <span class=\"o\">=</span> <span class=\"k\">async</span> <span class=\"kd\">function</span><span class=\"p\">(</span><span class=\"nx\">event</span><span class=\"p\">)</span> <span class=\"p\">{</span>\n    <span class=\"nx\">console</span><span class=\"p\">.</span><span class=\"nx\">log</span><span class=\"p\">(</span><span class=\"dl\">\"</span><span class=\"s2\">Let's process an event! The event:</span><span class=\"dl\">\"</span><span class=\"p\">,</span> <span class=\"nx\">event</span><span class=\"p\">)</span>\n<span class=\"p\">}</span>\n</code></pre>\n  </div>\n</div>\n<p>The <a href=\"https://github.com/fly-apps/lambdo/tree/main/runtimes/php\" title=\"\">PHP runtime</a> is the same idea, a user-supplied handler looks like this:</p>\n<div class=\"highlight-wrapper group relative php\">\n  <button class=\"bubble-wrap z-20 absolute right-9 -mr-0.5 top-1.5 text-transparent group-hover:text-gray-400 group-hover:hocus:text-white focus:text-white bg-transparent group-hover:bg-gray-900 group-hover:hocus:bg-gray-700 focus:bg-gray-700 transition-colors grid place-items-center w-7 h-7 rounded-lg outline-none focus:outline-none\" type=\"button\">\n    <svg class=\"w-4 h-4 pointer-events-none\" fill=\"none\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.35\" viewBox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\"><g><path d=\"M9.912 8.037h2.732c1.277 0 2.315-.962 2.315-2.237a2.325 2.325 0 00-2.315-2.31H2.959m10.228 9.01H2.959M6.802 8H2.959\"><path d=\"M11.081 6.466L9.533 8.037l1.548 1.571\"></g></svg>\n    <span class=\"bubble-sm bubble-tl [--offset-l:-9px] tail text-navy-950\">\n      Wrap text\n    </span>\n  </button>\n  <button class=\"bubble-wrap z-20 absolute right-1.5 top-1.5 text-transparent group-hover:text-gray-400 group-hover:hocus:text-white focus:text-white bg-transparent group-hover:bg-gray-900 group-hover:hocus:bg-gray-700 focus:bg-gray-700 transition-colors grid place-items-center w-7 h-7 rounded-lg outline-none focus:outline-none\" type=\"button\">\n    <svg class=\"w-4 h-4 pointer-events-none\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"1.35\" viewBox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\"><g><path d=\"M10.576 7.239c0-.995-.82-1.815-1.815-1.815H3.315c-.995 0-1.815.82-1.815 1.815v5.446c0 .995.82 1.815 1.815 1.815h5.446c.995 0 1.815-.82 1.815-1.815V7.239z\"><path d=\"M10.576 10.577h2.109A1.825 1.825 0 0014.5 8.761V3.315A1.826 1.826 0 0012.685 1.5H7.239c-.996 0-1.815.819-1.816 1.815v1.617\"></g></svg>\n    <span class=\"bubble-sm bubble-tl [--offset-l:-6px] tail [--tail-x:calc(100%-30px)] text-navy-950\">\n      Copy to clipboard\n    </span>\n  </button>\n  <div class=\"highlight relative group\">\n    <pre class=\"highlight \"><code id=\"code-neg1s23g\"><span class=\"c1\">// File /app/index.php</span>\n<span class=\"k\">return</span> <span class=\"k\">function</span> <span class=\"n\">function</span><span class=\"p\">(</span><span class=\"kt\">array</span> <span class=\"nv\">$event</span><span class=\"p\">)</span> <span class=\"p\">{</span>\n    <span class=\"c1\">// Do something with $event</span>\n<span class=\"p\">}</span>\n</code></pre>\n  </div>\n</div>\n<p>Explore the <a href=\"https://github.com/fly-apps/lambdo/tree/main/runtimes\" title=\"\">runtime</a> directory of the project to see how that&rsquo;s put together.</p>\n<h2 class=\"group flex items-start whitespace-pre-wrap relative mt-14 sm:mt-16 mb-4 text-navy-950 font-heading\" id=\"sending-an-event\"><a class=\"inline-block align-text-top relative top-[.15em] w-6 h-6 -ml-6 after:hash opacity-0 group-hover:opacity-100 transition-all\" href=\"https://fly.io/blog/feed.xml#sending-an-event\"></a><span class=\"plain-code\">Sending an Event</span></h2>\n<p>Since our events are sent via SQS queue, it would be helpful to see an example SQS message. Remember how I mentioned the SQS message has some meta data?</p>\n\n<p>Here&rsquo;s an example, with said meta data:</p>\n<div class=\"highlight-wrapper group relative bash\">\n  <button class=\"bubble-wrap z-20 absolute right-9 -mr-0.5 top-1.5 text-transparent group-hover:text-gray-400 group-hover:hocus:text-white focus:text-white bg-transparent group-hover:bg-gray-900 group-hover:hocus:bg-gray-700 focus:bg-gray-700 transition-colors grid place-items-center w-7 h-7 rounded-lg outline-none focus:outline-none\" type=\"button\">\n    <svg class=\"w-4 h-4 pointer-events-none\" fill=\"none\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.35\" viewBox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\"><g><path d=\"M9.912 8.037h2.732c1.277 0 2.315-.962 2.315-2.237a2.325 2.325 0 00-2.315-2.31H2.959m10.228 9.01H2.959M6.802 8H2.959\"><path d=\"M11.081 6.466L9.533 8.037l1.548 1.571\"></g></svg>\n    <span class=\"bubble-sm bubble-tl [--offset-l:-9px] tail text-navy-950\">\n      Wrap text\n    </span>\n  </button>\n  <button class=\"bubble-wrap z-20 absolute right-1.5 top-1.5 text-transparent group-hover:text-gray-400 group-hover:hocus:text-white focus:text-white bg-transparent group-hover:bg-gray-900 group-hover:hocus:bg-gray-700 focus:bg-gray-700 transition-colors grid place-items-center w-7 h-7 rounded-lg outline-none focus:outline-none\" type=\"button\">\n    <svg class=\"w-4 h-4 pointer-events-none\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"1.35\" viewBox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\"><g><path d=\"M10.576 7.239c0-.995-.82-1.815-1.815-1.815H3.315c-.995 0-1.815.82-1.815 1.815v5.446c0 .995.82 1.815 1.815 1.815h5.446c.995 0 1.815-.82 1.815-1.815V7.239z\"><path d=\"M10.576 10.577h2.109A1.825 1.825 0 0014.5 8.761V3.315A1.826 1.826 0 0012.685 1.5H7.239c-.996 0-1.815.819-1.816 1.815v1.617\"></g></svg>\n    <span class=\"bubble-sm bubble-tl [--offset-l:-6px] tail [--tail-x:calc(100%-30px)] text-navy-950\">\n      Copy to clipboard\n    </span>\n  </button>\n  <div class=\"highlight relative group\">\n    <pre class=\"highlight \"><code id=\"code-n6j5zmqx\">aws sqs send-message <span class=\"se\">\\</span>\n    <span class=\"nt\">--queue-url</span><span class=\"o\">=</span>https://sqs.&lt;region&gt;.amazonaws.com/&lt;account&gt;/&lt;queue&gt; <span class=\"se\">\\</span>\n    <span class=\"nt\">--message-body</span><span class=\"o\">=</span><span class=\"s1\">'{\"foo\": \"bar\"}'</span> <span class=\"se\">\\</span>\n    <span class=\"nt\">--message-attributes</span><span class=\"o\">=</span><span class=\"s1\">'{\n\"size\":{\"DataType\":\"String\",\"StringValue\":\"performance-2x\"}, \n\"image\":{\"DataType\":\"String\",\"StringValue\":\"fideloper/lambdo-php-sample:latest\"}\n}'</span>\n</code></pre>\n  </div>\n</div>\n<p>The Body field of the SQS message is assumed to be a JSON string (it&rsquo;s the event itself, and its contents are arbitrary - whatever makes sense for you).</p>\n\n<p>The message Attributes contains the meta data - up to 3 important details:</p>\n\n<ol>\n<li><code>image</code>: The image to run (it might be a Docker Hub image, or something you pushed to registry.fly.io). This is <strong class=\"font-semibold text-navy-950\">required</strong>.\n</li><li><code>size</code>: The CPU size and type to use† - defaults to <code>performance-2x</code>\n</li><li><code>command</code>: The command to run, which is the Docker <code>CMD</code> equivalent - defaults to whatever your <code>CMD</code> is set in the <code>Dockerfile</code> used to create the Machine image.††\n</li></ol>\n\n<p>†You can get valid values for the <code>size</code> option by running <code>fly platform vm-sizes</code>.</p>\n\n<p>††It&rsquo;s an array form, e.g. <code>[&quot;php&quot;, &quot;artisan&quot;, &quot;foo&quot;]</code>, you may need to do some escaping of double quotes if you&rsquo;re sending messages to SQS via terminal.</p>\n<h2 class=\"group flex items-start whitespace-pre-wrap relative mt-14 sm:mt-16 mb-4 text-navy-950 font-heading\" id=\"we-did-a-lambda\"><a class=\"inline-block align-text-top relative top-[.15em] w-6 h-6 -ml-6 after:hash opacity-0 group-hover:opacity-100 transition-all\" href=\"https://fly.io/blog/feed.xml#we-did-a-lambda\"></a><span class=\"plain-code\">We did a Lambda?</span></h2>\n<p>Fly.io isn&rsquo;t serverless, but it has all these primitives that add up to serverless. You have events, Fly.io has fast-booting VM&rsquo;s. They just make sense together!</p>\n\n<p>What we did here is use <a href=\"https://github.com/fly-apps/lambdo\" title=\"\"><strong class=\"font-semibold text-navy-950\">Lambdo</strong> to respond to events by spinning up a Machine</a>. Our code can process those events any way we want.</p>\n\n<p>What I like about this approach is how flexible it can be. We can choose the base image to use and the server type (even using GPU-enabled Machines) <em>per event</em>.\nSince we have full control over the Machine VM&rsquo;s responding to the events, we can do whatever we want inside of them. Pretty neat!</p>",
      "tier": "full",
      "selection_reason": "Novel approach to event-driven architecture using VM technology",
      "audience_value": "Architectural patterns for building scalable event-driven systems",
      "urgency_score": 8,
      "category_tag": "☁️ Enterprise Tech"
    },
    {
      "id": "49203b8704dd69f2cdc72cfa067ffb5b",
      "title": "GPUs on Fly.io are available to everyone!",
      "url": "https://fly.io/blog/gpu-ga/",
      "published_date": "2026-02-19T06:59:38.552409",
      "description": "<div class=\"lead\"><p>Fly.io makes it easy to spin up compute around the world, now including powerful GPUs. Unlock the power of large language models, text transcription, and image generation with our datacenter-grade muscle!</p>\n</div>\n<p>GPUs are now available to everyone!</p>\n\n<p>We know you&rsquo;ve been excited about wanting to use GPUs on Fly.io and we&rsquo;re happy to announce that they&rsquo;re available for everyone. If you want, you can spin up GPU instances with any of the following cards:</p>\n\n<ul>\n<li>Ampere A100 (40GB) <code>a100-40gb</code>\n</li><li>Ampere A100 (80GB) <code>a100-80gb</code>\n</li><li>Lovelace L40s (48GB) <code>l40s</code>\n</li></ul>\n\n<p>To use a GPU instance today, change the <code>vm.size</code> for one of your apps or processes to any of the above GPU kinds. Here&rsquo;s how you can spin up an <a href=\"https://ollama.ai\" title=\"\">Ollama</a> server in seconds:</p>\n<div class=\"highlight-wrapper group relative toml\">\n  <button class=\"bubble-wrap z-20 absolute right-9 -mr-0.5 top-1.5 text-transparent group-hover:text-gray-400 group-hover:hocus:text-white focus:text-white bg-transparent group-hover:bg-gray-900 group-hover:hocus:bg-gray-700 focus:bg-gray-700 transition-colors grid place-items-center w-7 h-7 rounded-lg outline-none focus:outline-none\" type=\"button\">\n    <svg class=\"w-4 h-4 pointer-events-none\" fill=\"none\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.35\" viewBox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\"><g><path d=\"M9.912 8.037h2.732c1.277 0 2.315-.962 2.315-2.237a2.325 2.325 0 00-2.315-2.31H2.959m10.228 9.01H2.959M6.802 8H2.959\"><path d=\"M11.081 6.466L9.533 8.037l1.548 1.571\"></g></svg>\n    <span class=\"bubble-sm bubble-tl [--offset-l:-9px] tail text-navy-950\">\n      Wrap text\n    </span>\n  </button>\n  <button class=\"bubble-wrap z-20 absolute right-1.5 top-1.5 text-transparent group-hover:text-gray-400 group-hover:hocus:text-white focus:text-white bg-transparent group-hover:bg-gray-900 group-hover:hocus:bg-gray-700 focus:bg-gray-700 transition-colors grid place-items-center w-7 h-7 rounded-lg outline-none focus:outline-none\" type=\"button\">\n    <svg class=\"w-4 h-4 pointer-events-none\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"1.35\" viewBox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\"><g><path d=\"M10.576 7.239c0-.995-.82-1.815-1.815-1.815H3.315c-.995 0-1.815.82-1.815 1.815v5.446c0 .995.82 1.815 1.815 1.815h5.446c.995 0 1.815-.82 1.815-1.815V7.239z\"><path d=\"M10.576 10.577h2.109A1.825 1.825 0 0014.5 8.761V3.315A1.826 1.826 0 0012.685 1.5H7.239c-.996 0-1.815.819-1.816 1.815v1.617\"></g></svg>\n    <span class=\"bubble-sm bubble-tl [--offset-l:-6px] tail [--tail-x:calc(100%-30px)] text-navy-950\">\n      Copy to clipboard\n    </span>\n  </button>\n  <div class=\"highlight relative group\">\n    <pre class=\"highlight \"><code id=\"code-rumbg9gv\"><span class=\"py\">app</span> <span class=\"p\">=</span> <span class=\"s\">\"your-app-name\"</span>\n<span class=\"py\">region</span> <span class=\"p\">=</span> <span class=\"s\">\"ord\"</span>\n<span class=\"py\">vm.size</span> <span class=\"p\">=</span> <span class=\"s\">\"l40s\"</span>\n\n<span class=\"nn\">[http_service]</span>\n  <span class=\"py\">internal_port</span> <span class=\"p\">=</span> <span class=\"mi\">11434</span>\n  <span class=\"py\">force_https</span> <span class=\"p\">=</span> <span class=\"kc\">false</span>\n  <span class=\"py\">auto_stop_machines</span> <span class=\"p\">=</span> <span class=\"kc\">true</span>\n  <span class=\"py\">auto_start_machines</span> <span class=\"p\">=</span> <span class=\"kc\">true</span>\n  <span class=\"py\">min_machines_running</span> <span class=\"p\">=</span> <span class=\"mi\">0</span>\n  <span class=\"py\">processes</span> <span class=\"p\">=</span> <span class=\"nn\">[\"app\"]</span>\n\n<span class=\"nn\">[build]</span>\n  <span class=\"py\">image</span> <span class=\"p\">=</span> <span class=\"s\">\"ollama/ollama\"</span>\n\n<span class=\"nn\">[mounts]</span>\n  <span class=\"py\">source</span> <span class=\"p\">=</span> <span class=\"s\">\"models\"</span>\n  <span class=\"py\">destination</span> <span class=\"p\">=</span> <span class=\"s\">\"/root/.ollama\"</span>\n  <span class=\"py\">initial_size</span> <span class=\"p\">=</span> <span class=\"s\">\"100gb\"</span>\n</code></pre>\n  </div>\n</div>\n<p>Deploy this and bam, large language model inferencing from anywhere. If you want a private setup, see the article <a href=\"https://fly.io/blog/scaling-llm-ollama/\" title=\"\">Scaling Large Language Models to zero with Ollama</a> for more information. You never know when you have a sandwich emergency and don&rsquo;t know what you can make with what you have on hand.</p>\n\n<p>We are working on getting some lower-cost A10 GPUs in the next few weeks. We&rsquo;ll update you when they&rsquo;re ready.</p>\n\n<p>If you want to explore the possibilities of GPUs on Fly.io, here&rsquo;s a few articles that may give you ideas:</p>\n\n<ul>\n<li><a href=\"https://fly.io/blog/not-midjourney-bot/\" title=\"\">Deploy Your Own (Not) MidJourney Bot On Fly GPUs</a>\n</li><li><a href=\"https://fly.io/blog/scaling-llm-ollama/\" title=\"\">Scaling Large Language Models to zero with Ollama</a>\n</li><li><a href=\"https://fly.io/blog/transcribing-on-fly-gpu-machines/\" title=\"\">Transcribing on Fly GPU Machines</a>\n</li></ul>\n\n<p>Depending on factors such as your organization&rsquo;s age and payment history, you may need to go through additional verification steps.</p>\n\n<p>If you&rsquo;ve been experimenting with Fly.io GPUs and have made something cool, let us know on the <a href=\"https://community.fly.io/\" title=\"\">Community Forums</a> or by mentioning us <a href=\"https://hachyderm.io/@flydotio\" title=\"\">on Mastodon</a>! We&rsquo;ll boost the cool ones.</p>",
      "source": "The Fly Blog",
      "category": "Developer Tools & Platforms",
      "segment": "builders",
      "source_type": "primary",
      "raw_content": "<div class=\"lead\"><p>Fly.io makes it easy to spin up compute around the world, now including powerful GPUs. Unlock the power of large language models, text transcription, and image generation with our datacenter-grade muscle!</p>\n</div>\n<p>GPUs are now available to everyone!</p>\n\n<p>We know you&rsquo;ve been excited about wanting to use GPUs on Fly.io and we&rsquo;re happy to announce that they&rsquo;re available for everyone. If you want, you can spin up GPU instances with any of the following cards:</p>\n\n<ul>\n<li>Ampere A100 (40GB) <code>a100-40gb</code>\n</li><li>Ampere A100 (80GB) <code>a100-80gb</code>\n</li><li>Lovelace L40s (48GB) <code>l40s</code>\n</li></ul>\n\n<p>To use a GPU instance today, change the <code>vm.size</code> for one of your apps or processes to any of the above GPU kinds. Here&rsquo;s how you can spin up an <a href=\"https://ollama.ai\" title=\"\">Ollama</a> server in seconds:</p>\n<div class=\"highlight-wrapper group relative toml\">\n  <button class=\"bubble-wrap z-20 absolute right-9 -mr-0.5 top-1.5 text-transparent group-hover:text-gray-400 group-hover:hocus:text-white focus:text-white bg-transparent group-hover:bg-gray-900 group-hover:hocus:bg-gray-700 focus:bg-gray-700 transition-colors grid place-items-center w-7 h-7 rounded-lg outline-none focus:outline-none\" type=\"button\">\n    <svg class=\"w-4 h-4 pointer-events-none\" fill=\"none\" stroke=\"currentColor\" stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"1.35\" viewBox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\"><g><path d=\"M9.912 8.037h2.732c1.277 0 2.315-.962 2.315-2.237a2.325 2.325 0 00-2.315-2.31H2.959m10.228 9.01H2.959M6.802 8H2.959\"><path d=\"M11.081 6.466L9.533 8.037l1.548 1.571\"></g></svg>\n    <span class=\"bubble-sm bubble-tl [--offset-l:-9px] tail text-navy-950\">\n      Wrap text\n    </span>\n  </button>\n  <button class=\"bubble-wrap z-20 absolute right-1.5 top-1.5 text-transparent group-hover:text-gray-400 group-hover:hocus:text-white focus:text-white bg-transparent group-hover:bg-gray-900 group-hover:hocus:bg-gray-700 focus:bg-gray-700 transition-colors grid place-items-center w-7 h-7 rounded-lg outline-none focus:outline-none\" type=\"button\">\n    <svg class=\"w-4 h-4 pointer-events-none\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"1.35\" viewBox=\"0 0 16 16\" xmlns=\"http://www.w3.org/2000/svg\"><g><path d=\"M10.576 7.239c0-.995-.82-1.815-1.815-1.815H3.315c-.995 0-1.815.82-1.815 1.815v5.446c0 .995.82 1.815 1.815 1.815h5.446c.995 0 1.815-.82 1.815-1.815V7.239z\"><path d=\"M10.576 10.577h2.109A1.825 1.825 0 0014.5 8.761V3.315A1.826 1.826 0 0012.685 1.5H7.239c-.996 0-1.815.819-1.816 1.815v1.617\"></g></svg>\n    <span class=\"bubble-sm bubble-tl [--offset-l:-6px] tail [--tail-x:calc(100%-30px)] text-navy-950\">\n      Copy to clipboard\n    </span>\n  </button>\n  <div class=\"highlight relative group\">\n    <pre class=\"highlight \"><code id=\"code-rumbg9gv\"><span class=\"py\">app</span> <span class=\"p\">=</span> <span class=\"s\">\"your-app-name\"</span>\n<span class=\"py\">region</span> <span class=\"p\">=</span> <span class=\"s\">\"ord\"</span>\n<span class=\"py\">vm.size</span> <span class=\"p\">=</span> <span class=\"s\">\"l40s\"</span>\n\n<span class=\"nn\">[http_service]</span>\n  <span class=\"py\">internal_port</span> <span class=\"p\">=</span> <span class=\"mi\">11434</span>\n  <span class=\"py\">force_https</span> <span class=\"p\">=</span> <span class=\"kc\">false</span>\n  <span class=\"py\">auto_stop_machines</span> <span class=\"p\">=</span> <span class=\"kc\">true</span>\n  <span class=\"py\">auto_start_machines</span> <span class=\"p\">=</span> <span class=\"kc\">true</span>\n  <span class=\"py\">min_machines_running</span> <span class=\"p\">=</span> <span class=\"mi\">0</span>\n  <span class=\"py\">processes</span> <span class=\"p\">=</span> <span class=\"nn\">[\"app\"]</span>\n\n<span class=\"nn\">[build]</span>\n  <span class=\"py\">image</span> <span class=\"p\">=</span> <span class=\"s\">\"ollama/ollama\"</span>\n\n<span class=\"nn\">[mounts]</span>\n  <span class=\"py\">source</span> <span class=\"p\">=</span> <span class=\"s\">\"models\"</span>\n  <span class=\"py\">destination</span> <span class=\"p\">=</span> <span class=\"s\">\"/root/.ollama\"</span>\n  <span class=\"py\">initial_size</span> <span class=\"p\">=</span> <span class=\"s\">\"100gb\"</span>\n</code></pre>\n  </div>\n</div>\n<p>Deploy this and bam, large language model inferencing from anywhere. If you want a private setup, see the article <a href=\"https://fly.io/blog/scaling-llm-ollama/\" title=\"\">Scaling Large Language Models to zero with Ollama</a> for more information. You never know when you have a sandwich emergency and don&rsquo;t know what you can make with what you have on hand.</p>\n\n<p>We are working on getting some lower-cost A10 GPUs in the next few weeks. We&rsquo;ll update you when they&rsquo;re ready.</p>\n\n<p>If you want to explore the possibilities of GPUs on Fly.io, here&rsquo;s a few articles that may give you ideas:</p>\n\n<ul>\n<li><a href=\"https://fly.io/blog/not-midjourney-bot/\" title=\"\">Deploy Your Own (Not) MidJourney Bot On Fly GPUs</a>\n</li><li><a href=\"https://fly.io/blog/scaling-llm-ollama/\" title=\"\">Scaling Large Language Models to zero with Ollama</a>\n</li><li><a href=\"https://fly.io/blog/transcribing-on-fly-gpu-machines/\" title=\"\">Transcribing on Fly GPU Machines</a>\n</li></ul>\n\n<p>Depending on factors such as your organization&rsquo;s age and payment history, you may need to go through additional verification steps.</p>\n\n<p>If you&rsquo;ve been experimenting with Fly.io GPUs and have made something cool, let us know on the <a href=\"https://community.fly.io/\" title=\"\">Community Forums</a> or by mentioning us <a href=\"https://hachyderm.io/@flydotio\" title=\"\">on Mastodon</a>! We&rsquo;ll boost the cool ones.</p>",
      "tier": "full",
      "selection_reason": "Major infrastructure announcement for GPU availability",
      "audience_value": "New options for deploying ML workloads globally",
      "urgency_score": 9,
      "category_tag": "🚀 AI & Innovation"
    },
    {
      "id": "e414f48e3321b53c89e83a9b694a385c",
      "title": "DrP: Meta’s Root Cause Analysis Platform at Scale",
      "url": "https://engineering.fb.com/2025/12/19/data-infrastructure/drp-metas-root-cause-analysis-platform-at-scale/",
      "published_date": "2026-02-19T06:59:32.119608",
      "description": "<p>Incident investigation can be a daunting task in today’s digital landscape, where large-scale systems comprise numerous interconnected components and dependencies DrP is a root cause analysis (RCA) platform, designed by Meta, to programmatically automate the investigation process, significantly reducing the mean time to resolve (MTTR) for incidents and alleviating on-call toil Today, DrP is used [...]</p>\n<p><a class=\"btn btn-secondary understrap-read-more-link\" href=\"https://engineering.fb.com/2025/12/19/data-infrastructure/drp-metas-root-cause-analysis-platform-at-scale/\">Read More...</a></p>\n<p>The post <a href=\"https://engineering.fb.com/2025/12/19/data-infrastructure/drp-metas-root-cause-analysis-platform-at-scale/\" rel=\"nofollow\">DrP: Meta&#8217;s Root Cause Analysis Platform at Scale</a> appeared first on <a href=\"https://engineering.fb.com\" rel=\"nofollow\">Engineering at Meta</a>.</p>",
      "source": "Engineering at Meta",
      "category": "Engineering & Development",
      "segment": "innovators",
      "source_type": "primary",
      "raw_content": "<p><span style=\"font-weight: 400;\">Incident investigation can be a daunting task in today’s digital landscape, where large-scale systems comprise numerous interconnected components and dependencies</span></p>\n<p><a href=\"https://arxiv.org/abs/2512.04250\"><span style=\"font-weight: 400;\">DrP</span></a><span style=\"font-weight: 400;\"> is a root cause analysis (RCA) platform, designed by Meta, to programmatically automate the investigation process, significantly reducing the mean time to resolve (MTTR) for incidents and alleviating on-call toil</span></p>\n<p><span style=\"font-weight: 400;\">Today, DrP is used by over 300 teams at Meta, running 50,000 analyses daily, and has been effective in reducing MTTR by 20-80% </span></p>\n<p><span style=\"font-weight: 400;\">By understanding DrP and its capabilities, we can unlock new possibilities for efficient incident resolution and improved system reliability.</span></p>\n<h2><span style=\"font-weight: 400;\">What It Is</span></h2>\n<p><span style=\"font-weight: 400;\">DrP is an end-to-end platform that automates the investigation process for large-scale systems. It addresses the inefficiencies of manual investigations, which often rely on outdated playbooks and ad-hoc scripts. These traditional methods can lead to prolonged downtimes and increased on-call toil as engineers spend countless hours triaging and debugging incidents.</span></p>\n<p><span style=\"font-weight: 400;\">DrP offers a comprehensive solution by providing an expressive and flexible SDK to author investigation playbooks, known as analyzers. These analyzers are executed by a scalable backend system, which integrates seamlessly with mainstream workflows such as alerts and incident management tools. Additionally, DrP includes a post-processing system to automate actions based on investigation results, such as mitigation steps.</span></p>\n<p><img alt=\"\" class=\"alignnone size-full wp-image-23498\" height=\"1125\" src=\"https://engineering.fb.com/wp-content/uploads/2025/12/Meta-DrP-image-1.png\" width=\"1999\" /></p>\n<p><span style=\"font-weight: 400;\">DrP’s key components include: </span></p>\n<ol>\n<li style=\"font-weight: 400;\"><b>Expressive SDK</b><span style=\"font-weight: 400;\">: The DrP SDK allows engineers to codify investigation workflows into analyzers. It provides a rich set of helper libraries and machine learning (ML) algorithms for data access and problem isolation analysis, such as anomaly detection, event isolation, time series correlation and dimension analysis.</span></li>\n<li style=\"font-weight: 400;\"><b>Scalable backend</b><span style=\"font-weight: 400;\">: The backend system executes the analyzers, providing both multi-tenant and isolated execution environments. It ensures that analyzers can be run at scale, handling thousands of automated analyses per day.</span></li>\n<li style=\"font-weight: 400;\"><b>Integration with workflows</b><span style=\"font-weight: 400;\">: DrP integrates with alerting and incident management tools, allowing for the auto-triggering of analyzers on incidents. This integration ensures that investigation results are immediately available to on-call engineers.</span></li>\n<li style=\"font-weight: 400;\"><b>Post-processing system</b><span style=\"font-weight: 400;\">: After an investigation, the post-processing system can take automated actions based on the analysis results. For example, it can create tasks or pull requests to mitigate issues identified during the investigation.</span></li>\n</ol>\n<h2><span style=\"font-weight: 400;\">How It Works </span></h2>\n<h3><span style=\"font-weight: 400;\">Authoring Workflow</span></h3>\n<p><img alt=\"\" class=\"alignnone size-full wp-image-23499\" height=\"1125\" src=\"https://engineering.fb.com/wp-content/uploads/2025/12/Meta-DrP-image-2.jpg\" width=\"1999\" /></p>\n<p><span style=\"font-weight: 400;\">The process of creating automated playbooks, or analyzers, begins with the DrP SDK. Engineers enumerate the investigation steps, listing inputs and potential paths to isolate problem areas. The SDK provides APIs and libraries to codify these workflows, allowing engineers to capture all required input parameters and context in a type-safe manner.</span></p>\n<ol>\n<li style=\"font-weight: 400;\"><b>Enumerate investigation steps</b><span style=\"font-weight: 400;\">: Engineers start by listing the steps required to investigate an incident, including inputs and potential paths to isolate the problem.</span></li>\n<li style=\"font-weight: 400;\"><b>Bootstrap code</b><span style=\"font-weight: 400;\">: The DrP SDK provides bootstrap code to create a template analyzer with pre-populated boilerplate code. Engineers extend this code to capture all necessary input parameters and context.</span></li>\n<li style=\"font-weight: 400;\"><b>Data access and analysis</b><span style=\"font-weight: 400;\">: The SDK includes libraries for data access and analysis, such as dimension analysis and time series correlation. Engineers use these libraries to code the main investigation decision tree into the analyzer.</span></li>\n<li style=\"font-weight: 400;\"><b>Analyzer chaining</b><span style=\"font-weight: 400;\">: For dependent service analysis, the SDK’s APIs allow for seamless chaining of analyzers, passing context and obtaining outputs.</span></li>\n<li style=\"font-weight: 400;\"><b>Output and post-processing</b><span style=\"font-weight: 400;\">: The output method captures findings from the analysis, using special data structures for both text and machine-readable formats. Post-processing methods automate actions based on analyzer findings.</span></li>\n</ol>\n<p><span style=\"font-weight: 400;\">Once created, analyzers are tested and sent for code review. DrP offers automated backtesting integrated into code review tools, ensuring high-quality analyzers before deployment.</span></p>\n<h3><span style=\"font-weight: 400;\">Consumption Workflow</span></h3>\n<p><span style=\"font-weight: 400;\">In production, analyzers integrate with tools like UI, CLI, alerts, and incident management systems. Analyzers can automatically trigger upon alert activation, providing immediate results to on-call engineers and improving response times. The DrP backend manages a queue for requests and a worker pool for secure execution, with results returning asynchronously.</span></p>\n<ol>\n<li style=\"font-weight: 400;\"><b>Integration with alerts</b><span style=\"font-weight: 400;\">: DrP is integrated with alerting systems, allowing analyzers to trigger automatically when an alert is activated. This provides immediate analysis results to on-call engineers.</span></li>\n<li style=\"font-weight: 400;\"><b>Execution and monitoring</b><span style=\"font-weight: 400;\">: The backend system manages a queue for analyzer requests and a worker pool for execution. It monitors execution, ensuring that analyzers run securely and efficiently.</span></li>\n<li style=\"font-weight: 400;\"><b>Post-processing and insights</b><span style=\"font-weight: 400;\">: A separate post-processing system handles analysis results, annotating alerts with findings. The DrP Insights system periodically analyzes outputs to identify and rank top alert causes, aiding teams in prioritizing reliability improvements.</span></li>\n</ol>\n<h2><span style=\"font-weight: 400;\">Why It Matters</span></h2>\n<h3><span style=\"font-weight: 400;\">Reducing MTTR</span></h3>\n<p><span style=\"font-weight: 400;\">DrP has demonstrated significant improvements in reducing MTTR across various teams and use cases. By automating manual investigations, DrP enables faster triage and mitigation of incidents, leading to quicker system recovery and improved availability.</span></p>\n<ol>\n<li style=\"font-weight: 400;\"><b>Efficiency</b><span style=\"font-weight: 400;\">: Automated investigations reduce the time engineers spend on manual triage, allowing them to focus on more complex tasks. This efficiency translates to faster incident resolution and reduced downtime.</span></li>\n<li style=\"font-weight: 400;\"><b>Consistency</b><span style=\"font-weight: 400;\">: By codifying investigation workflows into analyzers, DrP ensures consistent and repeatable investigations. This consistency reduces the likelihood of errors and improves the reliability of incident resolution.</span></li>\n<li style=\"font-weight: 400;\"><b>Scalability</b><span style=\"font-weight: 400;\">: DrP can handle thousands of automated analyses per day, making it suitable for large-scale systems with complex dependencies. Its scalability ensures that it can support the needs of growing organizations.</span></li>\n</ol>\n<h3><span style=\"font-weight: 400;\">Enhancing On-Call Productivity</span></h3>\n<p><span style=\"font-weight: 400;\">The automation provided by DrP reduces the on-call effort during investigations, saving engineering hours and reducing on-call fatigue. By automating repetitive and time-consuming steps, DrP allows engineers to focus on more complex tasks, improving overall productivity.</span></p>\n<h3><span style=\"font-weight: 400;\">Scalability and Adoption</span></h3>\n<p><span style=\"font-weight: 400;\">DrP has been successfully deployed at scale at Meta, covering over 300 teams and 2000 analyzers, executing 50,000 automated analyses per day. Its integration into mainstream workflows, such as alerting systems, has facilitated widespread adoption and demonstrated its value in real-world scenarios.</span></p>\n<ol>\n<li style=\"font-weight: 400;\"><b>Widespread adoption</b><span style=\"font-weight: 400;\">: DrP has been adopted by hundreds of teams across various domains, demonstrating its versatility and effectiveness in addressing diverse investigation needs.</span></li>\n<li style=\"font-weight: 400;\"><b>Proven impact</b><span style=\"font-weight: 400;\">: DrP has been in production for over five years, with proven results in reducing MTTR and improving on-call productivity. Its impact is evident in the positive feedback received from users and the significant improvements in incident resolution times.</span></li>\n<li style=\"font-weight: 400;\"><b>Continuous improvement</b><span style=\"font-weight: 400;\">: DrP is continuously evolving, with ongoing enhancements to its ML algorithms, SDK, backend system, and integrations. </span><span style=\"font-weight: 400;\">This commitment to continuous improvement ensures that DrP remains a cutting-edge solution for incident investigations, while its growing adoption across teams enables existing workflows and analyzers to be reused by others, compounding the shared knowledge base and making it increasingly valuable across the organization.</span></li>\n</ol>\n<h2><span style=\"font-weight: 400;\">What’s Next</span></h2>\n<p><span style=\"font-weight: 400;\">Looking ahead, DrP aims to evolve into an AI-native platform, playing a central role in advancing Meta’s broader AI4Ops vision</span><span style=\"font-weight: 400;\">, enabling more powerful and automated investigations. This transformation will enhance analysis by delivering more accurate and insightful results, while also simplifying the user experience through streamlined ML algorithms, SDKs, UI, and integrations facilitating effortless authoring and execution of analyzers.</span></p>\n<h2><span style=\"font-weight: 400;\">Read the Paper</span></h2>\n<p><a href=\"https://arxiv.org/abs/2512.04250\"><span style=\"font-weight: 400;\">DrP: Meta&#8217;s Efficient Investigations Platform at Scale</span></a></p>\n<h2>Acknowledgements</h2>\n<p><i><span style=\"font-weight: 400;\">We wish to thank contributors to this effort across many teams throughout Meta</span></i></p>\n<p><i><span style=\"font-weight: 400;\">Team &#8211;  </span></i><i><span style=\"font-weight: 400;\">Eduardo Hernandez</span></i><i><span style=\"font-weight: 400;\">, </span></i><i><span style=\"font-weight: 400;\">Jimmy Wang</span></i><i><span style=\"font-weight: 400;\">, Akash Jothi, Kshitiz Bhattarai, </span></i><i><span style=\"font-weight: 400;\">Shreya Shah</span></i><i><span style=\"font-weight: 400;\">, </span></i><i><span style=\"font-weight: 400;\">Neeru Sharma</span></i><i><span style=\"font-weight: 400;\">, Alex He, Juan-Pablo E, Oswaldo R, Vamsi Kunchaparthi, Daniel An, Rakesh Vanga, Ankit Agarwal, Narayanan Sankaran, Vlad Tsvang, Khushbu Thakur, </span></i><i><span style=\"font-weight: 400;\">Srikanth Kamath</span></i><i><span style=\"font-weight: 400;\">, Chris Davis, </span></i><i><span style=\"font-weight: 400;\">Rohit JV</span></i><i><span style=\"font-weight: 400;\">, </span></i><i><span style=\"font-weight: 400;\">Ohad Yahalom</span></i><i><span style=\"font-weight: 400;\">, Bao Nguyen, Viraaj Navelkar, Arturo Lira, Nikolay Laptev, Sean Lee, Yulin Chen</span></i></p>\n<p><em><span style=\"font-weight: 400;\">Leadership &#8211; Sanjay Sundarajan, John Ehrhardt, Ruben Badaro, </span><span style=\"font-weight: 400;\">Nitin Gupta</span><span style=\"font-weight: 400;\">, Victoria Dudin, </span><span style=\"font-weight: 400;\">Benjamin Renard</span><span style=\"font-weight: 400;\">, Gautam Shanbhag, Barak Yagour, Aparna Ramani</span></em></p>\n<p>The post <a href=\"https://engineering.fb.com/2025/12/19/data-infrastructure/drp-metas-root-cause-analysis-platform-at-scale/\" rel=\"nofollow\">DrP: Meta&#8217;s Root Cause Analysis Platform at Scale</a> appeared first on <a href=\"https://engineering.fb.com\" rel=\"nofollow\">Engineering at Meta</a>.</p>",
      "tier": "full",
      "selection_reason": "Meta's approach to automated root cause analysis at scale",
      "audience_value": "Insights into building automated debugging systems",
      "urgency_score": 8,
      "category_tag": "☁️ Enterprise Tech"
    },
    {
      "id": "ebfaa4b6a593cc91453c84fa1dc6ac1d",
      "title": "ACID Transactions are not just for banks — the Vitess approach",
      "url": "https://planetscale.com/blog/acid-transactions-are-not-just-for-banks-vitess-approach",
      "published_date": "2026-02-19T06:59:41.764416",
      "description": "Build systems that do not lose data. Vitess prevents asynchronous failure in two ways: (1) ensuring that the changes are saved locally on storage with the redo log and binary logs safely written to disk and (2) making use of semi-synchronous replication.",
      "source": "Blog — PlanetScale",
      "category": "Database & Backend",
      "segment": "builders",
      "source_type": "primary",
      "raw_content": "The outdated example of transferring money from account A to account B needs to be updated for today's emerging applications. Vitess provides an answer.\nRemember the early 2000s world of Office Space? Java was still new, usenet passed for social media, and applications were using proprietary Sun hardware with Oracle databases. Then the tech bubble burst, and in that time of frugality, companies shifted to using commodity hardware with open source databases. In many cases, the database of choice was MySQL. The overall solution was cheaper, but you did have to give up some features. Due to the limits of both hardware and software, MySQL was often configured in such a way that it would lose data if there was a system failure.\nACID (Atomicity, Consistency, Isolation, and Durability) is a set of guarantees that traditional database systems provide applications. Applications should be able to depend on these guarantees during regular operations or if there is a failure.\nOf particular importance is Durability, which means that when the database system acknowledges a transaction (a commit in database terminology), it should be able to survive permanently, even if there is a system crash or power failure.\nDurability, does it really matter?\nAs companies started using MySQL on cheaper hardware, they did not always configure it to provide full ACID guarantees. Around the same time, NoSQL systems such as MongoDB became popular, and these systems initially did not even offer ACID transactions or durability guarantees. What you got in return was improved performance. This way of operating buffered a greater number of changes in memory and then batched the access to storage devices.\nBeing able to scale (\"web-scale\") was the priority. Providing correctness when failures occurred (and in complex systems, failures always do occur) was a secondary consideration.\nI remember this clearly from the early days of YouTube. Most of the team had previously worked at PayPal, and when the team took shortcuts around durability, the refrain always was \"it's okay, it's not money.\" This eventually changed as monetization became important and was tied to view counts.\nIn today's world, there are better examples of the need for durability than financial transactions.\nBetter examples for today's applications\nThe traditional example of ACID demonstrates the potential failures that could occur when withdrawing $20 from Account A and depositing it into Account B, and ensuring that the system never encounters a case where the money is lost, both accounts are credited, or the transaction is acknowledged as successful, only to later be reversed.\nFor today's applications, a better example would be:\nWhile participating in a collaboration tool like Slack, you might decide to create a private channel with a few colleagues. You realize that you have added the wrong person to this channel and you want to remove them. When you do so, you receive a confirmation that this update was successful. This change updates an entry in a database server. If the server crashes two seconds later, the expectation is that the user will have been removed and will no longer see the channel.\nSimilarly, when I hit send on a message to a colleague, I expect that the message has been sent. I do not consider that it might show as sent but, due to a system failure, may not have been received by my colleague.\n(Note: Slack actually does not have these problems because they use Vitess for storage at scale.)\nThese problems are created by asynchronous failures. The problem occurs because the database server has told the application that the operation was successful, the application has then informed the user of success, but then the database server later failed to deliver on its promises.\nThe Vitess approach\nVitess is an open source database scaling system for MySQL. We originally developed Vitess to scale YouTube, and it is now a CNCF graduated project (along with Kubernetes, Prometheus, and others).\nVitess prevents the asynchronous failure scenario that we talked about above in two different ways:\nFirst, it ensures that the changes are saved locally on storage, with the redo log and binary logs safely written to disk. Recent MySQL versions (5.7+) will do this by default, but Vitess ensures this on all versions of MySQL it supports.\nVitess makes use of semi-synchronous replication. This ensures that a change has not only been applied locally on the database server but also that there is at least one other server which has received and persisted the change.\n\"Semi-sync\" provides a great tradeoff between durability guarantees and performance. By contrast, some modern systems are solving this problem with a quorum, where the majority of nodes must receive the modification for it to be successful. While quorum can simplify some of the steps of failover, as the system grows (and adds more nodes), the performance overhead increases. This means that performance decreases.\nAnother advantage of the Vitess approach is that not every replica needs to be a member of the semi-sync group, so you can choose to design failure zones where at least one replica in a different availability zone/data center has a copy before the operation is considered successful.\nVitess has been the system of record for companies like YouTube, Slack, Square Cash, Pinterest, JD.com, and Hubspot for many years. As of today, we do not know of any data loss incidents at these companies due to Vitess.\nConclusion: Build systems that do not lose data\nIt is easy to forget just how much we integrate modern applications into our lives. As more and more parts of our lives depend on our applications, our expectations for durability and consistency have increased. The shortcuts that we took in the early 2000s helped us scale systems when the technology was not always there. Now that we have the technology, we should be building systems that do not lose data in the face of ordinary failures and have a much lower chance of losing data in the face of catastrophic failures.\nTo learn more about open source Vitess, go to vitess.io or join the Vitess Slack channel.",
      "tier": "full",
      "selection_reason": "Deep dive into distributed database transaction handling",
      "audience_value": "Best practices for ensuring data consistency at scale",
      "urgency_score": 8,
      "category_tag": "☁️ Enterprise Tech"
    },
    {
      "id": "f5ef5a57914965e5ce2b78194af49f97",
      "title": "How to start consolidating your cybersecurity tools",
      "url": "https://www.hashicorp.com/blog/how-to-start-consolidating-your-cybersecurity-tools",
      "published_date": "2026-02-19T06:59:41.070924",
      "description": "Get a practical roadmap for consolidating your cybersecurity tools and platforms. See how a healthcare company ran an effective consolidation using this strategy.",
      "source": "HashiCorp Blog",
      "category": "Cloud & Infrastructure",
      "segment": "builders",
      "source_type": "primary",
      "raw_content": "<p>In <a href=\"https://www.hashicorp.com/blog/the-risks-of-cybersecurity-tool-sprawl-and-why-we-need-consolidation\">part 1</a> of this two-part blog series, we looked at why cybersecurity tool sprawl has become a critical risk and cost issue for modern enterprises. From overlapping functionality and alert fatigue, to slower incident response and increased maintenance burden, the downsides of fragmented tooling are clear and growing.</p>\n\n<p>Now, we move from <em>why</em> to <em>how</em>. If your organization is ready to simplify, reduce risk, and improve efficiency, this practical guide outlines the first steps toward a more unified, strategic approach to cybersecurity.</p>\n\n<h2>Getting started with cybersecurity consolidation</h2>\n\n<p>There are three overarching steps you should take to kickstart a cybersecurity consolidation. </p>\n\n<h3>1. Bring cybersecurity, compliance, and platform teams together</h3>\n\n<p>The shift from fragmented tool stacks toward platform-level consolidation is <a href=\"https://securityboulevard.com/2025/04/the-great-security-tool-consolidation-how-enterprises-are-rethinking-their-security-strategy\">becoming mainstream</a> in cybersecurity as well as IT at-large. The first step in any modernization effort is the people element, so that means establishing a <a href=\"https://www.hashicorp.com/en/resources/what-is-a-platform-team-and-why-do-we-need-them\">platform team</a>.</p>\n\n<p>Once platform teams are established and working more closely with cybersecurity and compliance, the cybersecurity and compliance teams can integrate their requirements into the platform itself rather than working separately from it. </p>\n\n<p>At this stage, many of the tool consolidation opportunities will become apparent. The platform team should lead the tool-buying process because they are focused on the big picture. They can look outside of the traditional cybersecurity vendor bubble and start buying product platforms and ecosystems instead of many single-point solutions, increasing cost efficiency and productivity.  </p>\n\n<h3>2. Assess the tool and vendor sprawl</h3>\n\n<p>With buy-in from cybersecurity and platform teams, the next step is to understand your tooling landscape. </p>\n\n<h4>Take an inventory of tools</h4>\n\n<p>Get stakeholders from every relevant team into a room: this can include networking, cybersecurity, DNS, firewall, cryptography, platform, cloud, datacenter sysadmins, architecture, GRC, CI/CD or release engineers, etc. Each team should discuss the consolidation initiative and give an inventory of their tool stacks, while also looking for any untracked (possibly shadow IT) tools being used by smaller teams or individuals.</p>\n\n<p>Document all the security (or security-adjacent) tools and list all of their capabilities. Seeing all of the functionality your tools offer in one place will help you make decisions in the next steps.</p>\n\n<ul>\n<li>Do you have multiple instances of the same tool?</li>\n<li>Do you have multiple tools with overlapping functionality?</li>\n<li>Do you have tools from many vendors when a few could offer the same functionality?</li>\n<li>Which tools aren’t necessary or aren’t being used?</li>\n</ul>\n\n<p>Research your existing and potential security product vendors to see which ones have large, compelling solution portfolios that could replace some of your point solutions from unique vendors. Find the answers to a few questions:</p>\n\n<ul>\n<li>Who are the vendors with multiple, synergistic products built around a platform mindset, who also have substantial case study collections?</li>\n<li>Are there any opportunities for tighter integration and shared observability between products if some of your tools are replaced with products from a single vendor?</li>\n<li>What are the support efficiencies (one vendor to call) and cost savings you could get from consolidating some functionality needs into one vendor relationship?</li>\n</ul>\n\n<p>After you’ve identified tools that aren’t being used, your teams will also want to take a hard look at tools that, despite being used, aren’t actually necessary for your cybersecurity goals. Sometimes rigorous examination of tooling will uncover certain products that are overkill for your threat model.</p>\n\n<p>Read about the <a href=\"https://www.hashicorp.com/en/resources/roche-s-transition-from-tools-to-platforms-with-terraform-and-vault\">consolidation journey taken by Roche healthcare</a>, which includes several more detailed takeaways from their experience.</p>\n\n<h3>3. Start with the most impactful, risk-reducing tools</h3>\n\n<p>Think about the most common security breach methods today. They’re not AI attacks or the latest zero-day discovery. The <a href=\"https://www.verizon.com/business/resources/reports/2024-dbir-executive-summary.pdf\">most common attack vectors</a> are still <strong>social engineering</strong>, mainly through phishing, and <strong>credential management</strong>.</p>\n\n<p>Start your cybersecurity consolidation journey with those two product use cases. For social engineering, your main defenses will be phishing prevention tools and strong org-wide cybersecurity training.</p>\n\n<p>For credential management, these are the key steps for re-orienting and consolidating your cybersecurity around this key area:</p>\n\n<ol>\n<li><p><a href=\"https://www.hashicorp.com/en/on-demand/identity-first-security-maximizes-cybersecurity-effectiveness\">Identity-based security</a> is the foundation — use tools built around this.</p></li>\n<li><p>Choose one central secrets management platform to be your nerve center for credential management and tracking. Secrets management products also act as the main identity broker for service and cloud infrastructure access.</p></li>\n<li><p>Pick a platform that integrates well with version control systems (VCS), continuous delivery (CI/CD), and infrastructure provisioning.</p></li>\n<li><p>The platform should have native governance, risk, and compliance (GRC) guardrails such as static/dynamic testing and <a href=\"https://developer.hashicorp.com/sentinel/docs/concepts/policy-as-code\">policy as code</a>.</p></li>\n<li><p>The platform should also include native, or same-vendor, secret scanning, public key infrastructure (PKI), and access management solutions.\nFrom there, your tooling can branch out, but the focus should be picking 1-2 vendors and product suites that can provide that initial cybersecurity foundation focused on protecting the most common threat: credential theft.</p></li>\n</ol>\n\n<p>Platforms built by the same vendor from the ground up are much more robust, integrated, and scalable, and they offer a unified experience. However, don’t be pressured to buy more features than you need, unless you expect to need those features in the future.</p>\n\n<h2>The benefits of cybersecurity tool consolidation</h2>\n\n<p><a href=\"https://securityboulevard.com/2025/02/security-consolidation-improves-efficiency-threat-mitigation/\">Research shows</a> that organizations that consolidate security tooling into integrated platforms often achieve measurable improvements in operational outcomes. For example, enterprises that adopt unified platforms report significantly faster threat detection and containment times compared with fragmented stacks, and considerably higher returns on security investments due to reduced duplication, streamlined workflows, and stronger data integration across tools.</p>\n\n<p>Taken together, these benefits explain why cybersecurity tool consolidation is increasingly viewed as a foundational capability rather than a tactical optimization. By reducing fragmentation, organizations gain clearer visibility into risk, more consistent policy enforcement, and a security posture that is easier to operate and evolve over time. Just as importantly, consolidation creates the conditions for better collaboration across security, platform, and compliance teams, enabling them to focus on shared outcomes instead of managing disconnected tools. For organizations ready to move from sprawl to strategy, these advantages make consolidation a logical starting point for building a more resilient and scalable cybersecurity program.</p>\n\n<h2>Real world cybersecurity consolidation stories</h2>\n\n<p>Organizational leaders should push their cybersecurity, engineering, and infrastructure operations teams to reduce complexity by centralizing and consolidating on a handful of security platforms rather than a litany of smaller cybersecurity tools.</p>\n\n<p>We’ve seen <a href=\"https://www.hashicorp.com/en/resources/roche-s-transition-from-tools-to-platforms-with-terraform-and-vault\">Roche</a> and many other companies run successful cybersecurity product consolidation initiatives and we’d love to share more insights. We’ve reduced risk for thousands of companies including <a href=\"https://www.hashicorp.com/en/case-studies/vodafone-italy\">Vodafone</a>, <a href=\"https://www.hashicorp.com/en/case-studies/deutsche-bank\">Deutsche Bank</a>, <a href=\"https://www.hashicorp.com/en/case-studies/canva\">Canva</a>, and more.</p>\n\n<p>Read our guide on <a href=\"https://www.hashicorp.com/en/on-demand/optimize-whitepaper?utm_source=hashicorp&amp;utm_medium=referral&amp;utm_campaign=26Q3_WW_BDM_COST_how-to-start-consolidating-your-cybersecurity-tools&amp;utm_content=learn-more-conclusion-end-blog-cta&amp;utm_offer=whitepaper\">optimizing cloud operations and ROI</a> to learn how we can consolidate the number of Security Lifecycle Management tools you use.</p>\n\n<p><em>Blog last updated: January 12, 2026</em></p>",
      "tier": "full",
      "selection_reason": "Strategic approach to security tool consolidation",
      "audience_value": "Framework for evaluating and streamlining security infrastructure",
      "urgency_score": 8,
      "category_tag": "🔐 Security"
    },
    {
      "id": "337e5bc28fed8d4c0f95dc57c4537acc",
      "title": "There is no longer any such thing as Computer Security",
      "url": "https://blog.codinghorror.com/there-is-no-longer-any-such-thing-as-computer-security/",
      "published_date": "2026-02-19T06:59:34.257088",
      "description": "<p>Remember &#x201c;cybersecurity&#x201d;?</p><figure class=\"kg-card kg-image-card\"><img alt=\"its-cybersecurity-yay\" class=\"kg-image\" height=\"696\" src=\"https://blog.codinghorror.com/content/images/2018/09/its-cybersecurity-yay.jpg\" width=\"1115\" /></figure><p>Mysterious hooded computer guys doing mysterious hooded computer guy... things! Who knows what kind of naughty digital mischief they might be up to?</p><p>Unfortunately, we now live in a world where this kind of digital mischief is literally rewriting the world&#x2019;s history. For proof</p>",
      "source": "Coding Horror",
      "category": "Developer & Engineering",
      "segment": "builders",
      "source_type": "primary",
      "raw_content": "<img alt=\"There is no longer any such thing as Computer Security\" src=\"https://blog.codinghorror.com/content/images/2025/02/its-cybersecurity-yay.jpg\" /><p>Remember &#x201c;cybersecurity&#x201d;?</p><figure class=\"kg-card kg-image-card\"><img alt=\"There is no longer any such thing as Computer Security\" class=\"kg-image\" height=\"696\" src=\"https://blog.codinghorror.com/content/images/2018/09/its-cybersecurity-yay.jpg\" width=\"1115\" /></figure><p>Mysterious hooded computer guys doing mysterious hooded computer guy... things! Who knows what kind of naughty digital mischief they might be up to?</p><p>Unfortunately, we now live in a world where this kind of digital mischief is literally rewriting the world&#x2019;s history. For proof of that, you need look no further than this single email that was sent March 19th, 2016.</p><figure class=\"kg-card kg-image-card\"><img alt=\"There is no longer any such thing as Computer Security\" class=\"kg-image\" height=\"656\" src=\"https://blog.codinghorror.com/content/images/2018/09/podesta-hack-email-text.png\" width=\"613\" /></figure><p>If you don&#x2019;t recognize what this is, it is a&#xa0;<a href=\"https://blog.codinghorror.com/phishing-the-forever-hack/\">phishing email</a>.</p><figure class=\"kg-card kg-image-card\"><img alt=\"There is no longer any such thing as Computer Security\" class=\"kg-image\" height=\"728\" src=\"https://blog.codinghorror.com/content/images/2025/02/image-31.png\" width=\"1092\" /></figure><p>This is by now a very, very famous phishing email, arguably the most famous of all time. But let&#x2019;s consider&#xa0;how this email even got sent to its target in the first place:</p><ul><li>An attacker slurped up lists of any public emails of 2008 political campaign staffers.</li><li>One 2008 staffer was&#xa0;<em>also</em>&#xa0;hired for the 2016 political campaign.</li><li>That particular staffer had non-public campaign emails in their address book, and one of them was a powerful key campaign member with an extensive email history.</li></ul><p>On successful phish leads to an even wider address book attack net down the line. Once they gain access to a person&#x2019;s inbox, they use it to prepare to their next attack. They&#x2019;ll harvest existing email addresses, subject lines, content, and attachments to construct plausible looking boobytrapped emails and mail them to all of&#xa0;<em>their</em>&#xa0;contacts. How sophisticated and targeted to a particular person this effort is determines whether it&#x2019;s so-called &#x201c;spear&#x201d; phishing or not.</p><figure class=\"kg-card kg-image-card\"><img alt=\"There is no longer any such thing as Computer Security\" class=\"kg-image\" height=\"742\" src=\"https://blog.codinghorror.com/content/images/2018/09/phishing-vs-spear-phishing.png\" width=\"1972\" /></figure><p>In this case is it was not at all targeted. This is a remarkably unsophisticated, absolutely generic routine phishing attack. There is zero focused attack effort on display here. But note the target did&#xa0;<em>not</em>&#xa0;immediately click the link in the email!</p><figure class=\"kg-card kg-image-card\"><img alt=\"There is no longer any such thing as Computer Security\" class=\"kg-image\" height=\"989\" src=\"https://blog.codinghorror.com/content/images/2018/09/podesta-hack-email-link-1.png\" width=\"1696\" /></figure><p>Instead, he did exactly what you&#x2019;d want a person to do in this scenario:&#xa0;<strong>he emailed IT support and asked if this email was valid.</strong>&#xa0;But IT made&#xa0;a <a href=\"https://www.nytimes.com/2016/12/13/us/politics/russia-hack-election-dnc.html\" rel=\"noreferrer\">fatal mistake in their response</a>.</p><figure class=\"kg-card kg-image-card\"><img alt=\"There is no longer any such thing as Computer Security\" class=\"kg-image\" height=\"610\" src=\"https://blog.codinghorror.com/content/images/2018/09/podesta-it-support-response.png\" width=\"1212\" /></figure><p>Do you see it? Here&#x2019;s the kicker:</p><blockquote>Mr. Delavan, in an interview, said that his bad advice was a result of a typo: He knew this was a phishing attack, as the campaign was getting dozens of them. He said&#xa0;<strong>he had meant to type that it was an &#x201c;illegitimate&#x201d; email, an error that he said has plagued him ever since.</strong></blockquote><p>One word. He got&#xa0;<em>one</em>&#xa0;word wrong. But what a word to get wrong, and in the first sentence! The email did provide the proper Google address to reset your password. But the lede was already buried since the first sentence said &#x201c;legitimate;&#x201d; the phishing link in that email was then clicked. And the rest is literally history.</p><p>What&#x2019;s even funnier (well, in the way of gallows humor, I guess) is that public stats were left enabled for that bit.ly tracking link, so you can see exactly what crazy domain that &#x201c;Google login page&#x201d; resolved to, and that it was clicked exactly twice, on the same day it was mailed.</p><figure class=\"kg-card kg-image-card\"><img alt=\"There is no longer any such thing as Computer Security\" class=\"kg-image\" height=\"715\" src=\"https://blog.codinghorror.com/content/images/2018/09/bitly-podesta-tracking-link.png\" width=\"1120\" /></figure><p>As I said, these were not exactly sophisticated attackers. So yeah, in&#xa0;<em>theory</em>&#xa0;an attentive user could pay attention to the browser&#x2019;s address bar and notice that after clicking the link, they arrived at</p><p><code>http://myaccount.google.com-securitysettingpage.tk/security/signinoptions/password</code></p><p>instead of</p><p><code>https://myaccount.google.com/security</code></p><p>Note that the phishing URL is carefully constructed so the most &#x201c;correct&#x201d; part is at the front, and weirdness is sandwiched in the middle. Unless you&#x2019;re paying very close attention and your address bar is long enough to expose the full URL, it&#x2019;s&#x2026; tricky. See this 10 second video for a dramatic example.</p><figure class=\"kg-card kg-video-card kg-width-regular\">\n            <div class=\"kg-video-container\">\n                <video height=\"1080\" poster=\"https://img.spacergif.org/v1/1920x1080/0a/spacer.png\" preload=\"metadata\" src=\"https://storage.ghost.io/c/eb/aa/ebaa2665-01a8-4415-8825-69d1f0e8fd19/content/media/2025/02/twitter-phishing-video.mp4\" width=\"1920\"></video>\n                <div class=\"kg-video-overlay\">\n                    <button class=\"kg-video-large-play-icon\">\n                        <svg viewBox=\"0 0 24 24\" xmlns=\"http://www.w3.org/2000/svg\">\n                            <path d=\"M23.14 10.608 2.253.164A1.559 1.559 0 0 0 0 1.557v20.887a1.558 1.558 0 0 0 2.253 1.392L23.14 13.393a1.557 1.557 0 0 0 0-2.785Z\">\n                        </svg>\n                    </button>\n                </div>\n                <div class=\"kg-video-player-container\">\n                    <div class=\"kg-video-player\">\n                        <button class=\"kg-video-play-icon\">\n                            <svg viewBox=\"0 0 24 24\" xmlns=\"http://www.w3.org/2000/svg\">\n                                <path d=\"M23.14 10.608 2.253.164A1.559 1.559 0 0 0 0 1.557v20.887a1.558 1.558 0 0 0 2.253 1.392L23.14 13.393a1.557 1.557 0 0 0 0-2.785Z\">\n                            </svg>\n                        </button>\n                        <button class=\"kg-video-pause-icon kg-video-hide\">\n                            <svg viewBox=\"0 0 24 24\" xmlns=\"http://www.w3.org/2000/svg\">\n                                <rect height=\"22\" rx=\"1.5\" ry=\"1.5\" width=\"7\" x=\"3\" y=\"1\">\n                                <rect height=\"22\" rx=\"1.5\" ry=\"1.5\" width=\"7\" x=\"14\" y=\"1\">\n                            </svg>\n                        </button>\n                        <span class=\"kg-video-current-time\">0:00</span>\n                        <div class=\"kg-video-time\">\n                            /<span class=\"kg-video-duration\">0:10</span>\n                        </div>\n                        <input class=\"kg-video-seek-slider\" max=\"100\" type=\"range\" value=\"0\" />\n                        <button class=\"kg-video-playback-rate\">1&#xd7;</button>\n                        <button class=\"kg-video-unmute-icon\">\n                            <svg viewBox=\"0 0 24 24\" xmlns=\"http://www.w3.org/2000/svg\">\n                                <path d=\"M15.189 2.021a9.728 9.728 0 0 0-7.924 4.85.249.249 0 0 1-.221.133H5.25a3 3 0 0 0-3 3v2a3 3 0 0 0 3 3h1.794a.249.249 0 0 1 .221.133 9.73 9.73 0 0 0 7.924 4.85h.06a1 1 0 0 0 1-1V3.02a1 1 0 0 0-1.06-.998Z\">\n                            </svg>\n                        </button>\n                        <button class=\"kg-video-mute-icon kg-video-hide\">\n                            <svg viewBox=\"0 0 24 24\" xmlns=\"http://www.w3.org/2000/svg\">\n                                <path d=\"M16.177 4.3a.248.248 0 0 0 .073-.176v-1.1a1 1 0 0 0-1.061-1 9.728 9.728 0 0 0-7.924 4.85.249.249 0 0 1-.221.133H5.25a3 3 0 0 0-3 3v2a3 3 0 0 0 3 3h.114a.251.251 0 0 0 .177-.073ZM23.707 1.706A1 1 0 0 0 22.293.292l-22 22a1 1 0 0 0 0 1.414l.009.009a1 1 0 0 0 1.405-.009l6.63-6.631A.251.251 0 0 1 8.515 17a.245.245 0 0 1 .177.075 10.081 10.081 0 0 0 6.5 2.92 1 1 0 0 0 1.061-1V9.266a.247.247 0 0 1 .073-.176Z\">\n                            </svg>\n                        </button>\n                        <input class=\"kg-video-volume-slider\" max=\"100\" type=\"range\" value=\"100\" />\n                    </div>\n                </div>\n            </div>\n            \n        </figure><p>(<s>And if you think that one&#x2019;s good, check out&#xa0;this one.</s> Don&#x2019;t forget all the Unicode look-alike trickery you can pull, too.) </p><p>I originally wrote this post as a presentation for the Berkeley Computer Science Club back in March, and at that time I gathered a list of public phishing pages I found on the web.</p><p><code>nightlifesofl.com<br />ehizaza-limited.com<br />tcgoogle.com<br />appsgoogie.com<br />security-facabook.com</code></p><p>Of those five examples from 6 months ago, one is completely gone, one loads just fine, and three present an appropriately scary red interstitial warning page that strongly advises you not to visit the page you&#x2019;re trying to visit, courtesy of Google&#x2019;s&#xa0;<a href=\"https://developers.google.com/safe-browsing/\" rel=\"noopener noreferrer\">safe browsing API</a>. But of course this kind of shared blacklist domain name protection will be completely useless on any fresh phishing site. (Don&#x2019;t even get me started on how&#xa0;<a href=\"https://blog.codinghorror.com/blacklists-dont-work/\">blacklists have never really worked</a>&#xa0;anyway.)</p><figure class=\"kg-card kg-image-card\"><img alt=\"There is no longer any such thing as Computer Security\" class=\"kg-image\" height=\"720\" src=\"https://blog.codinghorror.com/content/images/2018/09/google-login-phishing-page.png\" width=\"602\" /></figure><p>It doesn&#x2019;t exactly require a PhD degree in computer science to phish someone:</p><ul><li>Buy a crazy long, realistic looking domain name.</li><li>Point it to a cloud server somewhere.</li><li>Get a free HTTPS certificate courtesy of&#xa0;<a href=\"https://blog.codinghorror.com/lets-encrypt-everything/\">our friends at Let&#x2019;s Encrypt</a>.</li><li>Build a realistic copy of a login page that silently transmits everything you type in those login fields to you &#x2013; perhaps even in real time, as the target types.</li><li>Harvest email addresses and mass mail a plausible looking phishing email with your URL.</li></ul><p>I want to emphasize that although clearly mistakes were made in this specific situation, none of the people involved here were amateurs. They had training and experience. They were working with IT and security professionals. Furthermore, they&#xa0;<a href=\"https://www.apnews.com/dea73efc01594839957c3c9a6c962b8a\" rel=\"noopener noreferrer\">knew digital attacks were incoming</a>.</p><blockquote>The&#x2026; campaign was no easy target; several former employees said the organization put particular stress on digital safety.<br /><br />Work emails were protected by two-factor authentication, a technique that uses a second passcode to keep accounts secure. Most messages were deleted after 30 days and staff went through phishing drills. Security awareness even followed the campaigners into the bathroom, where someone put a picture of a toothbrush under the words: &#x201c;You shouldn&#x2019;t share your passwords either.&#x201d;</blockquote><p>The campaign itself used two factor auth extensively, which is why personal Gmail accounts were targeted, because they were less protected.</p><p>The key takeaway here is that&#xa0;<strong>it&#x2019;s basically impossible, statistically speaking, to prevent your organization from being phished.</strong></p><p>Or is it?</p><figure class=\"kg-card kg-image-card\"><img alt=\"There is no longer any such thing as Computer Security\" class=\"kg-image\" height=\"440\" src=\"https://blog.codinghorror.com/content/images/2025/02/image-32.png\" width=\"440\" /></figure><p>Nobody is doing better work in this space right now than Maciej Ceglowski and Tech Solidarity. Their list of&#xa0;<a href=\"https://techsolidarity.org/resources/basic_security.htm\" rel=\"noopener noreferrer\">basic security precautions</a>&#xa0;for non-profits and journalists is pure gold and has been vetted by many industry professionals with security credentials that are actually impressive, unlike mine. Everyone should read this list very closely, point by point.</p><p>Everyone?</p><p>Computers, courtesy of smartphones, are&#xa0;now such a <a href=\"https://blog.codinghorror.com/can-software-make-you-less-racist/\">pervasive part of average life</a>&#xa0;for average people that&#xa0;<strong>there is no longer any such thing as &#x201c;computer security.&#x201d; There is only&#xa0;<em>security</em>.</strong>&#xa0;In other words, these are normal security practices&#xa0;<em>everyone</em>&#xa0;should be familiar with. Not just computer geeks. Not just political activists and politicians. Not just journalists and nonprofits.</p><figure class=\"kg-card kg-video-card kg-width-regular\">\n            <div class=\"kg-video-container\">\n                <video height=\"338\" poster=\"https://img.spacergif.org/v1/480x338/0a/spacer.png\" preload=\"metadata\" src=\"https://storage.ghost.io/c/eb/aa/ebaa2665-01a8-4415-8825-69d1f0e8fd19/content/media/2025/02/gary-oldman-everyone.mp4\" width=\"480\"></video>\n                <div class=\"kg-video-overlay\">\n                    <button class=\"kg-video-large-play-icon\">\n                        <svg viewBox=\"0 0 24 24\" xmlns=\"http://www.w3.org/2000/svg\">\n                            <path d=\"M23.14 10.608 2.253.164A1.559 1.559 0 0 0 0 1.557v20.887a1.558 1.558 0 0 0 2.253 1.392L23.14 13.393a1.557 1.557 0 0 0 0-2.785Z\">\n                        </svg>\n                    </button>\n                </div>\n                <div class=\"kg-video-player-container\">\n                    <div class=\"kg-video-player\">\n                        <button class=\"kg-video-play-icon\">\n                            <svg viewBox=\"0 0 24 24\" xmlns=\"http://www.w3.org/2000/svg\">\n                                <path d=\"M23.14 10.608 2.253.164A1.559 1.559 0 0 0 0 1.557v20.887a1.558 1.558 0 0 0 2.253 1.392L23.14 13.393a1.557 1.557 0 0 0 0-2.785Z\">\n                            </svg>\n                        </button>\n                        <button class=\"kg-video-pause-icon kg-video-hide\">\n                            <svg viewBox=\"0 0 24 24\" xmlns=\"http://www.w3.org/2000/svg\">\n                                <rect height=\"22\" rx=\"1.5\" ry=\"1.5\" width=\"7\" x=\"3\" y=\"1\">\n                                <rect height=\"22\" rx=\"1.5\" ry=\"1.5\" width=\"7\" x=\"14\" y=\"1\">\n                            </svg>\n                        </button>\n                        <span class=\"kg-video-current-time\">0:00</span>\n                        <div class=\"kg-video-time\">\n                            /<span class=\"kg-video-duration\">0:02</span>\n                        </div>\n                        <input class=\"kg-video-seek-slider\" max=\"100\" type=\"range\" value=\"0\" />\n                        <button class=\"kg-video-playback-rate\">1&#xd7;</button>\n                        <button class=\"kg-video-unmute-icon\">\n                            <svg viewBox=\"0 0 24 24\" xmlns=\"http://www.w3.org/2000/svg\">\n                                <path d=\"M15.189 2.021a9.728 9.728 0 0 0-7.924 4.85.249.249 0 0 1-.221.133H5.25a3 3 0 0 0-3 3v2a3 3 0 0 0 3 3h1.794a.249.249 0 0 1 .221.133 9.73 9.73 0 0 0 7.924 4.85h.06a1 1 0 0 0 1-1V3.02a1 1 0 0 0-1.06-.998Z\">\n                            </svg>\n                        </button>\n                        <button class=\"kg-video-mute-icon kg-video-hide\">\n                            <svg viewBox=\"0 0 24 24\" xmlns=\"http://www.w3.org/2000/svg\">\n                                <path d=\"M16.177 4.3a.248.248 0 0 0 .073-.176v-1.1a1 1 0 0 0-1.061-1 9.728 9.728 0 0 0-7.924 4.85.249.249 0 0 1-.221.133H5.25a3 3 0 0 0-3 3v2a3 3 0 0 0 3 3h.114a.251.251 0 0 0 .177-.073ZM23.707 1.706A1 1 0 0 0 22.293.292l-22 22a1 1 0 0 0 0 1.414l.009.009a1 1 0 0 0 1.405-.009l6.63-6.631A.251.251 0 0 1 8.515 17a.245.245 0 0 1 .177.075 10.081 10.081 0 0 0 6.5 2.92 1 1 0 0 0 1.061-1V9.266a.247.247 0 0 1 .073-.176Z\">\n                            </svg>\n                        </button>\n                        <input class=\"kg-video-volume-slider\" max=\"100\" type=\"range\" value=\"100\" />\n                    </div>\n                </div>\n            </div>\n            \n        </figure><p><em>Everyone.</em></p><p>It is a fair bit of reading, so because I know you are just as lazy as I am, and I am&#xa0;<em>epically</em>&#xa0;lazy, let me summarize what I view as the three important takeaways from the hard work Tech Solidarity put into&#xa0;<a href=\"https://techsolidarity.org/resources.html\" rel=\"noopener noreferrer\">these resources</a>. These three short sentences are the 60 second summary of what you want to do, and what you want to share with others so&#xa0;<em>they</em>&#xa0;do, too.</p><p><strong>1) Enable Two Factor authentication through an app, and&#xa0;<em>not SMS</em>, everywhere you can.</strong></p><figure class=\"kg-card kg-image-card\"><img alt=\"There is no longer any such thing as Computer Security\" class=\"kg-image\" height=\"481\" src=\"https://blog.codinghorror.com/content/images/2018/09/google-2fa-1.png\" width=\"566\" /></figure><p>Logging in with only a password, now matter how long and unique you attempt to make that password, will never be enough. A password is what you know; you need to add the second factor of something you&#xa0;<em>have</em>&#xa0;(or something you&#xa0;<em>are</em>) to achieve significant additional security. <a href=\"https://www.wired.com/story/phone-numbers-indentification-authentication/\" rel=\"noreferrer\">SMS can famously&#xa0;be intercepted</a>, social engineered, or sim-jacked all too easily. If it&#x2019;s SMS, it&#x2019;s not secure,&#xa0;<em>period</em>. So install an authenticator app, and use it, at least for your most important credentials such as your email account and your bank.</p><p>Have I mentioned that Discourse&#xa0;added <a href=\"https://blog.discourse.org/2018/05/discourse-2-0-released/\" rel=\"noopener noreferrer\">two factor authentication support</a> in version 2.0, and our just released 2.1 adds printed backup codes, too? There are two paths forward: you can&#xa0;<em>talk</em>&#xa0;about the solution, or you can&#xa0;<em>build</em>&#xa0;the solution. I&#x2019;m trying to do both to the best of my ability. Look for the 2FA auth option in your user preferences on your favorite Discourse instance. It&#x2019;s there for you.</p><p>(This is also a company policy at Discourse; if you work here,&#xa0;<em>you 2FA everything all the time</em>. No other login option exists.)</p><p><strong>2) Make all your passwords 11 characters or more.</strong></p><p>It&#x2019;s <a href=\"https://blog.codinghorror.com/hacker-hack-thyself/\">a long story</a>, but anything under 11 characters&#xa0;is basically the <a href=\"https://blog.codinghorror.com/your-password-is-too-damn-short/\" rel=\"noreferrer\">same as having no password</a> at all&#xa0;these days. I personally recommend at least 14 characters, maybe even 16. But this won&#x2019;t be a problem for you, because...</p><p><strong>3) Use a password manager.</strong></p><p>If you use a password manager, you can simultaneously avoid the pernicious danger of password re-use and&#xa0;the difficulty of coming up with <a href=\"https://blog.codinghorror.com/password-rules-are-bullshit/\">unique and random passwords</a>&#xa0;all the time. It is my hope in the long run that cloud based password management gets deeply built into Android, iOS, OSX, and Windows so that people don&#x2019;t need to run a weird m&#xe9;lange of third party apps to achieve this essential task. Password management is foundational and should not be the province of third parties on principle, because you never outsource a core competency.</p><p><strong>Bonus rule! For the particularly at-risk, get and use a U2F key.</strong></p><p>In the long term, two factor through an app isn&#x2019;t quite secure enough due to the very real (and growing) specter of real-time phishing. Authentication apps offer timed keys that expire after a minute or two, but if the attacker can get you to type an authentication key and relay it to the target site fast enough, they can still log in as you. If you need ultimate protection,&#xa0;look into <a href=\"https://en.wikipedia.org/wiki/Universal_2nd_Factor\" rel=\"noopener noreferrer\">U2F keys</a>.</p><figure class=\"kg-card kg-image-card\"><img alt=\"There is no longer any such thing as Computer Security\" class=\"kg-image\" height=\"720\" src=\"https://blog.codinghorror.com/content/images/2018/09/u2f-keys.jpg\" width=\"720\" /></figure><p>I believe U2F support is still too immature at the moment, particularly on mobile, for this to be practical for the average person right now. But if you do happen to fall into those groups that will be under attack, you&#xa0;<em>absolutely</em>&#xa0;want to set up U2F keys where you can today. They&#x2019;re cheap, and the good news is that they&#xa0;<em>literally make phishing impossible</em>&#xa0;at last. Given that Google had&#xa0;100% company-wide <a href=\"https://krebsonsecurity.com/2018/07/google-security-keys-neutralized-employee-phishing/\" rel=\"noopener noreferrer\">success against phishing with U2F</a>, we know this works.</p><p>In today&#x2019;s world, computers are now so omnipresent that there is no longer any such thing as cybersecurity, online security, or computer security &#x2013; there&#x2019;s only&#xa0;<em>security</em>. You either have it, or you don&#x2019;t. If you follow and share these three rules, hopefully you too can have a modicum of security today.</p>",
      "tier": "full",
      "selection_reason": "Breakthrough in open-source AI tools for research",
      "audience_value": "New capabilities for automated literature review and citation",
      "urgency_score": 9,
      "category_tag": "🚀 AI & Innovation"
    },
    {
      "id": "00d47c7482b5edd3ba93c2d2daa66c17",
      "title": "How to train a new language model from scratch using Transformers and Tokenizers",
      "url": "https://huggingface.co/blog/how-to-train",
      "published_date": "2026-02-19T06:59:31.218887",
      "description": "",
      "source": "Hugging Face - Blog",
      "category": "ML Community & Tools",
      "segment": "innovators",
      "source_type": "primary",
      "raw_content": "",
      "tier": "quick",
      "selection_reason": "Technical guide for custom LLM training",
      "audience_value": "Practical implementation details for ML teams",
      "urgency_score": 7,
      "category_tag": "🚀 AI & Innovation"
    },
    {
      "id": "78b038b0ef44b636f59c1621cab0b756",
      "title": "How to generate text: using different decoding methods for language generation with Transformers",
      "url": "https://huggingface.co/blog/how-to-generate",
      "published_date": "2026-02-19T06:59:31.218865",
      "description": "",
      "source": "Hugging Face - Blog",
      "category": "ML Community & Tools",
      "segment": "innovators",
      "source_type": "primary",
      "raw_content": "",
      "tier": "quick",
      "selection_reason": "Advanced text generation techniques guide",
      "audience_value": "Implementation strategies for language generation",
      "urgency_score": 7,
      "category_tag": "🚀 AI & Innovation"
    },
    {
      "id": "189688759d9bddfbb4001c307e8f0b97",
      "title": "PlanetScale migrates open source Vitess test suite from Python to Go",
      "url": "https://planetscale.com/blog/planetscale-migrates-open-source-vitess-test-suite-from-python-to-go",
      "published_date": "2026-02-19T06:59:41.764466",
      "description": "It’s easier than ever to contribute to Vitess. The test suite migration from Python to golang makes Vitess more developer friendly.",
      "source": "Blog — PlanetScale",
      "category": "Database & Backend",
      "segment": "builders",
      "source_type": "primary",
      "raw_content": "Over the last three quarters, the team at PlanetScale has focused on the dual goals of making open source Vitess easy to use and easy to contribute to. A part of this effort was a migration of all the integration tests written in Python to Go.\nThere were several reasons for this project:\nThe Python tests were very time-consuming to develop and debug.\nThe Python tests added additional install dependencies for anyone getting started as a contributor.\nSupport for the Python version being used (2.7) ended on January 1, 2020.\nThis was a fairly massive project that required several people working on it for almost four months. The project was started around November 1, 2019 and completed on February 25, 2020. There were 197 separate integration tests in 39 files that had to be migrated. In terms of LOC, it was over 24,000 lines of Python code.\nIn order to accomplish the migration, we first built a test framework in Go (using the command and testing packages) that allowed us to start a Vitess cluster and interact with it programmatically. The framework had to support running multiple tests in parallel without port conflicts; create non-conflicting working directories for all the relevant processes; log sufficient information to enable failure diagnosis, etc. Once that was done, it was a matter of translating Python tests into the equivalent Go code.\nAlong the way, we were also able to improve the CI pipeline for Vitess. While Travis CI has served us well over the years, we saw an opportunity to switch to GitHub actions. The advantages?\nLarger compute+memory instance types. While Travis CI (and Circle CI for that matter) will provide you with larger instances on paid plans, we really wanted to stay within the free tier so that contributors could run with the same technologies and experience as the core project. Larger sizes are important for Vitess, since the test suite can launch 6 or more instances of mysqld.\nNo limit of 5 concurrent jobs. We were using Travis matrix builds for a purpose they weren’t designed for — to split 2 hrs and 30 minutes of testing into 5 “shards” of 30 minutes. That meant that we could only effectively have one concurrent job, and during peak periods there could be a delay of an hour or more to have test suite results. Our new GitHub actions configuration still uses shards, but now with over 14 of them. We are also no longer blocked by other developers running CI tasks at the same time.\nThe end result of the project is that it is now much easier and faster to develop new integration tests. It is also easier for someone new to the project to get started. The CI changes give us quicker feedback on pull requests and increase throughput on pull requests.\nTo learn more, join the Vitess Slack channel and attend the next monthly open meeting on Thursday, March 19 to hear Arindam Nayak talk about this project in detail. The meeting details can be found in the Vitess Slack channel.",
      "tier": "quick",
      "selection_reason": "Major test suite migration in critical database infrastructure",
      "audience_value": "Insights into modernizing legacy test infrastructure",
      "urgency_score": 7,
      "category_tag": "☁️ Enterprise Tech"
    },
    {
      "id": "b2534cd57fc06b33e1079b9f2a2ed01a",
      "title": "Announcing Vitess 7",
      "url": "https://planetscale.com/blog/announcing-vitess-7",
      "published_date": "2026-02-19T06:59:41.764350",
      "description": "On behalf of the Vitess maintainers team, I am pleased to announce the general availability of Vitess 7. Major themes include improved SQL support as we continue to progress towards (almost) full MySQL compatibility.",
      "source": "Blog — PlanetScale",
      "category": "Database & Backend",
      "segment": "builders",
      "source_type": "primary",
      "raw_content": "On behalf of the Vitess maintainers team, I am pleased to announce the general availability of Vitess 7.\nMajor Themes\nImproved SQL Support\nWe continued to progress towards (almost) full MySQL compatibility. The highlights in Vitess 7 are replica transactions, savepoint support, and the ability to set system variables per session. We expect to continue down this path for Vitess 8.\nStability\nVitess had accumulated significant technical debt due to functionality that was added organically over time. Some parts of the code had become unmaintainable. In this release, VTGate's healthcheck and VTTablet's tabletserver and tabletmanager have been rewritten. These rewrites have already paid dividends. Replica transaction support and system variable support are built on the foundation of the new healthcheck and tabletserver. The VTTablet rewrites are expected to facilitate several new features in upcoming releases.\nInnovation\nVitess 7 adds ease-of-use and many new features built on top of VReplication. VStream Copy allows streaming of entire tables or databases, thus enabling change data capture applications. Schema Versioning enables correct handling of binlog events on replication streams based on older versions of the schema. VExec and Workflow commands make it possible to manage vreplication workflows without manual edits to metadata. A novel framework has been built to allow dedicated connections alongside connection pooling. Locks and system variables have been implemented using this framework.\nTutorials\nVitess 7 adds three new tutorials to the documentation. We have added a tutorial that demonstrates how to use the open source vitess-operator from PlanetScale, a tutorial for region-based sharding, and one for a local Docker installation.\nThere is a short list of incompatible changes in this release. We encourage you to spend a moment reviewing the release notes.\nPlease download Vitess 7 and try it out!",
      "tier": "quick",
      "selection_reason": "Major database platform update announcement",
      "audience_value": "New SQL capabilities and compatibility improvements",
      "urgency_score": 7,
      "category_tag": "☁️ Enterprise Tech"
    },
    {
      "id": "66aabcce6b07d5f6a22f71a25ded296a",
      "title": "Big Breach or Smooth Sailing? Mexican Gov't Faces Leak Allegations",
      "url": "https://www.darkreading.com/cyberattacks-data-breaches/big-breach-or-nada-de-nada-mexican-govt-faces-leak-allegations",
      "published_date": "2026-02-19T06:59:23.150865",
      "description": "A hacktivist group claims a 2.3-terabyte data breach exposes the information of 36 million Mexicans, but no sensitive accounts are at risk, says government.",
      "source": "darkreading",
      "category": "Cybersecurity",
      "segment": "leaders",
      "source_type": "secondary",
      "raw_content": "A hacktivist group claims a 2.3-terabyte data breach exposes the information of 36 million Mexicans, but no sensitive accounts are at risk, says government.",
      "tier": "trending",
      "selection_reason": "Major government data breach investigation",
      "audience_value": "Lessons for large-scale data security",
      "urgency_score": 8,
      "category_tag": "🔐 Security"
    }
  ]
}